 -----------(0目前的动画方式,1新的)
animationMode = 1

-------------(内存是否充足，用于释放内存控制)
phoneMemoryEnough = true

------------(待机是否自由移动)
fightingMoveMode = 1 ---(0移动,1固定不移动)

___is_open_leadname = true   --  开启主角名称使用系统字库(繁体)

-----------------------连击条绘制坐标(X,Y，正右，负左，正上，负下)
qtePosition = {
	"536,370",----------------1
	"556,290",----------------2
	"536,220",----------------3
	"636,370",----------------4
	"656,290",----------------5
	"636,220",----------------6
	"556,290",----------------默认位
}

-------------------------资源抢夺初始坐标(X,Y)
capture_resource = {
	"0,784",----------------(第一排第一个点)(左上角为第一排)
    "-220,672",----------------(第二排第一个点)
}

----------------等级奖励(领取等级,奖励类型,奖励ID,奖励数量)
levelReward = {
	"6,7,13,1",------------------------七星宝刀
	"16,6,73,1",-----------------------橙色忍者卡
	"20,2,-1,1000",--------------------1000金币
}
----------------等级奖励开关(0关闭，1开启)
levelRewardMode = 1

-----------------------男女主角普攻光效ID
user_skill_effic_id = {
327,
214,
}


-----------------------男女主角默认语音ID
user_voice_id = {
55013,
55113,
}

---------------------------成就分页(分页名称，分页图标索引，是否显示(0显示，-1不显示))
achieveName = {
	{"冲级达人",11,0,1},----------------1
	{"完美通关",1,0,2},-----------------2
	{"战力提升",3,0,3},-----------------3
	{"战力爆表",3,-1,4},-----------------4
	{"特权在手",13,0,5},-----------------5
	{"神兵利器",5,0,6},-----------------6
	{"宝物秘笈",4,0,7},-----------------7
	{"最强阵容",12,0,8},-----------------8
	{"荡平罗刹",9,0,9},-----------------9
	{"无之境地",6,0,10},-----------------10
	{"拔刀相助",7,-1,11},-----------------11
	{"惩恶扬善",9,0,12},-----------------12
	{"攒星达人",10,-1,13},-----------------13
	{"跃迁之力",6,-1,14},-----------------14
	{"精英通关",1,-1,15},-----------------15
}

-- 下载更新包提示
update_download_info = "正在玩命更新%s资料"

--------------------------------------------抢夺战斗背景音乐
battle_fight_type_10_bg_music = 2
--------------------------------------------演武场战斗背景音乐
battle_fight_type_11_bg_music = 2

spineAnimations = {
	"00_daiji",-----------------------待机			0
	"01_qianchong",-------------------前冲			1
	"02_huichong",--------------------回冲			2
	"01_qianchong",-------------------前冲			3
	"00_daiji",-----------------------待机			4
	"03_beiji",-----------------------被击			5
	"03_beiji",-----------------------被击			6
	"04_kbeiji",----------------------空中被击		7
	"04_kbeiji",----------------------空中被击		8
	"02_huichong",--------------------回冲			9
	"05_xuanyun",---------------------眩晕			10
	"06_siwang",----------------------死亡			11
	"06_siwang",----------------------死亡			12
	"06_siwang",----------------------死亡			13
	"07_pugong",----------------------普攻			14
	"08_jineng",----------------------技能			15
	"12_heti",------------------------合击			16
	"00_daiji",-----------------------待机			17
	"01_qianchong",-------------------前冲			18
	"11_xialuo",----------------------下落			19
	"00_daiji",-----------------------待机			20
	"01_qianchong",-------------------前冲			21
	"02_huichong",--------------------回冲			22
	"02_huichong",--------------------回冲			23
	"00_daiji",-----------------------待机			24
	"09_kzputong",--------------------空中/对空普攻	25
	"10_kzjineng",--------------------空中/对空技能	26
	"28_ddsiwang",--------------------倒地死亡		27
	"31_ji1",-------------------------单体技能		28
	"32_ji2",-------------------------一列技能		29
	"33_ji3",-------------------------横排技能		30
	"34_ji4",-------------------------全体技能		31
	"35_ji5",-------------------------加血技能		32
	"36_ji1",-------------------------空中单体技能	33
	"37_ji2",-------------------------空中一列技能	34
	"38_ji3",-------------------------空中横排技能	35
	"39_ji4",-------------------------空中全体技能	36
	"40_ji5",-------------------------空中加血技能	37
	"13_jueji",-----------------------绝技攻击		38
	"29_daodi",-----------------------浮空倒地		39
}

effectAnimations = {
	"animation",
	"animation2",
	"animation3",
}


npcAnimationsNew = {
	"animation1",
	"animation2",
	"animation3",
	"animation4",
	"animation5",
	"animation6",
	"animation7",
	"animation8",
	"animation9",
	"animation10",
}

npcAnimations = {
	"animation_standby",
	"animation_click",
}

---------------------------------------合体技图标的动画参数
fight_heti_icon_precent = {
	"0,0",
	"0.9,22",
	"1,42",
	"0.85,68",
	"0,0",
}

-- talking data app_id
jttd_app_id = "C042F20ACC52530B739322FCCBABC000"

-- 七日活动奖励的忍者信息
_seven_day_activity_reward_hero_ids = {
    232, -- 韦陀
    364, -- 烈阳神 
    485, -- 剑魔连城
    573, -- 金鹏
}

-- 龙虎门的项目中添加镜头的控制参数(人物横向间距，人物纵向间距，背景缩放比例，远景缩放比例，地表缩放比例，近景缩放比例)
_camera_controller = {
	--{_half_width = 400, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1, _far_view_scale=1.199578, _earth_view_scale=1.498681, _near_view_scale=1.996485}, ----------角色150%
	--{_half_width = 560, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1, _far_view_scale=1.110459, _earth_view_scale=1.248352, _near_view_scale=1.425345}, ----------角色125%
	--{_half_width = 640, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.1, _far_view_scale=1.044118, _earth_view_scale=1.092308, _near_view_scale=1.145161}, --------角色110%
	--{_half_width = 660, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.09, _far_view_scale=1.036496, _earth_view_scale=1.075758, _near_view_scale=1.118110}, -------角色107.5%
	--{_half_width = 680, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.08, _far_view_scale=1.024346, _earth_view_scale=1.049908, _near_view_scale=1.076777}, -------角色105%
	--{_half_width = 700, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.07, _far_view_scale=1.012478, _earth_view_scale=1.025271, _near_view_scale=1.038391}, -------角色102.5%
	--{_half_width = 720, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.06, _far_view_scale=1.000000, _earth_view_scale=1.000000, _near_view_scale=1.000000}, ---------角色100%
	--{_half_width = 880, _half_height = 360, _move_height=240*1.25, _width = 2272, _height = 1280, _background_scale=1.05, _far_view_scale=0.922827, _earth_view_scale=0.856712, _near_view_scale=0.799437}, ---------角色85%
	--{_half_width = 1040, _half_height = 580, _move_height=240*1.00, _width = 2272, _height = 1280, _background_scale=1.04, _far_view_scale=0.856712, _earth_view_scale=0.749340, _near_view_scale=0.665885}, --------角色75%
	{_half_width = 720, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.06, _far_view_scale=1.000000, _earth_view_scale=1.000000, _near_view_scale=1.000000}, ---------角色100%
	{_half_width = 880, _half_height = 360, _move_height=240*1.25, _width = 2272, _height = 1280, _background_scale=1.05, _far_view_scale=0.922827, _earth_view_scale=0.856712, _near_view_scale=0.799437}, ---------角色85%
	{_half_width = 1040, _half_height = 580, _move_height=240*1.00, _width = 2272, _height = 1280, _background_scale=1.04, _far_view_scale=0.856712, _earth_view_scale=0.749340, _near_view_scale=0.665885}, --------角色75%
	{_half_width = 1200, _half_height = 600, _move_height=240*0.75, _width = 2272, _height = 1280, _background_scale=1.03, _far_view_scale=0.798875, _earth_view_scale=0.665105, _near_view_scale=0.569709}, --------角色66%
	{_half_width = 1360, _half_height = 820, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.02, _far_view_scale=0.748353, _earth_view_scale=0.597895, _near_view_scale=0.497809}, --------角色60%
	{_half_width = 1680, _half_height = 820, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.01, _far_view_scale=0.666667, _earth_view_scale=0.500000, _near_view_scale=0.400000}, --------角色50%
	{_half_width = 2272, _half_height = 1280, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.1, _far_view_scale=0.666667, _earth_view_scale=0.500000, _near_view_scale=0.400000}, --------角色50%
}

-- 战斗控制参数
_battle_controller = {
	_role_movd_smallest_distance = 10, --角色发动攻击需要移动到目标点时，与目标点距离大于此像素才调用移动动作，否则直接发动攻击
	_draw_hit_damage_duration = 2, --绘制连击数的等待时间(秒)
	_melee_hit_distance = 2, --1格为80像素，此距离表示多少格1就是1格，0.5就是半格
	_random_move_time = {0.0, 0.0, 0.0, 0.0}, --同时出手随机值(用于拉开攻击时间差)
	_explode_effice_id = 777, --终结一击炸开光效的ID
	_dead_effice_id = 199, --角色死亡光效的ID
	_vertigo_effice_id = -1, -- 52, --角色眩晕光效的ID
	_invincible_effice_id = -1, -- 54, --角色无敌，增加防御光效的ID
	_burn_effice_id = -1, -- 51, --角色燃烧光效的ID
	_poisoning_effice_id = -1, -- 53, --角色中毒光效的ID
	_back_jump_distance = 160, --闪避时后跳的距离(像素)
	_back_base_pos_distance = 560,--被击方剩余阵营区域范围
	_back_base_pos_cell_distance = 240,--多段返回出生点的距离
	_back_base_pos_wait_time = 0.1,--多段返回出生点的等待时间(秒)
	_camp_space = 120,--阵营间的间距
	_camp_attack_space = 160,--角色攻击的活动间距
	_back_base_pos_start_min_wait_time = 100,--战斗开始时移动启动的随机时间最小值(毫秒)
	_back_base_pos_start_max_wait_time = 500, --战斗开始时移动启动的随机时间最大值(毫秒)
	_back_base_pos_moving_min_wait_time = 100,--战斗中时移动启动的随机时间最小值(毫秒)
	_back_base_pos_moving_max_wait_time = 100,--战斗中时移动启动的随机时间最大值(毫秒)
	_shadow_max_height = 300,--投影最大显示高度，到达这个高度会全透明显示
	_shadow_max_proportion = 50,--投影的最大放大比例(%)，到达最高点会放大到这个比例
	_air_pursuit_min_height = 50,--空中追击最低高度限制，目标超过此高度才会调用25，26空中攻击动作
	_air_hurt_min_height = 10,--浮空被击动作调用的最低高度限制，目标超过此高度才会调用空中被击动作
	_air_pursuit_change_posX = 0,--空中追击，追击者位置修正偏移值(X)
	_air_pursuit_change_posY = 0,--空中追击，追击者位置修正偏移值(Y)
	_byattck_flight_height = 1000,--------浮空高度上限(基于出生点)
	_byattck_flight_width = 200,--------击飞距离上限(基于出生点)
	_screen_scale_min = 0.8,------------------镜头拉远最大限制(地图大小：100%=1，80%=0.8)
	_solid_position = {fwin._height / 2, fwin._height / 4, 0}, ---------------镜头缩放的基准点(左上,中，左下)
	_rebound_distance = 0,--------------------------版边反弹距离
}


-- 跑动距离与速度控制
_run_controller = {
	{_run_distance = 0 , _run_time = 0.0}, --单位：像素，秒
	{_run_distance = 40, _run_time = 0.2}, --单位：像素，秒
	{_run_distance = 60, _run_time = 0.22}, --单位：像素，秒
	{_run_distance = 80, _run_time = 0.24}, --单位：像素，秒
	{_run_distance = 100, _run_time = 0.26}, --单位：像素，秒
	{_run_distance = 120, _run_time = 0.28}, --单位：像素，秒
	{_run_distance = 140, _run_time = 0.30}, --单位：像素，秒
	{_run_distance = 160, _run_time = 0.32}, --单位：像素，秒
	{_run_distance = 180, _run_time = 0.34}, --单位：像素，秒
	{_run_distance = 200, _run_time = 0.36}, --单位：像素，秒
	{_run_distance = 220, _run_time = 0.38}, --单位：像素，秒
	{_run_distance = 240, _run_time = 0.40}, --单位：像素，秒
	{_run_distance = 260, _run_time = 0.42}, --单位：像素，秒
	{_run_distance = 280, _run_time = 0.44}, --单位：像素，秒
	{_run_distance = 300, _run_time = 0.46}, --单位：像素，秒
	{_run_distance = 320, _run_time = 0.48}, --单位：像素，秒
	{_run_distance = 340, _run_time = 0.50}, --单位：像素，秒
	{_run_distance = 360, _run_time = 0.52}, --单位：像素，秒
	{_run_distance = 380, _run_time = 0.54}, --单位：像素，秒
	{_run_distance = 400, _run_time = 0.56}, --单位：像素，秒
	{_run_distance = 99999, _run_time = 0.56}, --单位：像素，秒
}


-- 所有tip信息内容
_All_tip_string_info = {
	_warriorName = "忍者",
	_energyName = "体力", -- 体力
	_fuelName = "精力", --精力/精力
	_fundName = "铜币",
	_crystalName = "金币",
	_fetterName = "羁绊",
	_decomposeName = "回收",
	_rebirthName = "退化",
	_wrestleName = "演武场",
	_recruitPropName = "普通招募书",
	_expPropName = "金经验兽",
	_fuelPropName = "体力丸",
	_expName = "队伍经验",
	_reputation = "演武币",
	_equip = "装备",
	_treasure = "宝物",
	_glories = "试炼币",
	_soulName = "天赋点",
	_destiny = "晶片",--天命
	_hero = "天赋点",
	_exploit = "试炼币",
	_union_exploit = "组织币",
	_winName= "胜点",
	_integralName= "积分",
	_arena= "擂台赛奖励",
	_juexingsuipian = "觉醒碎片",
	_matrix_essence = "手印碎片",
	_skinName = "分支进化",
	_explore_money = "探索币",
	_holy_essence = "宝物精华",
}


--------------资源获取途径
user_resource_info = {
	_silver_to_get_index = {306,307,308,309,310},----------------铜币
	_reputation_to_get_index = {125},------------声望
	_glories_to_get_index = {126},---------------荣誉
	_soul_to_get_index = {123,124},------------------兽魂
	_exploit_to_get_index = {127},---------------战功
	_hero_to_get_index = {306,307,308,309,310},------------------将魂
}


-- 月卡显示信息
_month_card_tip = {
	"立即获得%d金币，连续%d天每天可领取%d金币%s！",
	"每天可领取%d金币%s，剩余%d天",
	"恭喜您购买%d圆月卡成功！\r\n每日都可以领取免费资源哟！",
	"领取成功，恭喜您获得%d金币%s！",
}

-- 所有tip信息内容描述
_All_tip_string_info_description = {
	_warriorNameDescription = "忍者",
	_divineNameDescription = "灵异探险",
	_energyNameDescription = "挑战关卡需要消耗体力",
	_fuelNameDescription = "精力",
	_fundNameDescription = "游戏中的主要货币",---------------------------------【数码宝贝】铜币描述
	_crystalNameDescription = "世间万物皆可明码标价",------------------------------【数码宝贝】金币描述
	_soulJadeNameDescription = "分解忍者可获得兽魂，可在神秘商店兑换稀有道具",---------------将魂描述
	_steelSoulNameDescription = "兽魂",
	_strengthNameDescription = "物防",
	_defenseNameDescription = "术防",
	_fetterNameDescription = "羁绊",
	_decomposeNameDescription = "回收",
	_rebirthNameDescription = "退化",
	_wrestleNameDescription = "演武场",
	_machineryPagodaNameDescription = "地狱之门",
	_duelNameDescription = "决斗",
	_silverBossNameDescription = "黄金大虚",
	_recruitLevelOneDescription = "普通招募",
	_recruitLevelTwoDescription = "高级招募",
	_recruitLevelThreeDescription = "阵营招募",
	_recruitPropNameDescription = "普通招募书",
	_expPropNameDescription = "金经验兽",
	_fuelPropNameDescription = "体力丸",
	_expNameDescription = "队伍经验",
	_reputationDescription = "演武场获得，用于演武商店购买道具",----------------【数码宝贝】竞技币描述
	_equipDescription = "装备",
	_treasureDescription = "宝物",
	_gloriesDescription = "忍者试炼获得，用于试炼商店购买道具",-----------------------【数码宝贝】试炼币描述
	_lackHeadtip= "缺少上阵忍者！",
	_equip= "分解装备可获得荣誉，可在装备商店兑换稀有道具",
	_exploitDescription= "光丘守护后可获得功勋，用于在战功商店进行消费",
	_unionDescription= "用于在组织商店兑换资源",
	_winNameDescription= "通过跨服擂台赛获得，可在胜点商店兑换稀有忍者和道具",-----------------------胜点描述
	_integralNameDescription= "通过跨服擂台赛获得，可在积分商店兑换稀有忍者和道具",-----------------------积分描述
	_arenaDescription= "打开有惊喜！",-----------------------擂台赛奖励描述
	_talentPointTip= "可用于提升天赋等级",-----------------------【数码宝贝】天赋点描述
	_vipExpDescription = "用于提升VIP等级",----------------------【数码宝贝】VIP经验描述
	_mineralDescription = "跨服资源战特定产出资源，可用于稀有资源的购买",----------------------【数码宝贝】矿石描述
	_AwakeningDebrisDescription = "每开启一个武器宝箱可获得1个觉醒碎片，可在觉醒碎片兑换活动中兑换其他道具。",----------------------【数码宝贝】觉醒碎片描述
	_AlloyMatrixJHDescription = "手印分解后得到，用于升级手印.",----------------------【数码宝贝】合金精华
	_explore_money_description = "用于探索商店兑换道具",----------------------【数码宝贝】探索币
	_holy_essence_description = "用于档岛中的冒险家宝物养成，可以提升玩家能力",----------------------【数码宝贝】圣物精华
}
--数码魂
_supernaturalSoul = "分解跃迁道具可获得忍者魂，可在跃迁商店兑换跃迁道具"


-- VIP特权说明文字
_vip_privilege_info = {
	privilege_one = "累计储值%|1|60%金币即可享受该特权\r\nV1首储大礼包：%|1|升级礼包%\r\n每天可购买体力%|1|3%次\r\n每日可使用摇钱之术%|1|5%次\r\n每天重置精英关卡次数%|1|1%次,",
	privilege_two = "累计储值%|1|300%金币即可享受该特权\r\nV2超值大礼包：%|1|装备钥匙（有机会获得稀有装备材料）%\r\n可以启动%|1|月卡%福利，启动后能在每日活动中领取%|1|100金币福利（31天）%\r\n每天可购买体力%|1|4%次\r\n每日可使用摇钱之术%|1|7%次\r\n每天重置精英关卡次数%|1|2%次\r\n包含V1所有内容,",
	privilege_three = "累计储值%|1|600%金币即可享受该特权\r\nV3超值大礼包：%|1|16资质宇智波鼬%\r\n%|1|技能点恢复时间降至1分钟/点%\r\n每日体力购买次数：%|1|5%\r\n每日摇钱树次数：%|1|9%\r\n精英副本重置次数：%|1|2%\r\n解锁战斗速度%|1|x4%\r\n包含V2所有奖励",
	privilege_four = "累计储值%|1|1000%金币即可享受该特权\r\nV4超值大礼包：%|1|16资质宇智波鼬专属指环、专属卷轴%\r\n可启动%|1|金币月卡%，启动后可在每日任务中领取%|1|100金币（31天）%\r\n%|1|开启主线副本扫荡10次%\r\n每日体力购买次数：%|1|6%\r\n每日摇钱树次数：%|1|12%\r\n精英副本重置次数：%|1|2%\r\n战斗外游戏速度%|1|x1.25%（可在设定中关闭）\r\n包含V3所有奖励",
	privilege_five = "累计储值%|1|2000%金币即可享受该特权\r\nV5超值大礼包：%|1|16资质宇智波鼬碎片%\r\n开启每日任务：%|1|返利（金币返利）%\r\n每日体力购买次数：%|1|7%\r\n每日摇钱树次数：%|1|16%\r\n精英副本重置次数：%|1|3%\r\n%|1|开启演武跳过战斗功能，无冷却时间%\r\n%|1|开启研究所至尊捐献%\r\n包含V4所有奖励",
	privilege_six = "累计储值%|1|3000%金币即可享受该特权\r\nV6超值大礼包：%|1|16资质宇智波鼬专属武器%\r\n%|1|开启主线副本扫荡50次%\r\n%|1|演武战败积分+2%\r\n每日体力购买次数：%|1|8%\r\n每日摇钱树次数：%|1|20%\r\n精英副本重置次数：%|1|3%\r\n解锁战斗速度%|1|x5%\r\n包含V5所有奖励",
	privilege_seven = "累计储值%|1|5000%金币即可享受该特权\r\nV7超值大礼包：%|1|17资质死门 - 凯碎片%\r\n%|1|忍者试炼积分+10％%\r\n每日体力购买次数：%|1|9%\r\n每日摇钱树次数：%|1|25%\r\n精英副本重置次数：%|1|3%\r\n包含V6所有奖励",
	privilege_eight = "累计储值%|1|7000%金币即可享受该特权\r\nV8超值大礼包：%|1|17资质死门 - 凯专属指环和卷轴%\r\n开启每日任务：每日体力购买次数：%|1|10%\r\n每日摇钱树次数：%|1|30%\r\n精英副本重置次数：%|1|3%\r\n演武战斗冷却时间降至%|1|2%分钟\r\n开启每日任务%|1|每日礼物：武器宝箱钥匙*1%\r\n战斗外游戏速度%|1|x1.5%（可在设定中关闭）\r\n包含V7所有奖励",
	privilege_nine = "累计储值%|1|10000%金币即可享受该特权\r\nV9超值大礼包：%|1|17资质死门 - 凯碎片和培养材料%\r\n%|1|技能点恢复时间：5秒/点%\r\n每日体力购买次数：%|1|11%\r\n每日摇钱树次数：%|1|35%\r\n精英副本重置次数：%|1|3%\r\n包含V8所有奖励",
	privilege_ten = "累计储值%|1|15000%金币即可享受该特权\r\nV10超值大礼包：%|1|17资质死门 - 凯专属武器%\r\n%|1|战队等级达到Lv.40时，开启忍者试炼跳过72层功能%\r\n每日体力购买次数：%|1|12%\r\n每日摇钱树次数：%|1|40%\r\n精英副本重置次数：%|1|4%\r\n开启每日任务%|1|每日礼物：天赋点魔盒*1%\r\n解锁战斗速度%|1|x6%\r\n包含V9所有奖励",
	privilege_eleven = "累计储值%|1|20000%金币即可享受该特权\r\nV11超值大礼包：%|1|17资质死门 - 凯碎片和礼物%\r\n%|1|每日摇钱树次数：50%\r\n精英副本重置次数：%|1|4%\r\n包含V10所有奖励",
	privilege_twelve = "累计储值%|1|30000%金币即可享受该特权\r\nV12超值大礼包：%|1|17资质六道仙人 - 斑%\r\n%|1|忍者试炼积分+15％%\r\n每日体力购买次数：%|1|14%\r\n每日摇钱树次数：%|1|60%\r\n精英副本重置次数：%|1|4%\r\n包含V11所有奖励",
	privilege_thirteen = "累计储值%|1|60000%金币即可享受该特权\r\nV13超值大礼包：%|1|17资质六道仙人 - 斑碎片、专属指环、专属卷轴%\r\n%|1|战队等级达到Lv.40时，开启忍者试炼跳过74层功能%\r\n每日体力购买次数：%|1|15%\r\n每日摇钱树次数：%|1|80%\r\n精英副本重置次数：%|1|5%\r\n 演武战斗冷却时间降至%|1|1%分钟\r\n开启每日任务%|1|每日礼物：通灵契约*20%\r\n包含V12所有奖励",
	privilege_fourteen = "累计储值%|1|120000%金币即可享受该特权\r\nV14超值大礼包：%|1|17资质六道仙人 - 斑专属武器%\r\n%|1|忍者试炼积分+30％%\r\n每日体力购买次数：%|1|16%\r\n每日摇钱树次数：%|1|100%\r\n精英副本重置次数：%|1|5%\r\n包含V13所有奖励",
	privilege_fifteen = "累计储值%|1|200000%金币即可享受该特权\r\nV15超值大礼包：%|1|高级万能碎片和17资质六道仙人 - 斑专属忍具%\r\n%|1|每日体力购买次数：17%\r\n每日摇钱树次数：%|1|160%\r\n精英副本重置次数：%|1|5%\r\n包含V14所有奖励",
	privilege_sixteen = "累计储值%|1|300000%金币即可享受该特权\r\nV16超值大礼包：%|1|各类17资质自选箱%\r\n%|1|战队等级达到Lv.40时，开启忍者试炼跳过76层功能%\r\n开启每日任务%|1|每日礼物：高级万能碎片*1%\r\n包含V15所有奖励",
	privilege_seventeen = "累计储值%|1|500000%金币即可享受该特权\r\nV17超值大礼包：%|1|大量金币和钻石礼物%\r\n开启每日任务%|1|每日礼物：高级万能碎片*2%\r\n包含V16所有奖励",
	privilege_eighteen = "累计储值%|1|800000%金币即可享受该特权\r\nV18超值大礼包：%|1|大量金币和钻石礼物%\r\n %|1|战队等级达到Lv.40时，开启忍者试炼跳过78层功能%\r\n包含V17所有奖励",
	privilege_nineteen = "累计储值%|1|1500000%金币即可享受该特权\r\nV19超值大礼包：%|1|宇智波斑 - 土遁秽土转生（巅峰）%\r\n 包含VIP 18特权及以下内容，",
	privilege_twenty = "累计储值%|1|2000000%金币即可享受该特权\r\nV20超值大礼包：%|1|宇智波斑 - 土遁秽土转生（巅峰）专属武器%\r\n 包含VIP 19特权及以下内容，",
}

-- 分解界面说明文字
_Decompose_tip_info = "1.点击“+”进入选择介面，每次可最多选择5个忍者、装备、宝物或时装进行分解。\r\n2.只可分解4星及以上未成长的忍者，分解后返还所有升级花费并获得兽魂。\r\n3.可分解3星和4星装备，分解后返还所有升级花费并获得觉醒书。\r\n4.可分解5星装备，分解后返还所有升级花费并获得橙装铸造材料。\r\n5.只可分解5星宝物，分解后可获得灵气精华并返还所有强化经验(返还的经验在分解获得的蓝色经验宝物中)\r\n6.分解时装可获得时装精华\r\n7.分解后，所分解的忍者、装备、宝物或时装将会消失。"


-- 退化界面说明文字
_Regeneration_tip_info = "1.点击“+”进入选择介面，每次只可选择1个忍者、装备、宝物或时装进行退化。\r\n2.可退化强化等级在2级及以上的4星忍者和5星忍者，退化后返还所有花费(成长所消耗的铜币不返还)，退化后的忍者恢复成长等级为0阶，强化等级为1级。\r\n3.可退化6星忍者，退化后变为5星+7，等级不变，并返还成长和橙色成长所消耗的所有铜币及材料。\r\n4.只可退化5星且强化等级大于0的装备，退化后返还所有强化费用，并根据洗炼属性返还觉醒书。\r\n5.只可退化强化等级大于0的时装，退化后返还所有强化费用和时装精华。\r\n6.只可退化4星及以上，强化过的宝物，退化后返还所有升级花费，并根据宝物等级返还经验宝物和觉醒宝物\r\n7.每次退化需要花费一定铜币。"


-- 灵异探险界面的说明文字
_Divine_explain_tip_info = "1.点亮靶心图表案上的所有图案或点击任何图案都可以获得星数奖励。\r\n\r\n2.通过获得的星数可兑换奖励，星数越多兑换的奖励越多。\r\n\r\n3.每日凌晨0点重置探险次数、当前星数及奖励。"

-- 限时队长级说明文字
_Limited_hero_tip_info = "1.在活动介面中使用免费抽取或者铜币抽取忍者即可获得10积分。\r\n2.每累积获得150积分，即可获得1次免费铜币抽取次数。\r\n3.每次抽取可随机获得4星或5星忍者，5星忍者中包含限时活动忍者。\r\n4.活动结束时，根据积分排名，将会发放排名奖励。\r\n5.玩家每达到1000积分时必定抽中当前限时队长。\r\n6.积分达到60分的玩家将额外获得：10个金经验兽，铜币20万，500个成长石(该奖励与排名奖励可同时获得)\r\n活动结束的当天内奖励即会发放，通过奖励中心领取。"

-- 超级变变变说明文字(限时兑换)
_Super_change_tip_info = "1.活动期间内，玩家可使用指定的物品进行兑换，获得新的物品；\r\n2.可使用未强化过的装备或宝物进行兑换；\r\n3.兑换后会失去原有物品并获得兑换后的新物品。"

-- 分段折扣说明文字
_Divide_sell_tip_info = "1.活动期间根据全服购买的指定道具数量对该道具进行打折。\r\n2.当指定道具消耗数量达到指定数量时，商店内出售的该道具价格也将相应的发生变化。\r\n"

-- 跨服幸运大转盘说明文字
_Luck_turntable_tip_info = "1.活动期间使用免费或铜币转动幸运大转盘都可获得1积分，活动结束后会根据积分排名发放对应奖励；\r\n2.免费次数不会累加，免费次数使用后12小时会恢复；\r\n3.活动期间使用免费或铜币转动幸运大转盘都会增加一点次数奖励进度条，达到对应次数可立刻领取奖励；\r\n4.每天有5次免费刷新机会可刷新转盘上的奖励，免费次数用完后可使用铜币刷新，当玩家抽中高级道具时会强制刷新转盘；\r\n5.免费刷新或使用铜币刷新都有机会刷出高级限量道具(限量道具售光后无法再刷出)；\r\n6.免费转动或使用铜币转动幸运大转盘都有机会获得幸运大奖；\r\n7.系统会将玩家转动转盘消耗的铜币按一定比例累加到幸运大奖奖池，累加无上限；\r\n8.当玩家转到幸运大奖后，将会独得奖池内一定比例的铜币大奖；\r\n9.幸运大转盘资料所有伺服器互通。"

-- 灵王宫说明文字
_spirite_palace_tip_info = "1.每天可获得一次免费重置机会(不可累加)；\r\n2.灵王宫共有五层，每层达到可移动次数上限后就出现下一层入口，达到第五层终点即完成本轮探险；\r\n3.点击岔道口的事件图示可以查看事件说明，点击移动可触发该事件，或直接点击下方箭头进行移动；\r\n4.每触发一个事件都会获得一定的积分，积分可在灵王宫商店兑换道具；\r\n5.每次移动都会消耗1点行动力，行动力为0时不可再移动；\r\n6.首次进入灵王宫或重置后，会根据玩家当前阵容确定当前探险阵型，探险阵型一旦确定，本次探险过程中将无法进行改变；\r\n7.首次进入灵王宫或重置后，会根据玩家当前阵容所有忍者生命之和的三倍生成一条血槽，玩家在探险过程中会遭遇战斗，战斗结束后会根据忍者的损血量消耗血槽进行补充，如果血槽降到0便无法继续探险。"

-- 跨服战说明文字
_cross_server_tip_info = "【更新战斗资讯】\r\nA)战斗资讯\r\n是指跟玩家战斗相关的资料，即上阵忍者、装备、鬼道、阵型等所有可以影响玩家战斗强弱的相关资讯。\r\nB)更新战斗资讯\r\n玩家每次变动战斗资讯后需要点击“更新战斗资讯”来向跨界争霸战游戏伺服器上传最新的战斗资讯，否则游戏伺服器上的玩家战斗资讯不会改变。\r\n【跨界争霸战规则】\r\nA)先手规则\r\n战斗力高的玩家为先手\r\nB)海选赛规则\r\n1、瀞灵廷组海选赛规则\r\n1)随机分配对手，每场1局，每场间隔10分钟\r\n2)玩家不会再遇到已出局的对手\r\n3)如果玩家累积失败3场则被淘汰出局，直至决出最后32强\r\n4)玩家可以在我的资讯中“我的战绩”处查看自己的战绩\r\n2、流魂街组海选赛规则\r\n1)瀞灵廷组海选赛结束后，去除瀞灵廷组出线的选手，其他玩家进行流魂街组海选赛\r\n2)随机分配对手，每场1局，每场间隔10分钟\r\n3)玩家不会再遇到已出局的对手\r\n4)如果玩家累积失败3场则被淘汰出局，直至决出最后32强，海选结束\r\n5)玩家可以在我的资讯中“我的战绩”处查看自己的战绩\r\nC)晋级赛规则\r\n1、海选赛出线的瀞灵廷32强和流魂街32强分成16组，以每组2人进行5局3胜的比赛，获得3场胜利的玩家晋级，每局间隔20分钟\r\n2、每场晋级赛间隔1天\r\n3、瀞灵廷组和流魂街组分别决出各自组的冠军\r\n4、进入晋级赛的玩家自动进入跨服跨界争霸赛的海选\r\n【跨服跨界争霸赛规则】\r\nA)先手规则\r\n战斗力高的玩家为先手\r\nB)海选赛规则\r\n1、瀞灵廷组海选赛规则\r\n1)随机分配对手，每场1局，每场间隔10分钟\r\n2)玩家不会再遇到已出局的对手\r\n3)如果玩家累积失败3场则被淘汰出局，直至决出最后32强\r\n4)玩家可以在我的资讯中“我的战绩”处查看自己的战绩\r\n2、流魂街组海选赛规则\r\n1)瀞灵廷组海选赛结束后，去除瀞灵廷组出线的选手，其他玩家进行流魂街组海选赛\r\n2)随机分配对手，每场1局，每场间隔10分钟\r\n3)玩家不会再遇到已出局的对手\r\n4)如果玩家累积失败3场则被淘汰出局，直至决出最后32强，海选结束\r\n5)玩家可以在我的资讯中“我的战绩”处查看自己的战绩\r\nC)晋级赛规则\r\n1、海选赛出线的瀞灵廷32强和流魂街32强分成16组，以每组2人进行5局3胜的比赛，获得3场胜利的玩家晋级，每局间隔20分钟\r\n2、每场晋级赛间隔1天\r\n3、瀞灵廷组和流魂街组分别决出各自组的冠军\r\n4、跨服跨界争霸赛瀞灵廷组冠军所在伺服器所有玩家可获得礼包奖励\r\n【助威规则】\r\n晋级赛阶段，每场晋级赛玩家只可为1名玩家助威，被助威的玩家如果进入下一轮比赛，则助威的玩家可获得助威奖励。每场晋级赛结束后发放助威奖励，当奖励发放完毕后，可进行下一场晋级赛的助威。"

-- 副队长说明文字
_vice_captain_tip_info = "1.上阵中的副队长，每隔一段时间获得一定经验；\r\n2.只有上阵中的副队长才可进行出战操作，出战的副队长可在战前将自身技能属性提供给上阵忍者；\r\n3.一次只能出战一名副队长；\r\n4.培养可增加副队长经验，当副队长升到一定等级时可获得技能点；\r\n5.技能点可用来开启技能槽、领悟技能、升级技能。"

--侵略者帮助奖励文字
_betray_army_reward_tip_info = "1.光丘守护可获得功勋奖励，主要是大量铜币、晶片石和橙色经验宝物。\r\n2.光丘守护还可获得战功，战功可在战功商店购买稀有忍者和晶片石。"

--侵略者帮助功勋文字
_betray_army_exploit_tip_info = "1.35级后，每次挑战主线副本和精英副本都有概率发现侵略者，可以单独或邀请好友一起光丘守护。\r\n2.每次光丘守护会获得功勋值，伤害越高功勋值越多，忍者每成长+1对侵略者伤害提升2.5倍！\r\n3.若击杀侵略者，发现侵略者的玩家和给予最后一击的玩家都可获得铜币奖励。"

--侵略者帮助战功文字
_betray_army_credit_tip_info = "1.攻打侵略者时，每消耗一个挑战书，都可获得50战功。\r\n2.若进入光丘守护的每日功勋榜和每日伤害榜前200名，还可获得额外的排名战功奖励。\r\n3.每天12:00-14:00怒攻只消耗1个挑战书，18:00-20:00攻打侵略者功勋翻倍。"

--组织资源抢夺帮助信息
_capture_resource_tip_info = "1.击败建筑守卫者可占领该建筑，并可获得资源产出奖励；\r\n2.每名玩家可同时占领多个建筑，相邻的建筑可获得资源产出加成；\r\n3.每个建筑有对应的占领条件，占领建筑的阵容为临时组建阵容，跟原有阵容相互独立；\r\n4.可派出原阵容中已上阵的忍者，不会计算装备和宝物属性，缘分会按照新的上阵情况重新计算；\r\n5.占领成功后，所派出的忍者将成为建筑守卫，不可中途更换；\r\n6.攻打建筑或占领建筑可获得积分，每周二和每周五中午12点会根据积分排名发放奖励，并清空积分；\r\n7.攻打建筑无论胜利失败可获得5积分，占领建筑后每分钟可获得1积分(占领结束时根据占领时间获得)；\r\n8.排名奖励需要玩家自行进入奖励页面领取，奖励会保存到下一次排行结算，结算时会删除未领取的奖励(积分为0的玩家无法获得奖励)。"

---组织战帮助信息
_union_fight_tip_info = "报名阶段：\r\n1.周三3点开启报名；\r\n2.加入组织48小时的成员才能参与组织战；\r\n3.组织战为跨服战斗，会根据组织战力匹配对手。\r\n\r\n准备阶段：\r\n1.周四3点开启准备阶段；\r\n2.首领和副首领可部署防守阵型；\r\n3.组织成员在前后城各拥有一个防守格；\r\n4.暗格在被攻击前处于资讯不明状态。\r\n\r\n战斗阶段：\r\n1.周五3点开启战斗，22点结算战斗；\r\n2.每人3次尝试进攻机会，2次击杀次数；\r\n3.守卫为1的据点进入【失守】状态，可被通过；\r\n4.守卫为0的据点进入【攻陷】状态，可取得积分；\r\n5.特殊据点包含额外奖励，攻陷该据点后可领取；\r\n6.结算时积分高的组织获胜，如果积分相同，战力低的组织获胜；\r\n7.胜利或失败的组织都会获得奖励，失败的奖励是胜利的一半。"


_emailTypeAllTip = {			--记录邮件的类型
	"演武场被击败排名下降",
	"演武场成功防守",
	"演武场排名奖励",
	"演武场幸运排名奖励",
	"决斗被击败",
	"决斗排名奖励",
	-- "抢夺",
	-- "演武场被击败排名不变",
	-- "好友申请",
	"好友已同意",
	"好友已拒绝",
	-- "好友断绝",
	-- "好友留言",
	-- "好友被通过",
	-- "好友被拒绝",
	-- "充值成功",
	-- "VIP",
	"组织已通过",
	"组织被拒绝",
	"被组织踢出",
	-- "演武场排名奖励",
	-- "演武场幸运排名奖励",
	-- "决斗排名奖励",
	"演武场被击败排名不变",
	"资源矿到期",
	"资源矿协助",
	"资源矿抢夺",
	"",
	"资源矿抢夺失败",
	"资源矿抢夺成功",
	"资源矿防守成功",
	"资源矿防守失败",
	"资源矿到期",
}

_emailTypeFriendTip = {		
	"好友申请",
	"好友已同意",
	"好友已拒绝",
	"好友断绝",
	"好友留言",
	"好友被通过",
	"好友被拒绝",
}

_emailTypeFightTip = {		
	"演武场被击败排名下降",
	"演武场成功防守",
	--"演武场排名奖励",
	--"演武场幸运排名奖励",
	"决斗被击败",
	--"决斗排名奖励",
	"抢夺",
	"演武场被击败排名不变",
}

_emailTypeSystemTip = {
	"储值成功",
	"VIP",
	"组织已通过",
	"组织被拒绝",
	"被组织踢出",
	"演武场排名奖励",
	"演武场幸运排名奖励",
	"决斗排名奖励",
}
		
_emailTimeDraw = {
	"今天",
	"1天前",
	"2天前",
	"3天前",
	"4天前",
	"5天前",
	"6天前",
	"7天前",
	"8天前",
	"9天前",
	"10天前",
	"11天前",
	"12天前",
	"13天前",
	"14天前",
}

-- 游戏中功能未开启的提示信息
_function_unopened_tip_string = "功能暂未开启"
_unopened_tip = "未开启"
_opened_tip = "开启"
_wait_open_tip = "即将开放"

--向性, 0无,1魏,2蜀,3吴,4群
heroCamp = {
	"无",
	"疫苗",
	"数据",
	"病毒",
	"其他",
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
string_equiprety_name = {
	"生 命:",--0(固定值)
	"攻 击:",--1(固定值)
	"防 御:",--2(固定值)
	"术防+",--3(固定值)
	"生 命:",--4 百分比
	"攻 击:",--5 百分比
	"防 御:",--6 百分比
	"术防+",--7 百分比
	"暴击率+",--8 百分比
	"抗暴率+",--9 百分比
	"格挡率+",--10 百分比
	"破击率+",--11 百分比
	"命中率+",--12 百分比
	"闪避率+",--13 百分比
	"物理免伤+",--14 百分比
	"魔法免伤+",--15 百分比
	"治疗率+",--16 百分比
	"被治疗率",--17 百分比
	"最终伤害+",--18(固定值)
	"最终减伤+",--19(固定值)
	"初始查克拉+",--20(固定值)
	"耐久+",--21(固定值)
	"火力+",--22(固定值)
	"速度+",--23(固定值)
	"物理攻击+",--24(固定值)
	"魔法攻击+",--25(固定值)
	"治疗值+",--26(固定值)
	"被治疗值+",--27(固定值)
	"出血伤害+",--28(固定值)
	"中毒伤害+",--29(固定值)
	"出血免伤+",--30(固定值)
	"中毒免伤+",--31(固定值)
	"经验+",--32(固定值)
	"最终伤害+",--33 百分比		
	"最终减伤+",--34 百分比	
	"最终减伤+",--35 百分比
	"%",--36 百分比
	"0K",--37
	"00M",--38 
	"K",--39 
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
string_equiprety_name_teo = {
	"生命",--0(固定值)
	"攻击",--1(固定值)
	"物防",--2(固定值)
	"术防",--3(固定值)
	"生命",--4 百分比
	"攻击",--5 百分比
	"物防",--6 百分比
	"术防",--7 百分比
	"暴击率",--8 百分比
	"抗暴率",--9 百分比
	"格挡率",--10 百分比
	"破击率",--11 百分比
	"命中率",--12 百分比
	"闪避率",--13 百分比
	"物理免伤",--14 百分比
	"魔法免伤",--15 百分比
	"治疗率",--16 百分比
	"被治疗率",--17 百分比
	"最终伤害",--18(固定值)
	"最终减伤",--19(固定值)
	"初始查克拉",--20(固定值)
	"耐久",--21(固定值)
	"火力",--22(固定值)
	"速度",--23(固定值)
	"物理攻击",--24(固定值)
	"魔法攻击",--25(固定值)
	"治疗值",--26(固定值)
	"被治疗值",--27(固定值)
	"出血伤害",--28(固定值)
	"中毒伤害",--29(固定值)
	"出血免伤",--30(固定值)
	"中毒免伤",--31(固定值)
	"经验",--32(固定值)
	"最终伤害",--33 百分比		
	"最终减伤",--34 百分比	
	"最终减伤",--35 百分比
	"%",--36 百分比
	"0K",--37
	"00M",--38 
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
--用于附加在取值后面,是显示固定值还是百分比
string_equiprety_name_vlua_type = {
	"",--0(固定值)
	"",--1(固定值)
	"",--2(固定值)
	"",--3(固定值)
	"%",--4 百分比
	"%",--5 百分比
	"%",--6 百分比
	"%",--7 百分比
	"%",--8 百分比
	"%",--9 百分比
	"%",--10 百分比
	"%",--11 百分比
	"%",--12 百分比
	"%",--13 百分比
	"%",--14 百分比
	"%",--15 百分比
	"%",--16 百分比
	"%",--17 百分比
	"",--18(固定值)
	"",--19(固定值)
	"",--20(固定值)
	"",--21(固定值)
	"",--22(固定值)
	"",--23(固定值)
	"",--24(固定值)
	"",--25(固定值)
	"",--26(固定值)
	"",--27(固定值)
	"",--28(固定值)
	"",--29(固定值)
	"",--30(固定值)
	"",--31(固定值)
	"",--32(固定值)
	"%",--33 百分比		
	"%",--34 百分比	
	"%",--35 百分比
	"",--36 百分比
	"",--37
	"",--38 
}

-- 宝物属性类型定义
_influence_type = {
	"生命",--0(固定值)		
	"攻击",--1(固定值)		
	"物防",--2(固定值)		
	"术防",--3(固定值)		
	"生命",--4 百分比		
	"攻击",--5 百分比		
	"物防",--6 百分比		
	"术防",--7 百分比		
	"暴击率",--8 百分比		
	"抗暴率",--9 百分比		
	"格挡率",--10 百分比		
	"破击率",--11 百分比		
	"命中率",--12 百分比		
	"闪避率",--13 百分比		
	"物理免伤",--14 百分比		
	"魔法免伤",--15 百分比		
	"治疗率",--16 百分比		
	"被治疗率",--17 百分比		
	"最终伤害",--18(固定值)		
	"最终减伤",--19(固定值)		
	"初始查克拉",--20(固定值)		
	"体质",--21(固定值)		
	"力量",--22(固定值)		
	"灵力",--23(固定值)		
	"物理攻击",--24(固定值)		
	"魔法攻击",--25(固定值)		
	"治疗值",--26(固定值)		
	"被治疗值",--27(固定值)		
	"出血伤害",--28(固定值)		
	"中毒伤害",--29(固定值)		
	"出血免伤",--30(固定值)		
	"中毒免伤",--31(固定值)		
	"经验",--32(固定值)		
	"最终伤害",--33 百分比		
	"最终减伤",--34 百分比
	"PVP增伤",--35 百分比		
	"PVP减伤",--36 百分比
	"查克拉恢复",--37 (固定值)
}

--奖励物品类型
reward_prop_list = {
	"铜币",
	"金币",
	"演武币",
	"忍者魂",
	"天赋点",
	"道具",
	"装备",
	"队伍经验",
	"精力",
	"功能点",
	"上阵数",
	"体力",
	"忍者",
}

_reward_icon_name = {
	"icon_gold",------------铜币
	"icon_gem",------------金币
	"",------------声望
	"",------------将魂(无用)
	"icon_jianghun",------------兽魂
	"",------------道具
	"",------------装备
	"ext",------------经验
	"icon_immo",------------精力
	"",----------功能点
	"",--------上阵数
	"icon_power",------------体力
	"",------------忍者
}

_equiprety_name = {
	"生命",
	"攻击",
	"物防",
	"术防",
	"生命",
	"攻击",
	"物防",
	"术防",
	"暴击",
	"抗暴",
	"格挡",
	"破击",
	"命中",
	"闪避",
	"物理免伤",
	"魔法免伤",
	"被治疗率",
}

_property = {
	"生命",
	"攻击",
	"物防",
	"术防",
	"耐久",
	"火力",
	"速度",
}

----

--包裹已满的提示
_pack_fill_tip = {
	propPackTip = "您的道具仓库已满",
	treasurePackTip = "您的宝物仓库已满",
	equipPackTip = "您的装备仓库已满,请先清理一下吧!",
	equipFragmentPackTip = "您的装备碎片仓库已满",
	heroPackTip = "您的忍者仓库已满,请先清理一下吧!",
	fashionPackTip = "您的时装仓库已满",
	ghostPackTip = "您的鬼道仓库已满",
	viceCaptainPackTip = "您的副队长仓库已满",
}

-- 字符串拼接数组  -- FLAG!!!!
_string_piece_info = {
	"请选择伺服器", --------------------------------------------1
	"第",		   	--------------------------------------------2
	"关",			--------------------------------------------3
	"数量",			--------------------------------------------4
	"装备于",		--------------------------------------------5
	"LV",			--------------------------------------------6
	"武器",			--------------------------------------------7
	"腰带",			--------------------------------------------8
	"头盔",			--------------------------------------------9
	"铠甲",			--------------------------------------------10
	"装备中",		--------------------------------------------11
	"数量不足",		--------------------------------------------12
	"本次抽中橙色忍者机率X",------------------------------------13
	"倍",-------------------------------------------------------14
	"首次抽取必得紫色忍者",-------------------------------------15
	"等级",-----------------------------------------------------16
	"价格",-----------------------------------------------------17
	"达到VIP4可跳过精英副本战斗",-------------------------------18
	"需要通过该关卡后才能跳过！",-------------------------------19
	"达到VIP4可跳过经验宝物副本战斗",---------------------------20
	"达到VIP4可跳过金经验兽副本战斗",---------------------------21
	"5级可使用战斗加速",----------------------------------------22
	"5级可使用战斗加速",----------------------------------------23
	"请选择需要出售的装备",-------------------------------------24
	"您已经选择出售",-------------------------------------------25
	"个装备",---------------------------------------------------26
	"总计出售可获得",-------------------------------------------27
	"铜币",-----------------------------------------------------28
	"进化", 	------------------------------------------------29	
	"强化等级达到上限", 	------------------------------------30	
	"件效果", 	------------------------------------------------31
	" ", 	----------------------------------------------------32
	"忍者",-----------------------------------------------------33
	"未上榜",---------------------------------------------------34
	"点击+选择材料忍者才能升级喔！",----------------------------35
	"您当前没有蓝色以下品质的忍者或经验忍者，无法添加",---------36
	"缘分",-----------------------------------------------------37
	"天赋",-----------------------------------------------------38
	"忍者说明",-------------------------------------------------39
	"进化+",----------------------------------------------------40
	"级开放",---------------------------------------------------41
	"强化+",----------------------------------------------------42
	"技能",-----------------------------------------------------43
	"资质",-----------------------------------------------------44
	"精炼",-----------------------------------------------------45
	"",-------------------------------------------------------46
	"可启动缘分+1",---------------------------------------------47
	"2件效果",--------------------------------------------------48
	"3件效果",--------------------------------------------------49
	"4件效果",--------------------------------------------------50
	"进化",-----------------------------------------------------51
	"启动",-----------------------------------------------------52
	"每次只能选择5个忍者",-------------------------------------53
	"30级才开放装备精炼,请提升等级再来吧!",----------------54
	"出售所选的",-----------------------------------------------55
	"个宝物，获得",---------------------------------------------56
	"铜币，您确定要出售吗？",-----------------------------------57
	"疫苗种",---------------------------------------------------58
	"数据种",---------------------------------------------------59
	"病毒种",---------------------------------------------------60
	"其他",---------------------------------------------------61
	"此忍者已达到等级上限",-------------------------------62
	"碎片",-----------------------------------------------------63
	"忍者",-----------------------------------------------------64
	"缘分",-----------------------------------------------------65
	"组合技",-----------------------------------------------------66
	"可启动缘分+",----------------------------------------------67
	"LV:",------------------------------------------------------68
	"今日可买",-------------------------------------------------69
	"次",-------------------------------------------------------70
	"已达购买上限",---------------------------------------------71
	"普通招募书不足",-----------------------------------------------72
	"大型开发书不足",-----------------------------------------------73
	"金币不足",-------------------------------------------------74
	"无购买上限",-----------------------------------------------75
	"购买成功",-------------------------------------------------76
	"价格每日凌晨12:00刷新",--------------------------------------77
	"该忍者进化次数已达上限！",---------------------------------78
	"需要等级到达",---------------------------------------------79
	"进化所需忍者不足",-----------------------------------------80
	"进化所需道具不足",-----------------------------------------81
	"进化所需装备不足",-----------------------------------------82
	"需要达到VIP%d及以上可购买",----------------------------------------------83
	"请选择人物",-----------------------------------------------84
	"道具数量不足",---------------------------------------------85
	"铜币不足",---------------------------------------------86
	"您当前没有任何品质小于橙色的忍者！",-----------------87
	"请先选择你要分解的",---------------------------------88
	"没有可重生的",---------------------------------------------89
	"忍者已满级",-----------------------------------------------90
	"进化已达上限",---------------------------------------------91
	"进化成功",-------------------------------------------------92
	"出售成功,共获铜币",----------------------------------------93
	"你当前没有符合条件的装备！",-------------------------94
	"每次只能选择5件武器",-------------------------------------95
	"防御",-----------------------------------------------------96
	"第",-------------------------------------------------------97
	" ",-----------------------------------------------------98
	"资源更新失败，是否重新更新？",-------------99
	"网路不给力哟~请重新连接~！",-----------------100
	"您将要更新",-----------------------------------------101
	"的资源，您现在要更新么？选择不更新将会退出游戏。",---------102
	"30级开启",-------------------------------------------------103
	"等级不足",-------------------------------------------------104
	"已通关",---------------------------------------------------105
	"完美通关",-------------------------------------------------106
	"更新完毕",-------------------------------------------------107
	"你没有绿、蓝品质的装备可选择",--------------------108
	"暂无可出售装备",-------------------------------------------109
	"您没有任何该品质的装备",------------------------------110
	"您没有任何该品质的忍者",------------------------------111
	"暂无可出售忍者",-------------------------------------------112
	"今日挑战次数已经用完",-------------------------------------113
	"你没有白、绿、蓝品质的忍者可选择",--------------------114
	"援军",-----------------------------------------------------115
	"已上阵",---------------------------------------------------116
	"不能超过12个字元！",-------------------------------117
	"主角暱称不可为空！",---------------------------------------118
	"暱称中不可包含特殊字元！",---------------------------------119
	"主线副本",-------------------------------------------------120
	"无限山",-------------------------------------------------121
	"商城-橙色箱子",--------------------------------------------122
	"[主线副本]掉落",------------------------------------123
	"可以在神秘商店购得",---------------------------------------124
	"有几率开出装备碎片",---------------------------------------125
	"培养液不足",-----------------------------------------------126
	"铜币不足",-------------------------------------------------127
	"金币不足",-------------------------------------------------128
	"VIP5可培养10次，当前VIP等级不足。储值可提升VIP等级",---129
	"VIP4可培养5次，当前VIP等级不足。储值可提升VIP等级",---130
	"已刷新",---------------------------------------------------131
	"光丘守护",-------------------------------------------------132
	"未开放",---------------------------------------------------133
	"经验",-----------------------------------------------------134
	"日常副本",-------------------------------------------------135
	"邮件",-----------------------------------------------------136
	"好友介面",-------------------------------------------------137
	"日常任务",-------------------------------------------------138
	"大师榜",---------------------------------------------------139
	"内容",-----------------------------------------------------140
	"开放天赋: ",-----------------------------------------------141
	"培养1次",-------------------------------------------------142
	"培养5次",-------------------------------------------------143	
	"培养10次",-------------------------------------------------144
	"点击选择",-------------------------------------------------145
	"玩家详细资讯及操作",---------------------------------------146
	"组织商店",-------------------------------------------------147
	"恭喜你获得",-----------------------------------------------148
	"道具使用成功！",-------------------------------------------149
	"0k",-------------------------------------------------------150
	"未上榜",---------------------------------------------------151
	"X",--------------------------------------------------------152
	"+",--------------------------------------------------------153
	"恭喜你开启功能点",-----------------------------------------154
	"恭喜你的上阵数提高",-------------------------------------155
	"点",-------------------------------------------------------156
	"已达到购买上限",-------------------------------------------157
	"演武场",---------------------------------------------------158
	"名可购买",-------------------------------------------------159
	"可购买",---------------------------------------------------160
	"刷新次数上限",---------------------------------------------161
	"强化等级+",------------------------------------------------162
	"强化暴击",-------------------------------------------------163
	"冷却时间",-------------------------------------------------164
	"秒",-------------------------------------------------------165
	"没有蓝色品质以下的宝物了",---------------------------------166
	"阵容查看",-------------------------------------------------167
	"暂无可出售宝物",-------------------------------------------168
	"你没有蓝、紫品质的宝物可选择",--------------------169
	"您没有任何该品质的宝物",------------------------------170
	"请选择你要出售的宝物",--------------------------------171
	"今日可买",-------------------------------------------------172
	"次",-------------------------------------------------------173
	"1星",-----------------------------------------------------174
	"2星",-----------------------------------------------------175
	"3星",-----------------------------------------------------176
	"(无忍者阵亡)",---------------------------------------------177
	"(1忍者阵亡)",----------------------------------------------178
	"(多于1忍者阵亡)",------------------------------------------179
	"获得%s颗星星后可获取哟!",----------------------------------180
	"您已经领取该宝箱啦!",--------------------------------------181
	"级开启",---------------------------------------------------182
	"获得《",---------------------------------------------------183
	"》X",--------------------------------------------------184
	"演武场奖励",-----------------------------------------------185
	"恭喜您在演武场中位列",-------------------------------------186
	"名，鉴于神勇表现，特发以上\r\n奖励。",-------------------------187
	"奖励发放",-------------------------------------------------188
	"VIP宝箱",--------------------------------------------------189
	"演武场幸运奖励",-------------------------------------------190
	"(与",------------------------------------------------------191
	"达成合击)",------------------------------------------------192
	"精练成功",-------------------------------------------------193
	"提升1阶",-------------------------------------------------194
	"今日已聚宝",-----------------------------------------------195
	"采集篓累积了",---------------------------------------196
	"铜币啦，再聚宝",---------------------------------------197
	"次即可领取奖励",----------------------------------------198
	"暂未开放",-------------------------------------------------199
	"可启动合击技",---------------------------------------------200
	"美食已经准\r\n备好了，快请享用吧~",----------201
	"今天的美食\r\n已吃完，还请明日\r\n再来~",--202
	"美食酱正在\r\n努力，晚点再来\r\n吧~",--203
	"储值送礼",-------------------------------------------------204【数码宝贝】活动
	"活动时间内，完成对应目标就可以获得奖励！",--------------------------------------205【数码宝贝】活动
	"储值",-----------------------------------------206【数码宝贝】活动
	"金币",-------------------------------------------------------207
	"点击+号,选择素材进行宝物强化吧",-------------------------208
	"累计消费",----------------------------------------------------209
	"活动时间内，累计消费达到指定金额就可以获得奖励！",------------------------------210【数码宝贝】活动
	"累计消耗",----------------------------------------------------211【数码宝贝】活动
	"体力回复了",----------------------------------------------------212
	"5级可使用战斗加速",---------------------------213
	"5级可使用战斗加速",---------------------------214
	"每日储值",----------------------------------------------------215
	"金币以上！即可领取豪华奖励",---------------------------216
	"圆",----------------------------------------------------217
	"首次储值额外赠送",----------------------------------------------------218
	"金币\r\n（限购一次）",----------------------------------------------------219
	"储值额外赠送",----------------------------------------------------220
	"首储成功，恭喜获得",----------------------------------------------------221
	"金币！",----------------------------------------------------222
	"立即获得",----------------------------------------------------223
	"金币，连续",--------------------------------------------------224
	"\r\n天每天可领取",------------------------------------------------225
	"没有可退化的宝物",------------------------------------------------226
	"没有可退化的忍者",------------------------------------------------227
	"VIP",------------------------------------------------228
	"每天可领取",------------------------------------------------229
	"金币，剩余\r\n ",------------------------------------------------230
	"天",------------------------------------------------231
	"领取月卡每日奖励成功，恭喜获得",------------------------------------------------232
	"剩余可领取时间：",------------------------------------------------233
	"忍者分解后将会获得以下物品",------------------------------------------------234
	"装备分解后将会获得以下物品",------------------------------------------------235
	"忍者退化后将会获得以下物品",------------------------------------------------236
	"宝物退化后将会获得以下物品",------------------------------------------------237
	"VIP等级已达上限",------------------------------------------------238
	"恭喜购买",------------------------------------------------239
	"月卡成功！每日都可以领取免费金币哟!",------------------------------------------------240
	"使用成功！体力补充完毕，快去【出击】吧！",------------------------------------------------241
	"40级才开放宝物精炼,请提升等级再来吧!",----------------242
	"金币，并额外获得的",----------------243
	"金币！",----------------244
	"储值成功，恭喜获得",----------------245
	"金币，快继续闯关吧",----------------246
	"领取月卡每日奖励成功，剩\r\n余",----------------247
	"是否花费",----------------248
	"重置副本",----------------249
	"今日还可重置",----------------250
	"次",----------------251
	"今日重置次数已用完",----------------252
	"今日挑战次数已用完",----------------253
	"晶片值",----------------254
	"荣誉不足",----------------255
	"~~~目前什么都没有哟~~~",----------------256
	"您还没有输入任何文字",----------------257
	"你要和自己聊天吗",----------------258
	"已申请添加",----------------259
	"为好友",----------------260
	"已添加",----------------261
	"到黑名单",----------------262
	"已经在你的黑名单了",----------------263
	"确定将",----------------264
	"拉入黑名单?拉入黑名单后,你将无法收到对方的聊天资讯",----------------265
	"夺宝",----------------266
	"积分",----------------267
	"上线",----------------268
	"",----------------269
	"分钟",----------------270
	"小时",----------------271
	"周以上",----------------272
	"当前金币不足，是否前往储值",----------------273
	"当前VIP等级不足，是否前往储值",----------------274
	"是否与",----------------275
	"绝交,你们的友谊真的走到尽头了吗?",----------------276
	"是否花费200金币购买等级基金？",----------------277【数码宝贝】等级基金
	"需要达到VIP3才能购买喔~",----------------278【数码宝贝】等级基金
	"成功购买等级基金，快去练级领奖励吧~",----------------279【数码宝贝】等级基金
	"名字不能为空",----------------280
	"已有%s人购买啦~",----------------281
	"购买人数到达",----------------282
	"即可领取",----------------283
	"等级到达",----------------284
	"采集箱已经空空如也，明日继续采集吧!",----------------285
	"采集箱已经吃撑了！快领取里面的铜币吧！",----------------286
	"快来挑战无限山吧！",----------------287
	"小时前",----------------288
	"分钟前",----------------289
	"刚刚",----------------290
	"天前",----------------291
	"夺宝资讯",----------------292
	"疫苗进度",----------------293
	"资料进度",----------------294
	"病毒进度",----------------295
	"其他进度",----------------296
	"经验忍者不可以强化",----------297
	"经验忍者不可以精炼",----------298
	"40级开启",----------299
	"不可强化",----------300
	"不可精炼",----------301
	"活动未开启",----------302
	"战力",----------303
	"请选择一个奖励类型",----------304
	"已结束",----------305
	"仅限前%s人购买（剩余%s件）",----------306
	"冷却时间",----------307
	"秒",----------308
	"发送成功",----------309
	"无",----------310
	"使用成功！出击次数增加",----------311
	"挑战书数量不足，请先购买",----------312
	"留言成功",----------313
	"名称不能超过6个字元",----------314
	"请输入您的暱称哟~",----------315
	"当前金币不足，是否前往储值？",----------316
	"名",----------317
	" 今日点赞次数已经用完,请明日再来吧",----------318
	"该玩家很懒，什么都没有留下",----------319
	"今日功勋达到",----------320
	"可以领取",----------321
	"达到VIP",----------322
	"后开启",----------323
	"暂无",----------324
	"没有可领取的体力",----------325
	"今日领取次数已用完",----------326
	"需要通过该关卡才能进行扫荡",----------327
	"需要达到3星才能扫荡",----------328
	"15级才开放夺宝，请努力提升等级再来吧！",----------329
	"第",----------330
	"",----------331
	"战功x",----------332
	"的缘分",----------333
	"启动",----------334
	"侵略者已被击杀",----------335
	"好友%s造成x%d伤害",----------336
	"发现",----------337
	"，是否前往攻打？",----------338
	"强化成功!,宝物经验增加",----------339
	"成功升到",----------340
	"请输入暱称:",----------341
	"请输入资讯:",----------342
	"5级才能穿戴装备,请努力提升等级再来吧！",----------343
	"已满级",----------344
	"此忍者已经满级,不需要再升级了!",----------345
	"不能进化",----------346
	"不可跃迁",----------347
	"培养属性已满,请提升忍者等级可提高培养属性上限",----------348
	"已满值",----------349
	"请选择需要出售的忍者",----------350
	"恭喜获得",----------351
	"达到VIP%d才可购买，储值可提升VIP等级",----------352
	"演武币不足",----------------353
	"成功领取1点精力",------------354
	"还在为基础资源烦恼吗？限时兑换强势来袭，各种福利爽翻天！",------------355
	"是否确定购买VIP%s礼包？",------------356
	"光丘守护奖励",------------357
	"扫荡",------------358
	"（每次消耗%d点体力）",------------359
	"通关 %s 开启",---------------------360
	"每天只能挑战%d次！",---------------------361
	"这是为您精心准备的奖励，还望笑纳！",------------------362,
	"伺服器维护中,请稍后重试!",---------------------------363
	"点赞成功,并获得%d铜币!",---------------------------364
	"暂未开放获得途径",------------------365
	"与%s合击",---------------------------------------------366
	"剩余次数",---------------------------------------------367
	"土豪，求抱大腿~~~！",----------368
	"材料经验已超出等级上限，是否继续升级？",----------369
	"和",----------370
	",",----------371
	"可购买%d次",------------372
	"要邀请好友一起光丘守护吗？",------------373
	"暱称不可为空",----------374
	"您还没有输入任何资讯",----------375
	"努力载入中，耐心等待",------------------376
	"叛军发现",-------377 不要替换此文字，前端根据此文字替换成 379的文字
	"叛军击杀",-------378 不要替换此文字，前端根据此文字替换成 380的文字
	"发现侵略者",-------379 用于377的转换
	"击杀侵略者",-------380 用于378的转换
	"晶片已达上限",-------381
	"经验宝物无法强化和精炼！",--------382
	"主角无法使用此方式升级！",--------383
	"该忍者无法进化！",----------------384
	"您选择了高品质忍者，确认消耗？",----------------385
	"您选择了高品质宝物，确认消耗？",----------------386
	"是否花费%d金币购买？",----------------------------387
	"是否花费%d金币学习技能？",----------------------------388
	"确定消耗%d金币学习10次？",----------------------------389
	"达到%d级可以领取",----------------------------390
	"上阵忍者数量不可超过%s人",----------------------------391
	"上阵忍者等级不可超过%s级",----------------------------392
	"上阵忍者品质不可低于%s品质",----------------------------393
	"%d小时收益%d%s",----------------------------394
	"请先上阵忍者",----------------------------395
	"确定放弃占领？放弃可收获%d%s\n\r(可前往奖励中心领取)",----------------------------396
	"急报！您的地盘被人抢去了！",----------------------------397 地盘被抢夺
	"您有地盘占领时间已满",----------------------------398 地盘到期
	"恭喜您成功抢占到一个地盘",----------------------------399 
	"很遗憾，地盘未抢占成功",----------------------------400 
	"恭喜您成功延长占领时间",----------------------------401 
	"资源抢夺奖励",------------402
	"(可前往奖励中心领取)",------------403
	"该忍者正在驻守中，无法提升等级",------------404
	"扩充次数已达上限",------------405
	"是否花费%d金币扩充1个占领上限？",------------406
	"购买成功，占领上限+1",------------407
	"积分奖励",------------408
	"每小时取得%s%s",------------409
	"可占领4小时",------------410
	"很遗憾，暂时未搜索到对应的空建筑",------------------411
	"请输入座标X:",----------412
	"请输入座标Y:",----------413
	"请输入地图索引:",----------414
	"搜索地图超过最大上限",------------------415
	"搜索座标超出最大区域",------------------416
	"输入地图资讯错误",------------------417
	"输入X座标资讯错误",------------------418
	"输入Y座标资讯错误",------------------419
	"系统检测到您的属性资料异常，请重新登陆",------------------420
	"剩余%s天",------------------421
	"您的角色已被封停，详情请联络客服人员",------------------422
	"恭喜玩家%s，获得金币%s",-----------423
	"排位赛奖励",-----------424
	"战神令不足",-----------425
	"已到达顶级，无法成长",-----------426
	"装备退化后将会获得以下物品",-----------427
	"每次只能选择五个宝物",-----------------428
	"请选择奖励",-----------------429
	"可兑换%d次",-----------------430
	"可领取%d次",-----------------431
	"队伍中有6个忍者时援军才可上阵",-----------------432
	[433] = "登陆",-----------------433
}
--- 定义活动信息
_tip_info_activity = {
	-- 此处不填写值,在下面标记的序号里填写
}
_tip_info_activity[21]={"每日储值送礼","有钱任性，活动期间，当日累计储值达到指定金额即可领取各种稀有资源和道具。"}
_tip_info_activity[24]={"登陆送礼","活动期间，累计登入达到指定天数即可获得稀有道具~！累计登入%d天"}
_tip_info_activity[43]={"演武双倍","活动期间，活动期间，参与演武场的玩家，可获得指定道具的双倍奖励~！"}
_tip_info_activity[44]={"副本双倍","活动期间，活动期间，副本掉落的指定道具的掉落率将翻倍，抓紧时间刷刷刷！"}
_tip_info_activity[45]={"单笔储值送礼","活动期间，单笔储值达到指定金额即可获得超值道具单笔储值%d金币"}
_tip_info_activity[46]={"招募折扣","活动期间，忍者招募可享20%优惠！"}
_tip_info_activity[47]={"光丘守护","侵略者来袭，活动期间，攻击侵略者和击杀侵略者的玩家都会获得丰厚的奖励！",{"攻击侵略者%d名","击杀侵略者%d名"}}
_tip_info_activity[62]={"碎片兑换","活动时间内，可以兑换指定道具！"}------------------【数码宝贝】限时兑换
_tip_info_activity[70]={"高级商店","在这里使用高级币。每件商品都有各自的每日或每周购买上限。"}-------------------限时兑换
_tip_info_activity[71]={"装备市场","活动期间，大量稀有装备折价大拍卖！快将你心仪已久的装备带走吧！"}---------------限时兑换
_tip_info_activity[76]={"折扣贩售","活动期间，玩家可以使用指定资源兑换稀有资源！心动不如行动！"}------------------------------------限时兑换
_tip_info_activity[90]={"摇钱树200%X","活动期间，前10次点金可获得双倍两！"}------------------------------------点金双倍
_tip_info_activity[94]={" 体力购买200%加成","活动期间，前5次购买体力可享200%加成，千万别错过！"}
_tip_info_activity[97]={"主线副本2倍掉落","活动时间内，主线关卡物品双倍掉落！快去战斗吧！"}
_tip_info_activity[98]={"精英副本2倍掉落","活动时间内，精英关卡物品双倍掉落！快去战斗吧！"}
_tip_info_activity[99]={"两挑战2倍掉落","活动时间内，铜币挑战活动关卡物品双倍掉落！快去战斗吧！"}
_tip_info_activity[100]={"精英关卡次数增加","活动时间内，精英关卡可挑战次数每天额外增加3次，快去获得心仪忍者的碎片吧！"}
_tip_info_activity[101]={"铜币挑战次数增加","活动时间内，铜币挑战活动关卡可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[114]={"限定招募","%s参上！活动时间内，可以通过限定招募抽卡（V%s以上玩家可见）获得！（抽卡次数不计入活动任务抽卡计数）", "%s、%s2选1！活动时间内，可以通过限定招募抽卡（V%s以上玩家可见）获得！（抽卡次数不计入活动任务抽卡计数）"}
_tip_info_activity[120]={"节日关卡掉落","活动时间内，主线关卡和精英关卡战斗胜利会有一定几率额外掉落%s（可以兑换稀有资源）！快去战斗吧！"}
_tip_info_activity[121]={"节日道具兑换", "活动时间内，可以兑换指定道具！"}
_tip_info_activity[122]={"节日登陆有礼","活动时间内，完成对应目标就可以获得奖励！"}
_tip_info_activity[123]={"关卡掉落徽章", "活动时间内，主线关卡和精英关卡战斗胜利会有一定几率额外掉落%s（可以兑换稀有资源）！快去战斗吧！"}
_tip_info_activity[124]={"护额限时兑换", "活动时间内，可以兑换指定道具！"}
_tip_info_activity[125]={"护额登陆有礼", "活动时间内，完成对应目标就可以获得奖励！"}
_tip_info_activity[126]={"任务赠送护额", "活动时间内，完成对应目标就可以获得奖励！"}
_tip_info_activity[128]={"经验挑战次数增加","活动时间内，铜币挑战活动关卡可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[129]={"技之作战次数增加","活动时间内，铜币挑战活动关卡可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[130]={"分身挑战次数增加","活动时间内，铜币挑战活动关卡可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[131]={"经验挑战2倍掉落","活动时间内，经验挑战物品双倍掉落！快去战斗吧！"}
_tip_info_activity[132]={"技能挑战2倍掉落","活动时间内，技之挑战物品双倍掉落!快去战斗吧!"}
_tip_info_activity[133]={"分身挑战2倍掉落","活动时间内，分身挑战物品双倍掉落!快去战斗吧!"}
_tip_info_activity[134]={"忍者试炼2倍奖励","活动期间,每个试炼宝箱首次免费打开获得铜币翻倍!"}
_tip_info_activity[135]={"白绝必出忍者","活动时间内,白绝军团会必然刷新%s，快去挑战吧！"}

_vip_qianming = {
	{4,"没有铜币怎么能养活我呢？","提督，再来一碗饭吧~~"},--------------------------------------------VIP0  铜币500000
	{201,"哼哼，没体力了吧~快快退下吧~！","有了体力，就可以继续出击了！"},----------------------------VIP1  兵粮丸10
	{7,"想夺宝，没有精力怎么行？！","有了精力，就可以吊打“非提”了！"},--------------------------------VIP2  精力丸10
	{212,"箱子大拍卖了~走过路过，不要错过！","马上就可以跟北魔王买好吃的了，嘿嘿~"},------------------VIP3  橙色宝物箱子5
	{110,"嘿嘿，这个里面可以开出连装炮酱哟~","提督桑~快买呀~快买呀~~"},-------------------------------VIP4  橙色装备箱子5
	{220,"兽魂的荣誉，你值得拥有！","哇，这么多兽魂，还在等什么呢？"},--------------------------------VIP5  兽魂1000
	{129,"提督~提督，你快告诉我，谁最漂亮？","好多刷新令啊~不买吃亏哟~"},-----------------------------VIP6  刷新卡50
	{216,"棒棒各棒~精炼书可以强化装备哟~","要想拥有我这样的身材，必须精炼~"},-------------------------VIP7  高级觉醒书100
	{113,"有了它，就可以精炼电探了！","电探和鱼雷都是需要宝物精炼书的哟~"},---------------------------VIP8  宝物觉醒书500
	{102,"这点钱都不愿意出吗？提督。","那我晚上可就不会理你了，哼！"},--------------------------------VIP9  跃迁石1000
	{105,"这个我要了，提督，快来付钱！","阿犬，提督再不付钱，就去咬她！"},----------------------------VIP10 超级觉醒书100
	{115,"哇！恭喜！","好多精炼书哇~提督，我要嘛~快给我吧~！"},---------------------------VIP11 宝物觉醒书1000
	{5,"晶片源才是取得战斗胜利的关键！","这么多晶片源，简直要发大财了~！"},---------------------------VIP12 跃迁石2500
}
-- _string_piece_info
_probabilityName = {
	"高概率",
	"较高概率",
	"一般概率",
	"较低概率",
	"低概率",
	"极低概率",
}
-- 副本名称分类
_plot_copy_name = {
	"主线副本",
	"精英副本",
	"忍者副本",
	"日常副本",
	"隐藏副本",
}

_ship_types_by_color = {
	"白色",		--1
	"绿色",		--2
	"蓝色",		--3
	"紫色",		--4
	"橙色",		--5
	"红色",		--6
	"金色",		--7

}

-- 名称
_my_gane_name = {
	"铜币",---------------1
	"金币",--------------2
	"演武币",---------------3
	"战功",---------------4
	"天赋点",-------------5
	"试炼币",---------------6
	"队伍经验",---------------7
	"体力",---------------8
	"体力",---------------9
	"功能点",-------------10
	"演武币",---------------11
	"体力",---------------12
	"组织币",	--------13
	"其他项目站位",	-------------14
	"天赋点",	----------15
	"活跃度",	----------16
	"VIP经验",	----------17
	"矿石",	----------18
}


tip_equip_numerical_info_explain = {
	"获得装备",
	"失去装备",
}

tip_equip_action_info_explain = {
	"装备强化",
	"装备一键强化",
	"装备升级",
	"装备装备",
	"装备卸下",
	"装备合成",
	"装备分解",
}


tip_online_time = {
	"您好，不能重复领取已领过的奖励",		--1
	"暂无可用装备，可去无限山碰碰运气喔~",		--2
}

--战士信息界面文字颜色
_hero_color_info = {
	--[[
	{95,92,83}, --灰的缘分
	{0,170,65}, --亮的缘分名称
	{117,39,3},--亮的缘分说明
	{95,92,83},--灰的天赋
	{230,12,10},--亮的天赋名称
	{255,144,0},--亮的天赋说明
	{240,109,0},--天赋需求
	{16,138,5},--无缘分无天赋的颜色
	{110,43,10},--资源更新的颜色
	--]]
	{172,172,172}, --灰的缘分
	{1,219,32}, --亮的缘分名称
	{220,78,0},--亮的缘分说明
	{172,172,172},--灰的天赋
	{233,10,10},--亮的天赋名称
	{255,155,58},--亮的天赋说明
	{220,78,0},--天赋需求
	{16,138,5},--无缘分无天赋的颜色
	{110,43,10},--资源更新的颜色
	{34,244,255},--资源更新的颜色10
	{255,255,0},--资源更新的颜色11
}


--品质颜色值
tipStringInfo_quality_color_Type = {
	{255,255,255},				--0白
	{0,255,0},					--1绿
	{0,255,255},				--2蓝
	{255,0,255},				--3紫
	{255, 150, 0},				--4橙
	{255,0,0},					--5红
	{255,255,0},				--6金
	{255,150,255},				--7
	{255,0,13},					--8
	{255,0,13},					--9
	{255,0,13},					--10
	{105,79,56},				--12 战士说明颜色
	{127,127,127},					--13 缘分未激活颜色
	{255,255,255},					--14 缘分激活颜色
}

--装备洗练 颜色值
tipStringInfo_EquipmentRefine_color_Type = {
	{0, 255, 53},   -- 加数值(+100)
	{255, 0, 53},   -- 减数值(-100)
	{255, 0, 53},   -- 最大数值(max100)
	{80, 253, 255},   -- 有数字显示时
	{80, 253, 255},   -- 无数字显示时
}
--阵容界面相关颜色值(已开启)
formation_relationship_color_Type = {
	{255,255,255},		--战士信息界面已经激活的缘分R0 G140 B0
	{205,65,6},				--小忍者界面未激活缘分的灰色字未激活缘分 文本字 颜色R205 G65 B6
	{20,119,0},				--小忍者颜色名字R20  G119  B0
	{131,55,0},			--小忍者界面激活缘分 说明R131  G55  B0
	{146,118,118},		--战士信息界面未激活的缘分R:146   G:118  B:118
}

--忍者阵容缘分激活
formation_relationship_color_Type_two = {
	{131,131,131},		--未激活
	{0,255,255},		--激活
}

-- 周几
timeUtil_WeekX = {
	"一",		--1
	"二",		--2
	"三",		--3
	"四",		--4
	"五",		--5
	"六",		--6
	"日",		--7
	"周",		--8
}

server_state_tip_str={
	{0, "关闭"},
	{0, "流畅"},
	{0, "新服"},
	{1, "伺服器维护中，不妨先去喝喝茶"},
	{0, "推荐"},
	{0, "拥挤"},
	{1, "该服务器已关闭注册，请前往新服注册体验"},
}

--品质颜色值
color_Type = {
	{255,255,255},----1 纯白色
	{0,255,0}, -------2 亮绿色
	{0,255,255},------3 亮蓝色
	{255,0,255},------4 亮紫色
	{255, 150, 0},----5 橙色
	{255,0,0},--------6 大红色
	{255,182,0},------7 纯黄色{255,150,255},----8 暗粉色
	{110,43,8},----—--9 深棕色
	{255,0,13},------10 
	{255,0,13},------11 
	{255,75,0},------12 黑石山
	{50,50,50},------13 
	{255,234,42},----14 国战
	{252,244,168},---15 国战
	{255,85,39},-----16 个人战报
	{255,238,141},---17 个人战报
	{234,206,124},---18 将魂副本伤害对象
	{210,103,215},---19 将魂副本伤害对象
	{255,208,0},-----20 聊天
	{255,134,0},-----21 聊天
	{255,222,76},----22 聊天
	{0,120,255},-----23 聊天
	{255,249,201},---24 聊天
	{255,232,166},---25 忍者羁绊
	{18,227,0},------26 忍者羁绊
	{98,55,0},------27 小详情界面文字
	{10,103,0},------28 小详情界面数字
}

game_infomation_tip_str = {			-- 杂项
	"3",---------------------------------- 1 	三国无双
	"6",---------------------------------- 2 	三国无双
	"9",---------------------------------- 3 	三国无双
	"ttttttt",---------------------------- 4 	三国无双排行榜界面
	"yyyyyyyyyy",------------------------- 5 	三国无双排行榜界面
	"xfnhgx",----------------------------- 6 	三国无双排行榜界面
	"【",----------------------------------7 	TreasureChooseForRebornCell
	"】",----------------------------------8 	TreasureChooseForRebornCell
	"300",---------------------------------9 	HeroRecruitListView  招募一次花费金币显示值
	"/120",--------------------------------10 	TreasuresListView  背包上限
	"需要击败我方全队才能通过此关卡",------11 	GuanQia  
	"第一关",------------------------------12 	GuanQia  
	"击败敌人",----------------------------13 	GuanQia   
	"90",----------------------------------14 	PaiHang   
	"89",----------------------------------15 	PaiHang   
	"70",----------------------------------16 	PaiHang   
	"yyyyy",-------------------------------17 	ShopList   
	"100",---------------------------------18 	ShopList   
	"20/30",-------------------------------19 	ShopList   
	"达到40星可购买",----------------------20 	ShopList   
}

game_mine_tip_str = {			-- 领地攻讨
	"占领",-------------------------------------------- 1
	"后可解锁此据点",---------------------------------- 2
	"铜币",-------------------------------------------- 3
	"亮晶晶的铜币,散发著土豪的气息",------------------- 4
	"防守据点中",------------------------------------------ 5
	"VIP等级不足",--------------------------------------6
	
}

_strengthen_master_info = {		-- 强化大师
	"四件装备每强化10级，\r\n获得一次能力提升", ------1
	"四件装备每觉醒2级，\r\n获得一次能力提升",--------2
	"两件宝物每强化5级，\r\n获得一次能力提升",--------3
	"两件宝物每觉醒1级，\r\n获得一次能力提升",--------4
	"凑齐四件装备，即可开启强化大师！",------=--5
	"全身装备强化",-----------------------------------6
	"全身装备觉醒",-----------------------------------7
	"全身宝物强化",-----------------------------------8
	"全身宝物觉醒",-----------------------------------9
	"装备强化大师",-----------------------------------10
	"装备觉醒大师",-----------------------------------11
	"宝物强化大师",-----------------------------------12
	"宝物觉醒大师",-----------------------------------13
	"级达成",-----------------------------------------14
}

_treasure_info = {			-- 回收说明
	"忍者分解", -----------------------------------------------------1
	"装备分解",------------------------------------------------------2
	"忍者退化",------------------------------------------------------3
	"宝物退化",------------------------------------------------------4
	"1.退化后,初始宝物得到保留,并返还觉醒过程中消耗的同名宝物",------5
	"2.返还所有强化过程中消耗的经验和铜币",--------------------------6
	"3.返还所有宝物觉醒书(不返还觉醒时消耗的铜币)",------------------7
	"1.退化后,返还初始忍者碎片,并返还成长过程中消耗的同名忍者碎片.(不返还成长时消耗的铜币)",------------------8
	"2.返还所有升级过程中消耗的经验和铜币(不返还经验少于5000的部分)",------------------9
	"3.返还所有培养液(不返还培养时消耗的铜币和铜币)",------------------10
	"4.返还所有晶片石(不返还当前停留在经验条上,所消耗的晶片石)",-------11
	"5.返还跃迁中,所消耗的跃迁石、铜币、同名忍者",---------------------12
	"6.返还消耗的跃迁装备,全部返还到包裹中",---------------------------13
	"1.所有装备都可以进行分解,按照装备品质返还荣誉",-------------------14
	"2.返还所有强化过程中消耗的铜币",----------------------------------15
	"3.返还所有装备觉醒书",--------------------------------------------16
	"1.绿色及绿色以上的忍者可以分解",---------------------------------------------17
	"2.以兽魂形式返还忍者本身以及成长时消耗的同名忍者(不返还成长时消耗的铜币)",---18
	"3.返还所有升级过程中消耗的经验和铜币(不返还经验少于5000的部分)",-------------19
	"4.返还所有培养液(不返还培养时消耗的铜币和铜币)",-----------------------------20
	"5.返还所有晶片石(不返还当前停留在经验条上,所消耗的晶片石)",------------------21
	"6.返还跃迁中,所有消耗的跃迁石和铜币;消耗的同名忍者,以兽魂形式返还",----------22
	"7.所有消耗的跃迁装备,全部以忍者魂的形式返还(不返还合成跃迁装备所消耗的铜币)",--23
}

_equip_ment_info = {			-- 装备退化说明
	"装备退化",--------------------------------------------------------1
	"1.退化后,初始装备将以碎片形式返还。",-----------------------------2
	"2.返还所有强化过程中消耗的铜币。",--------------------------------3
	"3.返还所有觉醒过程中消耗的觉醒书。",------------------------------4
	"4.返还所有升星过程中消耗的同名装备碎片和铜币(不返还铜币)",------5
}
--片头战斗数据
_all_star_head_leader = {
[[182 0 1722 1 1 5 11833 1 11 0 0 5 1000000 0 1 11833 1 王小虎 11834 2 12 0 0 5 1000000 0 1 11834 1 王小龙 11835 3 31 0 0 4 1000000 0 1 11835 1 石黑龙 11836 4 18 0 0 5 1000000 0 1 11836 1 蚩尤 11837 6 501 0 0 6 1000000 0 1 11837 1 男主角 0  1  6 11827 1 49 0 0 4 1000000 0 1 11827 1 金罗汉 11828 2 15 0 0 5 1000000 0 1 11828 1 东方无敌 11829 3 55 0 0 4 1000000 0 1 11829 1 王风雷 11830 4 13 0 0 5 1000000 0 1 11830 1 火云邪神 11831 5 2 0 0 6 1000000 0 1 11831 1 天下无敌 11832 6 1 0 0 6 1000000 0 1 11832 1 天下无敌返老还童 0 ]],
[[39 1 20 1 1 0 3 0 0 4 212 0 1 251 0 0 3 1 -1 -1 1 3 0 0 100000 1 0 0 0 0 0 0 1 3 0 0 3 716 0 1 798 0 1 3 3 -1 -1 0 1 0 0 200000 1 0 0 0 0 2 0 0 200000 1 0 0 0 0 3 0 0 200000 1 0 0 0 0 0 0 0 2 0 0 4 65 0 1 70 0 0 2 1 -1 -1 1 3 0 0 100000 1 0 0 0 0 0 0 1 1 0 0 2 590 0 1 663 0 1 1 1 -1 -1 0 1 0 0 200000 1 0 0 0 0 0 0 1 2 3 0 0 3908 0 0 3 1 2 0 0 0 3908 1 4104 0 1 2 3 -1 -1 0 1 0 0 250000 1 0 0 0 0 2 0 0 250000 1 0 0 0 0 3 0 0 250000 1 0 0 0 1 3 0 0 0 3908 1 4104 0 1 3 0 -1 -1 1 1 0 0 0 3908 1 4104 0 1 1 0 -1 -1 0 0 0 0 1 0 0 4 44 0 1 46 0 0 1 3 -1 -1 1 1 0 0 150000 1 0 0 0 1 2 0 0 150000 1 0 0 0 1 3 0 0 150000 1 0 0 0 0 0 0 0 2 3 0 0 4496 0 0 3 0 2 0 0 0 3908 1 4780 0 0 2 3 -1 -1 1 1 0 0 300000 1 0 0 0 1 2 0 0 300000 1 0 0 0 1 3 0 0 300000 1 0 0 0 0 3 0 0 0 3908 1 4780 0 0 3 0 -1 -1 0 1 0 0 0 3908 1 4780 0 0 1 0 -1 -1 0 0 0 1 4 0 0 3 86 0 1 95 0 1 4 4 -1 -1 0 1 0 0 250000 1 0 0 0 0 2 0 0 250000 1 0 0 0 0 3 0 0 250000 1 0 0 0 0 4 0 0 250000 1 0 0 0 0 0 0 0 4 0 0 2 191 0 1 218 0 0 4 1 -1 -1 1 2 0 0 300000 1 0 0 0 0 0 0 1 5 0 0 0 3781 0 1 3967 0 1 5 3 -1 -1 1 2 0 0 9999999 1 0 0 1 0 0 1 3 0 0 9999999 1 0 0 1 0 0 1 4 0 0 9999999 1 0 0 1 0 0 0 0 0 1 5 0 0 3 3782 0 1 3968 0 1 5 4 -1 -1 0 1 0 0 9999999 1 0 0 1 0 0 0 2 0 0 9999999 1 0 0 1 0 0 0 3 0 0 9999999 1 0 0 1 0 0 0 4 0 0 9999999 1 0 0 1 0 0 0 0 0 0 6 0 0 6 2 0 1 3 0 0 6 1 -1 -1 1 5 0 0 9999999 1 0 0 1 0 0 0 0 0 1 6 0 0 3 3803 0 1 3989 0 1 6 1 -1 -1 0 6 0 0 9999999 1 0 0 1 0 0 0 0 1]],
[[182 0 1722 1 1 5 11833 1 11 0 0 5 1000000 0 1 11833 1 王小虎 11834 2 12 0 0 5 1000000 0 1 11834 1 王小龙 11835 3 31 0 0 4 1000000 0 1 11835 1 石黑龙 11836 4 18 0 0 5 1000000 0 1 11836 1 蚩尤 11837 6 511 0 0 6 1000000 0 1 11837 1 女主角 0  1  6 11827 1 49 0 0 4 1000000 0 1 11827 1 金罗汉 11828 2 15 0 0 5 1000000 0 1 11828 1 东方无敌 11829 3 55 0 0 4 1000000 0 1 11829 1 王风雷 11830 4 13 0 0 5 1000000 0 1 11830 1 火云邪神 11831 5 2 0 0 6 1000000 0 1 11831 1 天下无敌 11832 6 1 0 0 6 1000000 0 1 11832 1 天下无敌返老还童 0 ]],
[[39 1 20 1 1 0 1 0 0 3 442 0 1 109 0 0 1 1 -1 -1 1 2 0 0 2847 1 0 0 0 0 0 0 1 2 0 1 0 1541 0 1 468 0 1 2 3 -1 -1 0 1 1 0 1282 1 0 0 0 0 3 1 0 1282 1 0 0 0 0 5 0 0 1282 1 0 0 0 0 0 0 0 3 0 0 3 453 0 1 112 0 0 3 1 -1 -1 1 2 0 0 2963 1 0 0 0 0 0 0 0 5 0 1 0 1 0 1 1 0 0 5 1 -1 -1 1 2 1 0 384 1 0 0 0 0 0 0 0 1 0 0 3 443 0 1 110 0 0 1 1 -1 -1 1 2 0 0 6847 1 0 0 0 0 0 0 1 2 0 1 0 1542 0 1 469 0 1 2 3 -1 -1 0 1 1 0 22817 1 0 0 0 0 3 1 0 22817 1 0 0 0 0 5 0 0 22817 1 0 0 0 0 0 0 0 3 2 0 1 103 0 0 2 0 3 0 0 1 103 1 488 0 0 3 1 -1 -1 1 2 0 0 876486 1 0 0 1 0 0 0 1 0 0 1 103 1 489 0 0 1 0 -1 -1 0 0 1]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 503 0 0 2 999999 0 0 56 1 航母舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 511 0 0 2 999999 0 0 1321 1 驱逐舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 513 0 0 2 999999 0 0 1376 1 巡洋舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
}


--属性变更时提示的颜色值
tipStringInfo_property_change_color_Type = {
	{255,246,190}, 	--白色  r254  g246  b190	-1
	{68,206,36},	--绿色  r68   g206  b36		-2
	{0,180,255},	--蓝色  r0    g180  b255	-3
	{193,72,255},	--紫色  r193  g72   b255	-4
	{255, 150, 0},	--橙色  r255  g150  b0		-5
	{252,18,0},		--红色  r252  g18   b0		-6
	{255,192,0},	--金色  r252  g18   b0		-7
}


tipStringInfo_hero_change_Type = {
	"更换忍者成功!",			--1
	"忍者升级成功!",			--2
	"忍者经验增加",				--3
	"装备卸下成功",				--4
	"装备更换成功",				--5
	"上阵忍者成功!",			--6
	"穿戴装备成功!",			--7
	"装备宝物成功!",			--8
}

-- 演武场的文本
tipStringInfo_arena = {
	"%d名内刷新最高排名，可获得大量金币！", --1
	"每天%s发放", --2
	"杀入%d名可获得每日奖励", --3

}

-- 抢夺的文本
tipStringInfo_plunder = {
	"免战%d小时", --1
	"尚未集齐所有残卷，无法合成",--2
	"级",--3
	"第%d次",--4
	"对手匹配成功",--5
	"抢夺他人会解除免战状态，要继续吗？", --6
	"使用免战令可保护您的宝物残卷不被抢走。", --7
	"您已经处于免战中，\r\n剩余%s的免战时间，\r\n需要重复使用吗？" --8
	
}

-- 购买道具窗口
tipStringInfo_prop_buy = {
	-- 此序列根据 pirates_config中的273 的次序定义
	-- [1] 购买窗口标题
	-- [2] 使用后的提示语
	{"",""},-- 跃迁石,
	{"",""},-- 宝物觉醒书,
	{"",""},-- 刷新令,
	{"",""},-- 天命石,
	{"",""},-- 超级觉醒书,
	{"",""},-- 高级觉醒书,
	{"",""},-- 中级觉醒书,
	{"",""},-- 初级觉醒书,
	{"",""},-- 培养液,
	{"",""},-- 成长石,
	{"使用免战旗可保护您的宝物碎片不被抢走",""},-- 免战令(小),
	{"使用免战旗可保护您的宝物碎片不被抢走",""},-- 免战令(大),
	{"",""},-- 小型开发书,
	{"",""},-- 大型开发书,
	{"您目前的体力不足，使用【体力丸】补一补吧！","使用成功！体力补充完毕，快去【副本】吧！"},-- 兵粮丸,
	{"您目前的精力不足，使用【精力丸】补一补吧！",""},-- 精力丸,
	{"您目前的挑战书不足，使用【挑战书】恢复吧！","使用成功,挑战书增加1个！"},-- 挑战书
}
tipStringInfo_prop_buy_tip = {
	"%s数量不足,请先购买",--1
	"购买成功",--2
	"使用%s成功",--3
}


plunder_probability = {
	{500, "高概率"},
	{0, "较高概率"},
	{250, "一般概率"}, 
	{0, "较低概率"},
	{150, "低概率"},
	{0 , "极低概率"}
}

plunder_five = { -- 哪种概率时显示抢5次
	{2, 500}, 	--蓝色品质时需要这么多
	{3, 250},	--紫色品质时需要这么多
	{4, 150},	--橙色品质时需要这么多
}
-- 0白色
-- 1绿色
-- 2蓝色
-- 3紫色
-- 4橙色
-- 5红色
-- 6金色

tipStringInfo_destiny = {
	"恭喜获得属性加强", --1

}

-- 三国无双的文字
tipStringInfo_trialTower = {
	"重置次数已用完", --1
	"可免费重置%d次", --2
	"未上榜",	--3
	"星",	--4
	"今日可买%d次",	--5
	"到达%d星可购买",	--6
	"%d~%d关",--7
	"第%d关",--8
	"你还可以继续挑战，不需要重置", --9
	"星数不足",--10
	"请先选择一个合适的属性加成",--11
	"星数不足",--12
	"没有任何属性加成",--13
	"恭喜达成通关条件：", --14
	"没有达成通关条件：", --15
	"通过了%d关，可重置挑战", --16
	"(%d级开启扫荡)", --17
	"此关卡暂未开启",--18
	"你确定要回到第一层，从头开始吗？",--19
	"今日可买%d次",--20
	"荣誉不足",--21
	"领取成功",--22
	"进行重置，重置会回到第一层喔！",--23
	"今日还可铜币重置%d次",--24
	"更多",--25
	"前方战斗过于凶险,本层无法使用一键3星,还请谨慎选择",--26
	"恭喜你在第%d~%d关中,共获得了9星",--27
	"已达购买上限",--28
	"红色装备精华数量不足",--29
	"52级开启扫荡",--30
	"恭喜你在第%d~%d关中,共获得了%d星",--31
	"当前自动扫荡至第%d关(系统会帮您自动选择加成BUFF)，确定扫荡？",--32
	"已超过历史最高三星关卡，不可扫荡喔！",--33
}

tipStringInfo_trialTowerBattleDescribe = {
	{"在%d回合内获胜","当前回合：",99},
	{"我方死亡不超过%d人","阵亡人数：",6},
	{"剩余血量高于%d","我方血量：",0},
}

-- 暴击属性用的
tipStringInfo_trialTower_multiplying_color = {
	{198,0,255},----1
	{198,0,255}, -------2
	{255,126,0},------3 

}

-- 暴击属性用的
tipStringInfo_trialTower_multiplying = {
	"暴击", --1
	"大暴击", --2
	"幸运暴击", --3
	"双倍", --是否双倍(0,1) -4
}

tipStringInfo_trialTower_attribute = {
	"生命加成",--0 血
	"最终伤害",--1 伤
	"暴击率",--2 爆
	"命中率",--3 命
	"最终减伤",--4 免
	"抗暴率",--5 抗   攻击(%)+5
	"闪避率",--6 闪
}

-------------------------------------------------------------------
-- 0.生命          1.攻击          2.物防           3.法防
-- 4.生命(%)     5.攻击(%)     6.物防(%)      7.法防(%)
-- 8.暴击率(%)   9.抗暴率(%)  10.格挡率(%)   11.破击率(%)
-- 12.命中率(%)  13.闪避率(%)  14.物理免伤(%) 15.法术免伤(%)
-- 16.治疗率(%)  17.被治疗率(%)18.最终伤害      19.最终减伤
-- 20.初始查克拉     21.体质         22.力量          23.灵力
-- 24.物理攻击     25.法术攻击     26.治疗值        27.被治疗值
-- 28.燃烧伤害     29.中毒伤害     30.燃烧免伤      31.中毒免伤
-- 32.经验         33.最终伤害(%)34.最终减伤(%) 35.PVP终伤(%)
-- 36.PVP免伤(%)
--------------------------------------------------------------------
-- 三国无双属性加成
-- 数值从0 开始,自行+1

tipStringInfo_trialTower_attribute_info = {	
	{"生命","+%d.0"},	--1
	{"攻击","+%d.0"},	--2
	{"防御","+%d.0"},	--3
	{"术防","+%d.0"},	--4
	{"生命","+%d.0","%"},	--5
	{"攻击","+%d.0","%"},	--6
	{"防御","+%d.0","%"},	--7
	{"术防","+%d.0","%"},	--8
	{"暴击率","+%d.0","%"},	--9
	{"抗暴率","+%d.0","%"},	--10
	{"格挡率","+%d.0","%"},	--11
	{"破击率","+%d.0","%"},	--12
	{"命中率","+%d.0","%"},	--13
	{"闪避率","+%d.0","%"},	--14
	{"物理免伤","+%d.0","%"},	--15
	{"忍术免伤","+%d.0","%"},	--16
	{"治疗率增加","+%d.0","%"},	--17
	{"被治疗率增加","+%d.0","%"},	--18
	{"最终伤害","+%d.0"},	--19
	{"最终减伤","+%d.0"},	--20
	{"初始查克拉","+%d.0"},	--21
	{"体质","+%d.0"},	--22
	{"力量","+%d.0"},	--23
	{"灵力","+%d.0"},	--24
	{"物理攻击","+%d.0"},	--25
	{"额外伤害","+%d.0"},	--26
	{"治疗值","+%d.0"},	--27
	{"被治疗值","+%d.0"},	--28
	{"出血伤害","+%d.0"},	--29
	{"中毒伤害","+%d.0"},	--30
	{"出血免伤","+%d.0"},	--31
	{"中毒免伤","+%d.0"},	--32
	{"经验","+%d.0"},	--33
	{"伤害加成","+%d.0","%"},	--34
	{"伤害减免","+%d.0","%"},	--35
	{"PVP终伤","+%d.0","%"},	--36
	{"PVP免伤","+%d.0","%"},	--37
	{"初始合击点数","+%d.0"},	--38
	{"每次出手增加的查克拉","+%d.0"},	--39
	{"出血伤害","+%d.0","%"},	--40
	{"吸血率","+%d.0","%"},	--41
	{"查克拉","+%d.0"},	--42
	{"反弹率","+%d.0","%"},	--43
	{"暴击强度","+%d.0","%"},	--44
	{"免控率","+%d.0","%"},	--45
	{"小技能触发机率","+%d.0","%"},	--46
	{"格挡强度","+%d.0","%"},	--47
	{"控制率","+%d.0","%"},	--48
	{"治疗效果","+%d.0","%"},	--49
	{"——","+%d.0","%"},	--50
	{"忍者类型克制伤害","+%d.0","%"},	--51
	{"溅射伤害","+%d.0","%"},	--52
	{"技能伤害","+%d.0","%"},	--53
	{"被治疗率减少","+%d.0","%"},	--54
	{"伤害提升","+%d.0","%"},	--55
	{"奥义伤害率","+%d.0","%"},	--56
	{"增加造成的奥义伤害","+%d.0","%"},	--57
	{"减少造成的奥义伤害","+%d.0","%"},	--58
	{"增加暴击伤害","+%d.0","%"},	--59
	{"减少暴击伤害","+%d.0","%"},	--60
	{"受到的奥义伤害增加","+%d.0","%"},	--61
	{"查克拉回复速度","+%d.0","%"},	--62
	{"受到伤害降低","+%d.0","%"},	--63
	{"降低攻击","+%d.0","%"},	--64
	{"降低防御","+%d.0"},	--65
	{"伤害加成百分比提升（倍数）","+%d.0","%"},	--66
	{"降低奥义伤害率","+%d.0","%"},	--67
	{"降低伤害减免","+%d.0","%"},	--68
	{"降低防御","+%d.0","%"},	--69
	{"降低查克拉回复速度","+%d.0","%"},	--70
	{"忍者类型克制伤害加成","+%d.0","%"},	--71
	{"忍者类型克制伤害减免","+%d.0","%"},	--72
	{"降低攻击","+%d.0"},	--73
	{"奥义抗性","+%d.0","%"},	--74
	{"减少奥义抗性","+%d.0","%"},	--75
	{"降低免控率","+%d.0","%"},	--76
	{"复活机率","+%d.0","%"},	--77
	{"被复活机率","+%d.0","%"},	--78
	{"复活继承血量","+%d.0","%"},	--79
	{"复活继承查克拉","+%d.0","%"},	--80
	{"被复活继承血量","+%d.0","%"},	--81
	{"被复活继承查克拉","+%d.0","%"},	--82
	{"增加复活机率","+%d.0","%"},	--83
	{"增加复活继承血量","+%d.0","%"},	--84
}

tipStringInfo_resurrection_info_tips = {
	{"指定忍者复活，生命恢复","+%d","%"},	--1		复活用
	{"指定忍者生命恢复","+%d","%"},	--1		单体加血用
	{"全体忍者查克拉恢复","+%d"},	--1			全体加怒用
	{"指定忍者查克拉恢复","+%d"},	--1		单体加怒用
}

tipStringInfo_trialTower_attribute_icon_info = {
	{1,"攻击系列"},
	{2,"防御系列"},
	{3,"暴击系列"},
	{4,"格挡系列"},
}

-- 战斗buff美术字索引对照表
_battle_buff_effect_dictionary = {
	-- effect id       buff type
	"-1",	-- 0为攻击
	"-1",	-- 1为加血
	"artword_34",	-- 2为加怒
	"artword_35",	-- 3为减怒
	"-1",	-- 4为禁怒
	"xuanyun",	-- 5为眩晕
	"-1",	-- 6为中毒
	"artword_3",	-- 7为麻痹
	"artword_4",	-- 8为封技
	"zhuoshao",	-- 9为燃烧
	"-1",	-- 10为爆裂
	"artword_1",	-- 11为增加档格
	"tiebi",	-- 12为无敌
	"-1",	-- 13为必闪
	"-1",	-- 14为吸血
	"-1",	-- 15禁疗
	"-1",	-- 16盲目
	"artword_2",	-- 17冰冻
	"-1",	-- 18备用
	"-1",	-- 19备用
	"-1",	-- 20备用
	"zengjiagongji",	-- 21增加攻击
	"jiangdigongji",	-- 22降低攻击
	"zengjiafangyu",	-- 23增加防御
	"jiangdifangyu",	-- 24降低防御
	"hurt_add",	-- 25受到的伤害增加
	"hurt_sub",	-- 26受到的伤害降低
	"zengjiabaoji",	-- 27增加暴击
	"zengjiakangbao",	-- 28增加抗暴
	"zengjiamingzhong",	-- 29增加命中
	"zengjiashanbi",	-- 30增加闪避
	"chixuhuixue",	-- 31持续回血
	"artword_81",	-- 32清除负面效果
	"artword_10",	-- 33造成的伤害增加
	"-1",	-- 34全体秒杀
	"-1",	-- 35固定伤害
	"artword_27",	-- 36降低治疗效果
	"-1",	-- 37溅射
	"artword_8",	-- 38增加格挡强度
	"artword_22",	-- 39降低格挡率
	"artword_18",	-- 40增加吸血率
	"-1",	-- 41反弹
	"artword_84",	-- 42必杀技触发概率
	"artword_9",	-- 43增加破格挡率
	"artword_15",	-- 44增加反弹率
	"artword_11",	-- 45增加伤害减免
	"-1",	-- 46废弃
	"artword_110",	-- 47降低必杀技触发概率
	"artword_20",	-- 48降低暴击伤害
	"artword_31",	-- 49减少造成的奥义伤害
	"artword_5",	-- 50嘲讽
	"artword_25",	-- 51降低伤害加成
	"artword_10",	-- 52增加伤害加成
	"artword_14",	-- 53增加控制率
	"artword_16",	-- 54增加造成的奥义伤害
	"artword_31",	-- 55减少奥义伤害率
	"artword_56",	-- 56降低查克拉回复速度
	"artword_57",	-- 57提高查克拉回复速度
	"artword_6",	-- 58增加暴击伤害
	"-1",	-- 59--
	"artword_36",	-- 60增加暴击强度
	"artword_26",	-- 61降低伤害减免
	"artword_16",	-- 62增加奥义伤害率
	"artword_7",	-- 63增加格挡率
	"artword_10",	-- 64增加忍者类型克制伤害加成
	"artword_25",	-- 65增加忍者类型克制伤害减免
	"artword_19",	-- 66降低暴击率
	"artword_21",	-- 67降低抗暴率
	"artword_17",	-- 68增加奥义抗性
	"artword_32",	-- 69减少奥义抗性
	"artword_70",	-- 70复活機率
	"-1",	-- 71复活继承血量
	"-1",	-- 72复活继承怒气
	"artword_73",	-- 73增加复活复活機率
	"-1",	-- 74增加复活继承血量
	"artword_75",	-- 75被复活機率
	"-1",	-- 76被复活继承血量
	"-1",	-- 77被复活继承查克拉
	"artword_78",	-- 78免疫控制
	"-1",	-- 79复活
	"artword_80",	-- 80小技能伤害提升
	"fangzhu",	--81放逐效果
	"xuruo",	--82虚弱效果
	"meihuo",	-- 83混乱
	"shihua",	-- 84石化
	"-1",	-- 85复仇触发概率
	"-1",	-- 86复仇倍数
	"fuchou",	-- 87复仇效果
	"meihuo2",	-- 88魅惑     
    "-1",	-- 89复仇
    "-1",	-- 90复仇
   "fuchou2",	-- 91复仇
   "zhenshi",	-- 92真实伤害
    "-1",	-- 93控制真实伤害承受者目标
   "artword_12",	-- 94治疗率降低   
   "artword_44",	-- 95免控率上升   
   "artword_gandian",	-- 96感电
   "artword_gandian_1",	-- 97感电
    "-1",	-- 98复仇触发概率
    "-1",	-- 99复仇倍数
   "fuchou",	-- 100复仇效果
   "-1",	-- 101禁止神兽使用X回合
   "-1",	-- 102免控率降低
   "artword_23",	-- 103格挡强度降低
   "artword_81",	-- 104清除减益BUFF
   "artword_78",	-- 105免控率上升
   "artword_82",	-- 106虚化
   "artword_85",	-- 107清除高级增益buff
    "artword_108",	-- 108无视防御
    "artword_109",	-- 109无视抗暴率
    "artword_111",	-- 110无视格挡率
    "artword_112",	-- 111无视伤害减免
    "artword_113",	-- 112无视奥义抗性
    "artword_86",	-- 113须佐外衣（庇护）
    "artword_29",	-- 114控制率降低
    "artword_83",	-- 115神兽伤害减免
    "artword_xishou",	-- 116完全体尾兽化（伤害吸收）
    "-1",	-- 117究极反击（复仇）概率
    "-1",	-- 118究极反击（复仇）伤害倍数
    "artword_fanji",	-- 119究极反击（复仇）效果（用于程序表现效果）
    "artword_87",	-- 120被治疗率增加
    "-1",	-- 121伤害吸收2（第2套动画+飘字）
   "artword_asbh",	-- 122庇护2（第2套庇护动画+飘字，情人节贝吉塔【爱神庇护】专用）   
   "artword_116",	-- 123小技能伤害降低
   "artword_117",	-- 124被治疗率增加
   "artword_125",	-- 125复活概率降低
   "-1",	-- 126增加计数器
   "-1",	-- 127减少计数器
   "-1",	-- 128清空计数器
   "artword_129",	-- 129停滞（石化2）
   "artword_33",	-- 130降低吸血率
   "artword_131",	-- 131生命链接
   "artword_133",	-- 132添加惩戒爪击
   "artword_134",	-- 133减少惩戒爪击
   "artword_135",	-- 134清空惩戒爪击
   "-1",	-- 135神罚（复仇）概率
   "-1",	-- 136神罚（复仇）伤害倍数
   "artword_132",	-- 137神罚（复仇）效果（用于程序表现效果）
   "artword_136",	-- 138伤害吸收3悟吉塔·极意形态专用【神罚气盾】
}

-- 战斗buff光效索引对照表
_battle_buff_animation_dictionary = {
	-- effect id       buff type
	{"-1"},	-- 0为攻击
	{"-1"},	-- 1为加血
	{"-1"},	-- 2为加怒
	{"-1"},	-- 3为减怒
	{"-1"},	-- 4为禁怒
	{"5", 1, {"standby"}, {{2,222},{2,222},{2,222},{2,222}}},	-- 5为眩晕
	{"-1"},	-- 6为中毒
	{"7", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 7为麻痹
	{"8", 1, {"standby"}, {{-8,100},{-8,100},{-8,100},{-8,100}}},	-- 8为封技
	{"9", 1, {"standby"}, {{0,20},{0,20},{0,20},{0,20}}},	-- 9为燃烧
	{"-1"},	-- 10为爆裂
	{"-1"},	-- 11为增加档格
	{"12", 3, {"start", "standby", "byattack"}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}},	-- 12为无敌
	{"-1"},	-- 13为必闪
	{"-1"},	-- 14为吸血
	{"-1"},	-- 15禁疗
	{"-1"},	-- 16盲目
	{"18", 1, {"standby"}, {{0,20},{0,20},{0,20},{0,20}}},	-- 17冰冻
	{"-1"},	-- 18备用
	{"-1"},	-- 19备用
	{"-1"},	-- 20备用
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 21增加攻击
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 22降低攻击
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 23增加防御
	{"-1"},	-- 24降低防御
	{"-1"},	-- 25受到的伤害增加
	{"-1"},	-- 26受到的伤害降低
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 27增加暴击
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 28增加抗暴
	{"-1"},	-- 29增加命中
	{"-1"},	-- 30增加闪避
	{"-1"},	-- 31持续回血
	{"-1"},	-- 32清楚负面效果
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 33造成的伤害增加
	{"-1"},	-- 34全体秒杀
	{"-1"},	-- 35固定伤害
	{"-1"},	-- 36降低治疗效果
	{"-1"},	-- 37溅射
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 38增加格挡强度
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 39降低格挡率
	{"-1"},	-- 40增加吸血率
	{"-1"},	-- 41反弹
	{"-1"},	-- 42小技能触发概率
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 43增加破格挡率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 44增加反弹率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 45增加伤害减免
	{"-1"},	-- 46废弃
	{"-1"},	-- 47降低小技能触发概率
	{"-1"},	-- 48降低暴击伤害
	{"-1"},	-- 49减少造成的必杀伤害
	{"50", 2, {"start", "standby"}, {{2,100},{17,100},{25,100},{21,180}}, {{2,100},{17,100},{25,100},{21,180}}},	-- 50嘲讽
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 51降低伤害加成
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 52增加伤害加成
	{"-1"},	-- 53增加控制率
	{"-1"},	-- 54增加造成的必杀伤害
	{"-1"},	-- 55减少必杀伤害率
	{"-1"},	-- 56降低怒气回复速度
	{"-1"},	-- 57提高怒气回复速度
	{"-1"},	-- 58增加暴击伤害
	{"-1"},	-- 59--
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 60增加暴击强度
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 61降低伤害减免
	{"-1"},	-- 62增加必杀伤害率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 63增加格挡率
	{"-1"},	-- 64增加忍者类型克制伤害加成
	{"-1"},	-- 65增加忍者类型克制伤害减免
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 66降低暴击率
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 67降低抗暴率
	{"-1"},	-- 68增加必杀抗性
	{"-1"},	-- 69减少必杀抗性
	{"-1"},	-- 70复活概率
	{"-1"},	-- 71复活继承血量
	{"-1"},	-- 72复活继承怒气
	{"-1"},	-- 73增加复活复活概率
	{"-1"},	-- 74增加复活继承血量
	{"-1"},	-- 75被复活概率
	{"-1"},	-- 76被复活继承血量
	{"-1"},	-- 77被复活继承怒气
	{"-1"},	-- 78免疫控制
	{"79", 3, {"start", "start", "start", "standby", "byattack"}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}},	-- 79为复活
	{"-1"},	-- 80小技能伤害提升
	{"81", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--81放逐效果
	{"82", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	--82虚弱效果
	{"83", 1, {"standby"}, {{0,180},{0,180},{0,180},{0,180}}},	--83混乱效果
	{"84", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--84石化效果
	{"-1"},	-- 85增加复仇概率
	{"-1"},	-- 86增加复仇伤害
	{"87", 1, {"start"}, {{0,0},{0,0},{0,0},{0,0}}},	--87复仇闪电
	{"88", 1, {"start"}, {{0,180},{0,180},{0,180},{0,180}}},	--88魅惑效果
	{"-1"},	-- 89增加复仇概率
	{"-1"},	-- 90增加复仇伤害
	{"89", 1, {"start"}, {{0,0},{0,0},{0,0},{0,0}}},	--91复仇闪电
	{"-1"},	-- 92真实伤害
	{"-1"},	-- 93控制真实伤害承受者目标
	{"-1"},	-- 94治疗率增加
	{"-1"},	-- 95免控率上升
	{"92", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 96弱感电
	{"93", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 97强感电
	{"-1"},	-- 98增加复仇概率
	{"-1"},	-- 99增加复仇伤害
	{"94", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--100复仇闪电
	{"-1"},	-- 101禁止神兽使用X回合shi
	{"-1"},	-- 102增加复仇伤害
	{"-1"},	-- 103增加复仇概率
	{"-1"},	-- 104增加复仇伤害
	{"-1"},	-- 105增加复仇概率
	{"95", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--106虚化
	{"-1"},	-- 107禁止神兽使用X回合shi
	{"-1"},	-- 108无视属性
	{"-1"},	-- 109无视属性
	{"-1"},	-- 110无视属性
	{"-1"},	-- 111无视属性
	{"-1"},	-- 112无视属性
	{"96", 1, {"standby"}, {{0,70},{0,70},{0,70},{0,70}}},-- 113须佐外衣（庇护）
	{"-1"},	-- 114控制率降低
	{"-1"},	-- 115神兽伤害减免
	{"97", 1, {"standby"}, {{0,-40},{0,-40},{0,-40},{0,-40}}},	-- 116完全体尾兽化（伤害吸收）
	{"-1"},	-- 117究极反击（复仇）概率
	{"-1"},	-- 118究极反击（复仇）概率
	{"98", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},-- 119究极反击（复仇）概率
	{"99", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},-- 120睡眠
	{"121", 1, {"standby"}, {{0,80},{0,80},{0,80},{0,80}}},	-- 121伤害吸收2（第2套动画+飘字）
	{"101", 1, {"standby"}, {{0,10},{0,10},{0,10},{0,10}}},	-- 122庇护2（第2套庇护动画+飘字，情人节贝吉塔【爱神庇护】专用）   
	{"-1"},	-- 123小技能伤害降低
	{"-1"},	-- 124被治疗率增加
	{"-1"},	-- 125复活概率降低
	{"-1"},	-- 126增加计数器
	{"-1"},	-- 127减少计数器
	{"-1"},	-- 128清空计数器
	{"129", 1, {"standby"}, {{0,-40},{0,-40},{0,-40},{0,-40}}},	--129停滞（石化2）
	{"-1"},	-- 130降低吸血率
	{"131", 1, {"standby"}, {{0,100},{0,100},{0,100},{0,100}}},	-- 131生命链接
	{"-1"},	-- 132添加惩戒爪击
	{"-1"},	-- 133减少惩戒爪击
	{"-1"},	-- 134清空惩戒爪击
	{"-1"},	-- 135神罚（复仇）概率
	{"-1"},	--136神罚（复仇）伤害倍数
	{"98", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 137神罚（复仇）效果（用于程序表现效果）
	{"132", 1, {"standby"}, {{0,100},{0,100},{0,100},{0,100}}},	-- 138伤害吸收
}

-- 戰鬥buff光效头像索引對照表
_battle_buff_head_animation_dictionary = {
	["81"] = {"head_81", 1, {"standby"}, {{-20,0},{-20,0},{-20,0},{-20,0}}},
}

-- 计数器光效配置
_battle_buff_counter_animation = {
	["1-1"] = {"2001", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-2"] = {"2002", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-3"] = {"2003", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-4"] = {"2004", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-5"] = {"2005", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-6"] = {"2006", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-7"] = {"2007", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-8"] = {"2008", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-9"] = {"2009", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["2-1"] = {"1001", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-2"] = {"1002", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-3"] = {"1003", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-4"] = {"1004", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-5"] = {"1005", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-6"] = {"1006", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
}

tipStringInfo_mine_info = {
	"下线",	--1
	"月",--2
	"周",--3
	"天",--4
	"小时",--5
	"分钟",--6
	"%s忍者",--7
	"%s特产",--8
	"%s简介",--9
	"(巡逻据点时有几率获得)",--10
	"巡逻据点中",	--11
	"巡逻据点完毕",	--12
	"下次收益时间:",--13
	"好友|x|击溃了侵略者，你获得了|y|",----------------------------14
	"玩耍%d小时后，",------------------------------------------------------15
	"|x|悠闲的完成了巡视工作，获得了|y|",------------------------16
	"本次巡逻据点完成，好多奖励啊！",------17
	"在门主人的关爱下大伙儿都过得非常滋润，请收下奖励！",-----18
	"主人加油，我去巡逻据点了！",-----19
	"你放心去战斗吧，这里就交给我啦！",--20
	"x%d进行%d小时",--21
	"的%s吗？",--22
	{"悠闲的巡逻","认真的巡逻","全力的巡逻"},--23
	"[%s]",--24
	"不要随意进入好友的据点！",--25 -- 未开启或非防守据点状态下
	"多谢出手相助！这些礼品就送给你啦！",--26 --镇压后获得奖励提示语
	"级",--27
	"已有据点：",--28
	"巡逻据点中的位置：",--29
	"被偷袭的据点：",--30
	"当前没有好友开启法易路岛，是否前往添加好友",--31
	"上线", --32
	}
--MineManagerFriendList

tipStringInfo_mine_patrol_color = {
	{255,238,94},	----1 时间颜色
	{255,255,255},	----2 普通的描述文字颜色
	{255,44,9},	----3 暴动的描述文字颜色
	{84,255,9},	----4 镇压的描述文字颜色
	{255,228,176},	----5 结束后的描述文字颜色
	{255,246,0},	----6 收益倒计时的颜色
	{255,255,255},	----7 收益倒计时标题的颜色
}

-- 侵略者中 界面刷新请求的间隔时间.单位是秒
tipStringInfo_betrayArmy_request_refresh_interval = 5*60
tipStringInfo_betrayArmy_info = {
	"今日可买%d次",	--1
	"战功不足",--2
	"已达购买上限",--3
	"红色忍者精华数量不足",--4
	"成长石数量不足",--5
}

numberToStringArg = {
	"1",
	"2",
	"3",
	"4",
	"5",
	"6",
	"7",
	"8",
	"9",
	"十",
	"百",
	"千",
	"0"
}

--战斗内的1到3档的速度
-- Fury (V2, 2026-09-23): 4-6 son las marchas VIP x4/x5/x6. El valor se
-- guarda en userFightSpeed y el combate recupera la marcha BUSCANDOLO en esta
-- tabla (FightUI.lua), asi que cada marcha necesita un valor DISTINTO.
_fight_run_speed = {
	0.72,--第一档的速度-0.85
	0.62,--第二档的速度-0.66
	0.4,--第三档的速度-0.6
	0.39,--x4 (VIP)
	0.38,--x5 (VIP)
	0.37,--x6 (VIP)
}
-- Escala del planificador en cada marcha del combate (FightUI.lua).
-- Fabrica (client_original): 1.29/1.7/2.0/2.5; 5 y 6 seguian el paso de +0.5.
-- 3-oct-2026: todas +10 % (2 decimales). Las 4-6 se abren por VIP (FuryGameSpeed.lua).
_fight_time_scale = {
	1.42,--第一档的速度
	1.87,--第二档的速度
	2.2,--第三档的速度
	2.75,--x4 (VIP)
	3.3,--x5 (VIP)
	3.85,--x6 (VIP)
}

-- Fury (V2/V3): aviso del boton de velocidad y rotulo del ajuste de velocidad
_fury_speed_text = {
	"战斗速度x%d在VIP%d解锁",
	"游戏速度x%s",
}

--战斗内武将的成长缩放比利
_fight_evolution_scales = {
	1,--1级
	1,--2级
	1,--3级
	1,--4级
}

tipStringInfo_time_info = {
	"年",	--1
	"月",	--2
	"周",	--3
	"天",	--4
	"小时",	--5
	"分钟",	--6
	"秒",	--7
	"刚刚",	--8
	"之前",	--9
	"日",	--10
	"时",	--11
	}


-- Vip等级上限控制
_vip_max_grade = {
	20,
	}

-------------------------是否显示分享(0隐藏，1显示)
open_share_fun = 0

-------------------------分享描述文字
share_text = {
	{1,"邀请好友","我在玩最热血的格斗手游《龙虎门》，连击爽到爆！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},------------------------------------------
	{2,"通关主线副本第1章","哈哈哈，天下无敌也不是我的对手，我刚刚成功通关了《龙虎门》第1章，我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},----------------------------
	{3,"演武场杀入前1000名","有志者事竟成！经过不懈努力，我终于杀到《龙虎门》演武场前1000名了！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},------------------------------
	{4,"获得橙色忍者","《龙虎门》的橙色忍者果然给力！我刚得到一名强力橙色忍者，我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},------------------
	{5,"主角达到30级","才一眨眼的功夫我的《龙虎门》主角就升到30级了？超爽啊！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},-------------------------------
	{6,"通关主线副本第8章","我刚刚跟龙虎三皇一起击败了大龙头！不信？快来《龙虎门》看看吧！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},--------------------------------
	{7,"主角达到50级","我的《龙虎门》主角升到50级了！战力更上一层楼！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},-----------------------------
	{8,"演武场达到第1名","跪下膜拜吧！本座已经登顶演武场最强之位！快来《龙虎门》一睹我的风采吧！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},-------------------------
}

_learn_skill_str ={
	{"以柔克刚","灵活多变","至刚至阳","无坚不摧","攻防兼备","虚实莫测","朴实无华","出其不意"},
	{"无事件相同","1对事件相同","2对事件相同","3事件相同","3带2事件相同","4事件相同","5事件相同"}
}

_user_pic_index = {
}
_user_pic_index["200101"] = 200101
_user_pic_index["200201"] = 200201
_user_pic_index["200104"] = 200104
_user_pic_index["200203"] = 200203
push_close_class = 
{
	"CampaignClass",
	"DestinySystemClass",
	"HeroRecruitListViewClass",
	"ShopClass",
	"RefiningFurnaceClass",
	"LearingSkillsDevelopClass",
	"ActivityWindowClass",
	"HeroShopClass",
	"OpenServerActivityClass",
	"SevenDaysManagerClass",
	"RechargeDialogClass",
	"LPVEMapClass",
	"HeroStorageClass",
	"PropStorageClass",
	"EmailManagerClass",
	"FameHallClass",
	"FriendManagerClass",
	"PropStorageClass",
	"ArenaClass",
	"PlunderClass",
	"TrialTowerClass",
	"WorldBossClass",
	"HeroDevelopClass",
	"FormationTigerGateClass",
	"DailyTaskClass",
	"CaptureResourceClass",
	"EquipStrengthenRefineStrorageClass",
	"LDuplicateWindowClass",
}
csb_cacher_path = {
	--{1,"activity/7days/week_Activities_list.csb","6","七日活动"},
	--{2,"activity/DailyTasks/dailytasks_list.csb","8","日常任务"},
	--{3,"activity/wonderful/daily_attendance_list.csb","8","签到"},
	--{4,"activity/wonderful/landed_gifts_list.csb","6","累积充值"},
	--{5,"activity/wonderful/open_service_fund_list.csb","6","开服基金"},
	--{6,"activity/wonderful/share_weixin_list.csb","6","微信分享"},
	{7,"campaign/ArenaStorage/ArenaStorage_list_role.csb","10","演武场主"},
	--{8,"campaign/ArenaStorage/ArenaStorage_ranking_list.csb","6","演武场排行榜"},
	--{9,"campaign/ArenaStorage/ArenaStorage_shop_list.csb","6","演武场商店"},
	--{10,"campaign/Snatch/indiana_list.csb","6","抢夺宝物界面"},
	--{11,"campaign/Snatch/snatch_results_list.csb","6","夺5次结算列表"},
	--{12,"campaign/TrialTower/trial_tower_list_list.csb","6","无限山排行榜"},
	--{13,"campaign/TrialTower/trial_tower_raids_list.csb","6","一键三星结算列表"},
	--{14,"campaign/TrialTower/trial_tower_raids_list_1.csb","6","一键三星结算列表2"},
	--{15,"campaign/TrialTower/trial_tower_shop_list.csb","6","无限山商店"},
	--{16,"campaign/WorldBoss/worldBoss_ranking_list.csb","6","光丘守护界面排行榜"},
	--{17,"campaign/WorldBoss/worldBoss_ranking_list_1.csb","6","光丘守护界面排行榜2"},
	--{18,"campaign/WorldBoss/worldBoss_reward_list.csb","6","功勋奖励列表"},
	--{19,"campaign/WorldBoss/worldBoss_shop_list.csb","6","功勋商店列表"},
	--{20,"duplicate/mopping_results_list.csb","6","扫荡列表"},
	--{21,"duplicate/pve_leaderboard_list.csb","6","副本排行榜"},
	--{22,"duplicate/pve_duplicate_k.csb","8","副本"},
	--{23,"email/email_list.csb","6","邮件列表"},
	--{24,"friend/friend_list.csb","6","好友列表"},
	--{25,"friend/friend_tuijian_list.csb","6","推荐好友列表"},
	--{26,"list/list_daoju_1.csb","8","商城道具列表"},
	--{27,"list/list_equipment_1.csb","8","装备仓库列表"},
	--{28,"list/list_equipment_sui_1.csb","8","装备碎片列表"},
	--{29,"list/list_equipment_Wear_1.csb","8","装备穿戴列表"},
	--{30,"list/list_property_1.csb","8","包裹界面"},
	--{31,"list/list_libao.csb","6","商城礼包列表"},
	--{32,"packs/HeroStorage/list_generals_big.csb","10","忍者仓库列表"},
	--{33,"shop/package_preview_list.csb","6","礼包预览列表"},
	--{34,"shop/shop_chongzhi_list.csb","6","充值列表"},
	--{35,"shop/HeroShop/heroShop_list.csb","6","神秘商店列表"},
	--{36,"skills/skills_list_line_list.csb","4","更换技能列表"},
	--{37,"skills/skills_list_xx_list.csb","4","学习技能列表"},
	--{38,"system/famous_rank_list.csb","4","大师榜排行榜列表"},
	--{39,"system/Atlas_list.csb","6","图鉴列表"},
	--{40,"icon/item_big.csb","12","图标icon"},
	--{41,"formation/line_up_icon_up.csb","4","忍者列表图标icon"},
	--{42,"campaign/Snatch/snatch.csb","2","宝物抢夺"},
	--{43,"secret_society/secret_map_icon.csb","30","资源抢夺"},
	--{44,"system/raiders_xzs_right.csb","5","攻略"},
}


--应用推送信息 格式: 时间 "12-30","内容","每天推送次数","类型","设置中的标题"
_app_push_notification = {
	--{"24-0"," Ninjas are longing for power up, they need you!! "},	----长时间未登录推送
	--{"12-0","It is time for Lunch!"},	----领体力12点
	--{"18-0","It is time for Supper!"},	----领体力18点
	{"9-00","美好的一天要从一乐拉面开始！","1","1","领取体力1"},	--------9点领取能量
	{"12-00","午饭时间到了，美味的一乐叉烧拉面已准备好！","1","2","领取体力2"},	--------12点领取能量
	{"18-00","晚餐清淡一点吧，就点一碗一乐素拉面！","1","3","领取体力3"},	--------18点领取能量
	{"21-00","美好的夜宵时间，当然还是一乐！","1","4","领取体力4"},	--------21点领取能量
}

chat_sent_string = 
{
	"暱称不可为空", ---------------------1
	"请输入聊天内容", ---------------------2
	"请输入暱称:", ---------------------3
	"请输入文字:", ---------------------4
	"文字过多无法发送", ---------------------5
	"请输入资讯:", ---------------------6
	"请输入好友名称", ---------------------7
	"请输入玩家名称", ---------------------8
	"豪气冲天给大家赠送了拼手气红包，大家速度来抢，手速慢就没了喔", ---------------------9
	"获得铜币", ---------------------10
	"您的手速太慢了，红包已经被抢完啦！", ---------------------11
	"您已抢过该红包了！", ---------------------12
	"获得代金券", ---------------------13
	"请不要重复发言", ---------------------14
	"聊天时间间隔太短", ---------------------15
	"内容含有非法字元，请修改", ---------------------16
	"不能赠送给自己", ---------------------17
	"确定",                        ---------------------18
	"请输入聊天内容",             ---------------------19繁体包这个为繁体2为简体
	"请输入玩家名称",            -----------------20繁体包这个为繁体8为简体
}

---------【数码宝贝】资源加载时的提示文字
tipStringInfo_loading_notice_info = {
	"小提示：木叶飞舞之处，火亦生生不息！",					----  1
	"小提示：战斗中连续击打敌人，忍者可获得攻击加成喔！",						----  2
	"小提示：这大概就是青春吧！",						----  3
	"小提示：选择正确的连击顺序会大幅提高战斗伤害",					----  4
	"小提示：去组个强力的忍者小队吧！",							----  5
	"小提示：每天登陆后的第一件事是领取签到奖励",								----  6
	"小提示：鸣人和佐助，谁更厉害呢？",					----  7
	"小提示：忍者等级不能超过玩家角色等级",			----  8
	"小提示：合理布阵让战斗、生活、撩妹更轻松",			----  9
	"小提示：我在人生的道路上迷失了方向",				---- 10
	"小提示：完成日常任务可以获得大量队伍经验",				---- 11
	"小提示：忍者武器觉醒后会有大幅提高奥义效果",					---- 12
	"小提示：注意角色间的属性相克，不要老骂策划啊！",				---- 13
	"小提示：启动忍者之间的羁绊关系会更加强大",		---- 14
	"小提示：每天登陆都有一次免费招募机会",		---- 15
	"小提示：活动副本可以掉落大量铜币和经验道具",		---- 16
	"小提示：强化装备可以快速提升战斗力",		---- 17
	"小提示：组织战决赛为淘汰赛制，大家都要拼尽全力哟！",		---- 18
	"小提示：合理释放策略技能可以使战斗过程更加顺利",		---- 19
	"小提示：装备进阶可以快速获得战力提升",		---- 20
}

--------------------------------小助手推荐忍者配置(小头像ID,名称,品质|小头像ID,名称,品质|……)
tipStringInfo_strategy_formation = {
	{337, "1031,石黑龙,4|1049,金罗汉,4"},											--病毒种
	{338, "1034,韦陀,4|1040,碎骨门主,4|1057,剑魔连城,4|1065,金鹏,4"},					--疫苗种
	{339, "1037,夺命老妖,4|1046,烈阳神,4|1050,毒将军,4|1063,翼龙,4"},					--数据种
	{340, "1035,小佩,4|1044,华九公,4|1051,药神明镜,4|1058,参圣,4"},						--其他
}
tipStringInfo_union_dynamic_color = {
	{255,242,94},	----1 时间颜色
	{255,244,183},	----2 普通的描述文字颜色
	{191,255,38},	----3 成员名称颜色
	{255,150,0},	----4 舰队经验颜色
	{255,0,0},	--------5 副本NPC颜色
	{5,240,255},	----6 祭天颜色-绿色简单
	{25,149,255},	----7 祭天颜色-蓝色普通
	{219,23,255},	----8 祭天颜色-紫色豪华
}
tipStringInfo_union_zhuangxiu_color = {
	{93,56,24},	----1 普通文字描述-黑色
	{205,5,0},	----2 成员名称颜色-红色
	{199,80,0},	----3 数值颜色
	{0,164,27},	----4 祭天颜色-绿色简单
	{19,119,204},	----5 祭天颜色-蓝色普通
	{161,12,188},	----6 祭天颜色-紫色豪华
}

tipStringInfo_union_str = {			-- 组织文字
	"内部公告",-------------------------------------------- 1
	"组织宣言",---------------------------------- 2
	"这是您自己",-------------------------------------------- 3
	"成员%s进行[%s]，为组织增加%s点经验",-------------------------------------------- 4
	"成员%s在[%s]时脑洞大开触发暴击，为组织增加%s点经验",-------------------------------------------- 5
	"成员%s加入组织，跟成员们打个招呼吧！",-------------------------------------------- 6
	"成员%s被逐出组织",-------------------------------------------- 7
	"首领%s由于长期不作为被成员%s弹劾，恭喜%s成为新的首领",-------------------------------------------- 8
	"成员%s被任命为副首领，大家热烈欢迎！",-------------------------------------------- 9
	"大家齐心协力，击杀[%s],为组织增加了%s点经验",-------------------------------------------- 10
	"众团员齐心协力，击破[%s]，快去领取通关奖励吧！",-------------------------------------------- 11
	"成员%s退出了组织",-------------------------------------------- 12
	"初级建设",-------------------------------------------- 13
	"普通建设",-------------------------------------------- 14
	"高级建设",-------------------------------------------- 15
	"组织%d级可购买",----------------------------------------16
	"已达购买上限",  ----------------------------------------17
	"今日可买%d次",  ----------------------------------------18
	"可购买%d次",  ----------------------------------------19
	"组织剩余%d件",  ----------------------------------------20
	"请选择组织标志标志",  ----------------------------------------21
	"请输入组织名称",  ----------------------------------------22
	"玄铁宝箱",-------------------------------------------- 23
	"青铜宝箱",-------------------------------------------- 24
	"白银宝箱",-------------------------------------------- 25
	"黄金宝箱",-------------------------------------------- 26
	"达到%s点组织贡献即可领取奖励",-------------------------------------------- 27
	"您已经领取过该奖励了！",-------------------------------------------- 28
	"成员%s进行[%s]，增加%s点贡献进度，为组织增加%s经验",-------------------------------------------- 29
	"只有你一人时才能解散组织",-------------------------------------------- 30
	"确定要解散组织吗？",-------------------------------------------- 31
	"您已成功解散组织",-------------------------------------------- 32
	"只有首领和副首领可以修改战鼓标志",-------------------------------------------- 33
	"组织等级不足，无法更换",-------------------------------------------- 34
	"未上榜",-------------------------------------------- 35
	"贡献值不足",-------------------------------------------- 36
	"名称中包含敏感字元",-------------------------------------------- 37
	"确定取消申请组织？",-------------------------------------------- 38
	"确定花费%s金币创建组织？",-------------------------------------------- 39
	"恭喜您创建组织成功，快去召集成员加入吧！",-------------------------------------------- 40
	"您今日已建设过了，请明日再来！",-------------------------------------------- 41
	"花费一点铜币就可以进行建设！",-------------------------------------------- 42
	"花费少量金币就可以进行建设！",-------------------------------------------- 43
	"这是成长最快的建设方式！",-------------------------------------------- 44
	"VIP等级达到2级可开启",-------------------------------------------- 45
	"需要先转让首领之位元才能退出组织",-------------------------------------------- 46
	"确定离开组织？",-------------------------------------------- 47
	"今日无人建设",-------------------------------------------- 48
	"确认解散组织？你可以做的更好",-------------------------------------------- 49
	"是否花费%s金币购买%s",-------------------------------------------- 50
	"输入内容不能为空",-------------------------------------------- 51
	"您已被逐出组织",-------------------------------------------- 52
	"首领之位已移交给%s，让%s带领大家继续前进吧！", ---------------------------53
	"成员%s被任命为副首领", ----------------------------------54
	"副首领%s被罢免职位", ----------------------------------55
	"最多输入%s字",----------------------------------56
	"没有更多组织了", ----------------------------------57
	"确认逐出成员", ----------------------------------58
	"该据点尚未开启", ----------------------------------59
	"放置于", ----------------------------------60
	"明", ----------------------------------61
	"暗", ----------------------------------62
	"资讯不明", ----------------------------------63
	"您许可权不足", ----------------------------------64
	"备战中", ----------------------------------65
	"战斗中", ----------------------------------66
	"休战中", ----------------------------------67
	"领取成功", ----------------------------------68
	"暂未加入组织", ----------------------------------69
	"剩余组织贡献不足", ----------------------------------70
	"报名成功", ----------------------------------71
	"阵容保存成功", ----------------------------------72
	"比赛中无法更换阵容", ----------------------------------73
	"至少放置1个忍者", ----------------------------------74
	"忍者上阵数量超过上限", ----------------------------------75
	"比赛中无法查看昨日战况", ----------------------------------76
	"组织全部成员被击败，组织战结束",---------------------------77
	"第%d轮比赛结束，成功进入下一轮",---------------------------78
	"组织战结束，奖励将在21:30准时发放~",---------------------------79
	"仅限攻型忍者参赛",		--------------------------80
	"仅限防型忍者参赛",		--------------------------81
	"仅限技型忍者参赛",		--------------------------82
	"所有忍者可参赛",			--------------------------83
	"所有忍者可参赛",			-------------------------84
	"第%d场",			-------------------------85
    "报名时间:10:00-20:50，比赛开始时间21:00",			-------------------------86
    "您组织未进入本周组织战总排行前8，无法参加决赛",			-------------------------87
    "队",			-------------------------88
    "剩余人数:",			-------------------------89
    "最大连胜:",			-------------------------90
    "连胜场数:",			-------------------------91
    "总积分:",			-------------------------92
    "当前排名:",			-------------------------93
    "报名人数:",			-------------------------94
    "今天比赛已结束，请明天继续参加",			-------------------------95
    "本轮组织战已结束，请等待下一轮组织战！",			-------------------------96
	"参赛限定：只限%|4|!x@%忍者参赛，每队%|4|!y@%个，共%|4|!z@%队",			-------------------------97
	"参赛限定：所有忍者可参赛，每队%|4|!x@%个，共%|4|!y@%队",			-------------------------98
	"攻型",			-------------------------99
	"防型",			-------------------------100
	"技型",			-------------------------101		
    "请先加入组织",			-------------------------102
    "战场情况（当前战场：1）",			-------------------------103
    "战场情况（当前战场：2）",			-------------------------104
    "战场情况（当前战场：3）",			-------------------------105
    "%s打败了%s，奖励将在21:30准时发放~",			-------------------------106
    "组织无人参赛",			-------------------------107
    "贵组织无人参赛，奖励将在21:30准时发放~",			-------------------------108
    "由于%s组织该战场人数为0，自动判负！%s打败了%s",			-------------------------109
    "组织等级到达3级开启",			-------------------------110
	"报名",			-------------------------111
	"已报名",			-------------------------112
	"还没有加入组织",			-------------------------113
	"该战场您未被相符到",			-------------------------114
}

_union_info = {
	"组织功能介绍",
	"1.组织成员上限：Lv1-30、Lv2-32、Lv3-34……",
	"2.组织等级提升：组织经验可用于提升组织等级，可透过组织副本和捐献获得组织经验。",
	"3.组织等级提升后可以开启新的组织副本，提高建设进度奖励，在组织商店中也会开放更多奖励道具。",
	"4.成员可以从组织建设和组织副本中获得组织贡献，组织贡献可以在组织商店中购买各种道具。",
	"5.组织贡献：可透过组织副本和组织捐献获得，可在组织商店购买道具。",
	"6.组织首领：组织成员少于10人时，首领可解散组织；首领最多可任命2名副首领，首领和副首领均享有以下权限：审核新成员、踢出成员、编辑组织公告和宣言等。",
	"7.组织成员：加入后24小时内不可被踢出。",
	"8.创建组织7日内，组织成员数不足3人，并且组织等级为1级时，组织会自动解散。",
	"组织建设",
	"1.建设模式：初级建设、普通建设和高级建设。组织成员每天可选择一种模式进行建设。",
	"2.建设过程中，有机率触发增益，获得150%组织贡献和组织经验（额外加成不计入进度）",
	"3.组织进度到达对应要求后，全体组织成员均可领取建设进度奖励。",
	"4.组织等级越高，建设进度奖励越丰厚。",
	"5.需注意，每天24:00系统会自动清空当天的建设进度奖励。",
	"6.每天的建设次数不能超过组织成员数上限。",
}



--打开可能获得装备碎片的道具ID
can_get_some_equip_patch =
{
	52,
	53,
	54,
	55,
	56,
	57,
	58,
	59,
	60,
	64,
	65,
	66,
	75,
	84,
	85,
	86,
}


------------擂台赛
warcraft_tip = {
	"未上榜",-----------------1
	"达到%s即可领取",---------2
	"达到%s即可购买",---------3
	"虚位以待",---------------4
	"比赛时间:%s-%s",---------5
	"刷新对手",---------------6
	"刷新挑战次数",-----------7
	"距离擂台赛结束还剩",----------------------8
	"本届已结束，还请主人下次再战！",----------9
	"王者",-------------10
	"霸者",-------------11
	"勇者",-------------12
	"总积分：",-------------13
	"总胜点：",-------------14
	"剩余时间：",-------------15
	"开启时间：",-------------16
	"已结束",-------------17
	"进入擂台赛",-------------18
	"时辰未到",-------------19
	"刷新需消耗%s金币",-------------20
	"普通赛",-------------21
	"进级赛",-------------22
	"定段赛",-------------23
	"免费次数：",-------------24
	"%s登录领取",-------------25
	"达到%d连胜即可领取",-------------26
	"无名之辈",-------------27
	"购买10次挑战次数",-------------28
}
---------------擂台赛提示框
_warcraft_states_string_info = {
	"晋升成功",
	"晋升失败",
	"掉段惩罚",
	"晋升赛",
	"恭喜由%s晋升至%s！",
	"晋升比赛失败，当前积分清零，还请您重头来过！",
	"由于您连续挑战失败，导致胜点低于段位要求，因此由%s降至%s！",
	"积分和胜点均已达到晋升要求，\n赢得三局两胜或五局三胜的晋升赛\n即可成功晋升！",
}
--中文数字
chinese_num = {
	"1",		--1
	"2",		--2
	"3",		--3
	"4",		--4
	"5",		--5
	"6",		--6
	"7",		--7
	"8",		--8
	"9",		--9
	
}
---------时装
tipStringInfo_fashion_str = {
	"成功强化至%s级", -----------------------------------------1
	"换装成功", -----------------------------------------------2
	{77,77,77}, -------------------------------------------3
}

tipStringInfo_treasure_seat_str = {
	"[攻击]", -----------------------------------------1
	"[防御]", -----------------------------------------------2
	"装备于", -------------------------------------------3
	"已装备", -------------------------------------------4
}
---------------跃迁
_awaken_tipString_info = {
	"星", -----------------------------------------1
	"级", -----------------------------------------2
	"合成成功", -----------------------------------3
	"分解跃迁道具", -------------------------------4
	"进阶至", -------------------------------------5
	"恭喜进阶成功！", -----------------------------6
	"50级开启", -----------------------------------7
	"50级以上的忍者才可进行进阶", ---------------8
	"忍者等级不足", -----------------------------9
	"跃迁已达到满级", -----------------------------10
	"需求等级：%s/%s", ----------------------------11
	"恭喜装备成功！", -----------------------------12
	"一星", ---------------------------------------13
	"二星", ---------------------------------------14
	"三星", ---------------------------------------15
	"（4回合内通关）", -----------------------------16
	"（8回合内通关）", -----------------------------17
	"（20回合内通关）", -----------------------------18
	"橙将或者红将才能跃迁", ---------------19
}

red_alert_all_str = 
{
	"分解忍者，获取忍魂",							------------------1
	"获取高阶装备碎片，返还强化铜币和镶嵌的金币", 	------------------2
	"分解战马，获取随机马魂", 						------------------3
	"获取兵符石，返还所有精炼材料", 				------------------4
	"选择后分解所有对应品质的%s",					------------------5
	"消耗碎片,合成",								------------------6
	"请先选择碎片",									------------------7
	"获得",											------------------8
	"攻击增加",										------------------9
	"兵力增加",										------------------10
	"物防增加",										------------------11
	"术防增加",										------------------12
	"级",											------------------13
	"第%s次",										------------------14
	"服",											------------------15
	"已上阵",										------------------16
	"已装备",										------------------17
	"(拥有:%s)",									------------------18
	"基础",											------------------19
	"强化",											------------------20
	"所有忍者(%s)",									------------------21
	"前排忍者(%s)",									------------------22
	"中排忍者(%s)",									------------------23
	"后排忍者(%s)",									------------------24
	"商品已售罄",									------------------25
	"需要的碎片数量不足",							------------------26
	"包裹中没有对应的材料",							------------------27
	"升星成功",										------------------28
	"材料不足",										------------------29
	"进阶成功",										------------------30
	"需要启动所有星格",								------------------31
	"请输入角色名",									------------------32
	"没有可穿戴的装备",								------------------33
	"没有可以更换的装备",							------------------34
	"未穿戴装备",									------------------35
	"招募令不足",									------------------36
	"下次免费时间未到",								------------------37
	"兽魂不足",										------------------38
	"已达购买上限",									------------------39
	"忍者受到的伤害减少%s%%，造成的伤害增加%s%%", 	------------------40
	"%s在%s发布了召集令,是否前往？",				------------------41
	"%s在据点【%s】将我击败",						------------------42
	"未入榜",										------------------43
	"购买气势值成功",									------------------44
	"请先参加势力战",									------------------45
	"复活CD时间中",									------------------46
	"交战中据点无法撤离",							------------------47
	"正在移动",										------------------48
	"荣誉值没有达到50",										------------------49
	"时间未到,不可领取",										------------------50	
	"无法离开交战中的据点，请使用据点中撤军功能",				------------------51	
	"据点状态已变更，无法前往",								------------------52	
	"不能进攻对方主城",										------------------53
	"时间已到",											------------------54
	"已领取",											------------------55
	"忍者，您没有称谓",										------------------56
	"不能在主城号令"	,										------------------57
	"群魔乱舞，罗刹白莲围剿龙虎",											------------------58
	"天地色变，龙虎白莲决战罗刹",											------------------59
	"异军突起，龙虎罗刹奇袭白莲",											------------------60
	"玩家攻击了您，",											------------------61
	"您攻击了玩家",										------------------62
	"您获得了胜利！",										------------------63
	"是否确认加入龙虎门，加入该势力后将无法变更阵营",      -------------------64
	"是否确认加入罗刹教，加入该势力后将无法变更阵营",     -------------------65
	"是否确认加入白莲教，加入该势力后将无法变更阵营",      -------------------66
	"是否确认随机选择势力，选择后确认后将无法变成阵营",    -------------------67
	"据点没有被纵火，不可使用灭火",               ----------------68
	"开服五日后，势力战开启",                 ---------------69
	"气势值购买",           				      ---------------70
	"购买气势值",            				     ---------------71
	"获得气势值",            				     ---------------72
	"复活成功",            				     ---------------73
	"升级",           				----------------74
	"需要城堡达到%s级",				----------------75
	"需要使用者达到%s级",				----------------76
	"%d/小时",          			----------------77
	"%d件/天",          			----------------78
	"金币不足",          			----------------79
	"铜币不足",          			----------------80
	"木材不足",          			----------------81
	"没有可以镶嵌的金币",			----------------82
	"未选择任何金币",				----------------83
	"[需要%s级兵营]",				----------------84
	"科技已到顶级",					----------------85
	"%02d时",						----------------86
	"%02d分",						----------------87
	"%02d秒",						----------------88
	"升级至%s%s级",					----------------89
	"冷却cd中",						----------------90
	"【城堡%s级开启】",				----------------91
	"无法携带更多的技能",			----------------92
	"无法装备更多同类型主公技",		----------------93
	"装备品级",						----------------94
	"强化等级",						----------------95
	"今日次数耗尽，提升VIP等级可获得更多次数",	----96
	"品级",							----------------97
	"2件",							----------------98
	"4件",							----------------99
	"6件",							----------------100
	"亲爱的玩家您好:",				----------------101
	"未入榜",						----------------102
	"伤害",							----------------103
	"排名",							----------------104
	"请先通过上一个副本",			----------------105金币副本为开启提示
	"请先通过上一个难度",			----------------106金币副本为开启提示
	"领主%s级开启",					----------------107金币副本为开启提示
	"未开启",						----------------108
	"已经达到最高品质",				----------------109
	"损失铜币:%s",					----------------110
	"获得铜币:%s",					----------------111
	"无损失",						----------------112
	"抢夺失败",						----------------113
	"自己的不能抢",					----------------114
	"同阵营的不能抢",				----------------115
	"已经被抢光了",					----------------116
	"等级%s",						----------------117
	"第%s关",						----------------118
	"重置次数已用完",				----------------119
	"没有排名",						----------------120
	"请选择援军",					----------------121
	"%d万",							----------------122
	"请选择需要退化的忍者",			----------------123
	"挑战次数不足",					----------------124
	"购买次数",						----------------125
	"总战力:",						----------------126
	"进度:",						----------------127
	"家族威望:",						----------------128
	"%s已经升级至%s级",				----------------129
	"是否花费%d金币立即完成升级",		------------130
	"选择出售数量",					----------------131
	"选择使用数量",					----------------132
	"是否确定出售该物品",			----------------133
	"该boss已被击败",				----------------134
	"每日3:00自动重置",				----------------135
	"每日8:00至24:00开启",				------------136
	"周三、周六20:00-20:45开启",			------------137
	"剩余运送 %s/%s 掠夺 %s/%s",			------------138
	"今日已完成",					----------------139
	"军资正在运送中",				----------------140
	"今日运送次数已用完",				------------141
	"是否花费%d金币，立即完成护送的当前军资？",	----142
	"可用于建筑和兵营科技升级",	--------------------143
	"需要先通关前置关卡",			----------------144
	"第%s名",				------------------------145
	"%s/小时",				------------------------146
	"购买次数已达上限",				----------------147
	"是否花费%s金币购买一次挑战次数？",		--------148
	"扫%s次",				------------------------149
	"获得%s称号后可以挑战",			----------------150
	"累计%s天奖励",				--------------------151
	"【无】",				------------------------152
	"亲,请按指引操作哦",			--------------------153
	"VIP等级不足",				--------------------154
	"对",					------------------------155
	"造成伤害",					--------------------156
	"暂未加入组织",				--------------------157
	"升级伫列已满",				--------------------158
	"%s--%s区",					--------------------159
	"%s件",						--------------------160
	"第%s关-第%s关",				--------------------161
	"今日攻打炼狱次数已用尽",		----------------162
	"升级至%s级%s",				--------------------163
	"请解除忍者羁绊再进行分解",	--------------------164
	"首领或者副首领才能号令",	--------------------165
	"您没有加入组织",	----------------------------166
	"您的粮草不足",	--------------------------------167
	"您是否确定消耗%d粮草发布号令？",	----------------168
	"前往",							----------------169
	"领取",							----------------170
	[241]="恭喜储值成功",							----------------241【数码宝贝】限时好礼
}
pay_success_tip_info = {
	"恭喜购买%s成功！每日都可以领取免费金币哟!",
}

choose_camp_tip_string = {
	"是否确认加入龙虎门，加入该势力后将无法变更阵营",      -------------------1
	"是否确认加入罗刹教，加入该势力后将无法变更阵营",     -------------------2
	"是否确认加入白莲教，加入该势力后将无法变更阵营",      -------------------3
	"是否确认随机选择势力，选择后确认后将无法变成阵营",    -------------------4
}

national_truce_dec =  --国战说明
{
	{"【规则】","势力战领地分为龙虎门领地、白莲教领地、罗刹教领地、中立区4个区域。"},
	{"","每个势力有一个主神像，主神像无法被攻陷，玩家阵亡时，会被传送至主神像复活。"},
	{"","杀死据点中最后一个NPC，则该玩家所属的势力视为占领据点的势力,活动期间已经被占领的据点可以继续被抢夺。"},
	{"","若同一个据点有超过两股以上的势力同时争夺，则在此据点范围内的玩家，既可以攻击守卫据点的NPC，也可以攻击正在攻击据点的其他势力玩家。"},
	{"","不论攻守双方人数差距多大，占领据点的条件永远是“击杀该据点最后一个守卫据点的NPC”，一旦据点易主，将清空该据点内所有其他势力的玩家，这些玩家将被强制传送回主神像。"},
	{"","当满足一定条件时，玩家可以选择进行一些战术移动，如突进、包围等。"},
	{"","势力战结束时，占领据点最多的势力视为势力战的最终胜利势力。"},
	{"","势力战结束时，占领据点最多的势力视为势力战的最终胜利势力。"},
	{"【战斗】","【等待】当玩家进入某领地后，自动进入等候状态，等候状态下可以被敌方玩家匹配到，匹配到后进入战斗。"},
	{"","【寻敌】点击攻击后，进入主动匹配敌方目标状态，每次点击攻击后会有10秒的攻击冷却时间。攻击可以选择特定势力的玩家进行攻击。"},
	{"","【战斗】寻敌模式下，胜利后会有增加30秒的CD时间，当时间累积到1分钟后，进入冷却状态，冷却状态下不可主动攻击，花费200气势值可以清除CD。战斗胜利后，玩家的忍者不会回复已损失的血量，但查克拉会重置。"},
	{"","【阵亡】战斗失败后，进入阵亡状态，阵亡状态下，不可进行指令相关操作。"},
	{"","【复活】阵亡后，传送回主神像等待1分钟的复活CD，可以花费500气势值立即复活。"},
	{"","【撤退】玩家可以花费200点气势值和损失最大生命值20%的生命为代价，强行从交战中的领地中撤退。"},
	{"","【突进】进攻人数高于防守人数两倍时，可采取突进战术。"},
	{"","【包围】当一个据点周围的据点被其他势力占领时，该据点内防守方造成伤害降低50%、承受伤害增加50%。"},
	{"","【召集】武神、战神、和斗神可发布召集令，号令本势力成员迅速集合攻打目标据点。"},
	{"","【扶弱】势力战获得第二名，下次势力战增加1500气势值，获得第三名，下次势力战增加3000气势值。"},
	{"","【同盟】当一个势力连续两次获得势力战第一，或同一个势力连续两次获得势力战第三，上次势力战的二、三名自动结盟。"},
	{"","【盟约】势力战结算时，同盟两势力的据点数和总荣誉将相加进行排名，击杀同盟势力的玩家的个人荣誉减半。"},
	{"【奖励】","荣誉值少于50点的玩家无法领取任务奖励。"},
	{"","势力战结束时，会给据势力所占领地数量的排行，给与势力战中获得50点荣誉以上的本玩家一定的奖励，排名不同，奖励不同。"},
	{"","势力战结束时，跟根据个人在本荣誉排行中的位置，给与一定的奖励 。"},
}

red_alert_hero_camp = 
{
    "龙虎门",
    "罗刹教",
    "白莲教",
    "中立",
}

red_alert_officer = 
{
	"【武神】",
    "【战神】",
    "【斗神】",
    "【三品】",
	"【四品】",
    "【五品】",
    "【六品】",
    "【七品】",
    "【八品】",
    "【九品】",
}

red_alert_family_officer = 
{
	"【首领】",
    "【副首领】",
    "【成员】",
}

red_alert_home_city_id = 
{
	1,
    62,
    28,
}

red_alert_resouce_tip = 
{
	{"战神令","势力中获得的独有资源"},
	{"气势值","势力战复活、清除CD需要的资源"},
}
red_alert_war_city_map_tip = 
{
	"没有敌方目标",
	"cd时间未到",
	"清除战斗cd需要%d气势值",
	"当前据点处于火攻状态下，守方攻击下降%d。",
	"当前据点未处于火攻状态下。",
	"攻击方无法使用",
	"守城方无法使用",
}


---------------------红装技能和天赋
_equip_red_tip = {
	"(觉醒至%d阶开启)", -----------------------------------------1
}

tipStringInfo_treasure_seat_str = {
	"[攻击]", -------------------------------------------1
	"[防御]", -------------------------------------------2
	"装备于", -------------------------------------------3
	"已装备", -------------------------------------------4
}
--------------------红装技能天赋激活颜色配置
red_equip_skill_color_type = {
	{0,0,0},		--未激活
	{255,0,0},		--激活
}

---------------------装备升星
_equip_up_star_tip = {
	"不可升星",
	"已满星",
	"升至%d星属性",
	"高",
	"较高",
	"一般",
	"（SWT 00:00重置）",
	"升星成功",
	"升星失败",
	"幸运值",
	"暴击1.5倍",
	"大暴击2倍",
	"经验值",
}
---------------------限时优惠、月基金、限时团购配置
_activity_new_tip_string_info = {
	"折",-------------------------------1
	"进度达到100%时可享储值优惠",------------------2
	"已购买",---------3new
	"购买人数达到%d购买",----------4
	"储值成功！恭喜获得储值优惠，额外获得%d金币！",--------------------5
	"购买进度",--------------------6
	"购买成功！",---------------7
	"成功购买",---------------8
	"购买",---------------9
}

---------------------限时优惠颜色
_activity_limit_color = {
	{255,255,255},----------1白色
	{0,200,255},-----2 蓝色
	{255,73,30},-----------3红色
	{255,255,30},-----------4黄色
}

--------------------新数码的文字--------------------------
_new_interface_text = {
	"等级达到%d级",							--1
	"星级达到%d级",							--2
	"达成条件后,完成指定关卡即可进化~",		--3
	"进化副本",								--4
	"%d级",									--5
	"需求等级%d",							--6
	"%d星开放",								--7
	"经验+%d",								--8
	"剩余技能点数:%d(%s)",					--9
	"确认要出售%s吗?",						--10
	"出售成功!",							--11
	"(今日已用%d/%d)",						--12
	"查看详情",								--13
	"关闭详情",								--14
	"该忍者的初始获取形态为%s",			--15
	"本次免费",								--16
	"%s个%s碎片",							--17
	"技能点已满",							--18
	"技能等级无法超过忍者等级",			--19
	"你是vip%d,今日还可购买%d次",			--20
	"购买%d技能点需",						--21
	"今日购买次数已用完",					--22
	"提升VIP等级可增加购买次数",			--23
	"购买技能点",							--24
	"拖动可选择转换数量:%d/%d", 			--25
	"没有万能碎片,无法转化",				--26
	"材料不足",							--27
	"铜币不足",							--28
	"等级不足",							--29
	"Lv",									--30
	"请选择升级材料",						--31
	"忍者等级不能超过队伍等级,请努力提高队伍等级", --32
	"通关",			---------------------------33//副本关卡宝箱名称，中间取金色
	"可领取",			---------------------------34//副本关卡宝箱名称，中间取金色
	"该关卡尚未开启！",			-------------------35//跳转提示
	"第%d战",			-------------------36//扫荡提示
	"无奖励可领取~",						--37
	"来自组织:",						--38
	"排名达到%d",						--39
	"努力提升排名才能领取喔！",			--40
	"膜拜成功，获得%d铜币！",			--41
	"保持当前排名（第%d名到第%d名），即可获得以下奖励：",			--42
	"第%d名",			--43
	"组织名称中不能含有特殊字元",			--44
	"组织公告中不能含有特殊字元",			--45
	"V%d",				--46
	"今日",				--47
	"%d天之前",			--48
	"点击输入玩家名称", --49
	"昨日",				--50
	"确认删除该好友吗？", --51
	"体力领取成功",			--52
	"没有可赠送的好友",		--53
	"体力赠送成功",			--54
	"发送申请成功",			--55
	"成功添加该好友",		--56
	"已全部拒绝",			--57
	"该组织拒绝任何人加入！",			--58
	"您的等级未达到该组织要求等级！",			--59
	"成功加入组织，快去看看吧！",			--60
	"首领:%s",			--61
	"组织%d级开启",			--62
	"今日次数已用尽,明天记得来做贡献喔！",			--63
	"%d金币开放",			--64
	"%d等级开放",			--65
	"最多输入%d个字",		--66
	"没有奖励可领取",		--67
	"请选择私聊物件",		--68
	"无人可加速",			--69
	"%d个卡卡西",			--70
	"第%d名及以后",			--71
	"阵容保存成功",			--72
	"全属性加成:%d",		--73
	"公告",					--74
	"获得",					--75
	"红包发放成功,快喊小伙伴们抢夺吧！",					--76
	"%s的红包",					--77
	"你抢到了%s的红包,获得%s",					--78
	"VIP%d*2",					--79
	"%|4|购买%!x@%|4|件:%",				--80
	"当日奖励已领取|升级至%|2|vip%d%可领取",				--81
	"累计储值|%d|金币送:%d/%d",				--82
	"另赠%d金(仅首次)",			--83
	"V%d特权",					--84
	"V%d%s超值礼包包含以下内容:", 	--85
	"（第1次储值）",					--86
	"当日奖励已领取!升级至|%s|可补领VIP双倍的奖励", 	--87
	"别著急，活动将每日陆续开放！", 	--88【数码宝贝】开服狂欢
	"(今日已用%d/%d)", 	--89
	"战力需达到%d发放排名奖励", 	--90
	"加入组织后开启组织商店",		--91
	"购买成功，欢迎再来！",			--92
	"%s不足",			--93
	"组织币",						--94
	"试炼币",						--95
	"演武币",						--96
	"",							--97
	"（今天还有%d次刷新机会）",		--98
	"今日刷新次数已用完",			--99
	"SWT %d:00",						--100
	"明天%d点",						--101
	"下次自动刷新时间：",			--102
	"等级:",						--103
	"组织:",						--104
	"这家伙很懒，什么也没有说",		--105
	"名字修改成功",					--106
	"请输入新的暱称哟~",			--107
	"请输入文字",					--108
	"不能超过12个字元！",					--109
	"您暂时还有加入组织喔~",		--110
	"个性签名不能超过%d个字，请修改~",	--111
	"修改成功",						--112
	"暂未开启",						--113
	"需要输入10位兑换码！",				--114
	"获得%s",					--115
	"等 级:",						--116
	"当前未上榜,无法获得排名奖励",						--117
	"积分达到%d",						--118
	"队伍已满~",					--119
	"白绝化身为%%|4|%s%%了，快来一起打败冒牌货！",	--120
	"邀请发送成功",					--121
	"发送邀请过快，请稍等",			--122
	"您需要拥有对应忍者才能挑战~",--123
	"您已经在讨伐白绝的队伍内了",	--124
	"加入成功快去讨伐白绝吧~",	--125
	"有未购买的BUFF,是否退出?",		--126
	"通关副本后才可领取",			--127
	"比赛开始后无法查看昨日回顾~",	--128
	"%s碎片",						--129
	"每周一、三、五、日开放",		--130
	"每周二、四、六、日开放",		--131
	"需通关上一关且等级达到%d级才能开放喔~",	--132
	"满星才能扫荡~",				--133
	"暂无可以一键膜拜的物件~",		--134
	"扫荡%d次",		--135
	"扫%d次",		--136
	"原技能",		--137
	"新技能",		--138
	"1.通过",		--139
	"2.通过",		--140
	"精英关卡",		--141
	"主线关卡",		--142
	"请先上阵忍者~",		--143
	"%d级开启",		--144
	"天赋树共消耗天赋点%d",			--145
	"开放条件：第%s个天赋树中投入%d点天赋点，队伍等级达到%d级",			--146
	"所属天赋树开放",		--147
	"队伍等级达到%d级",		--148
	"%s达到%d(%d/%d)",		--149
	"团队精神·%s",		--150
	"您还没有报名呦~",		--151
	"上阵忍者不足，详细请见规则说明",		--152
	"忍界争霸已结束，您获得了%d胜%d负，未能晋级下一轮",		--153
	"虚位以待",		--154
	"%d胜%d负",		--155
	"暂无",		--156
	"第%d名到第%d名",		--157
	"忍者达到 紫%s品质开放",		--158
	"忍者达到 橙%s品质开放",		--159
	"未添加材料",		--160
	"直接将%s提升至LV.%s",		--161
	"请添加材料~",		--162
	"需要达到队伍等级%d",		--163
	"已经有组织",		--164
	"申请成功",		--165
	"苦无不足，是否立即储值？",		--166
	"恭喜玩家%|4|!x@%在抓真身活动中获得%|4|!y@!z@!a@%",		--167
	"(%s倍奖励)",		--168
	"请勿在10s重复发送",		--169
	"您尚未获得该忍者",		--170
	"%d星",                      -- 171
	"请先使用免费次数",                      -- 172
	"剩余星数不足",		--173
	"您未使用天赋点，不乱收费~",		--174
	"您没有该礼物喔~",		--175
	"演武币可在演武场中获得",		--176
	"试炼币可在忍者试炼中获得",		--177
	"挑战次数已经用光！",		--178
	"是否全部送给%s",		--179
	"报名成功",		--180
	"报名时间：10:00-19:50",		--181
	"开始时间：20:00",		--182
	"生命值提升%d点",		--183
	"生命值+%d%%",		--184
	"免疫率+%d%%",		--185
	"攻击力提升%d点",		--186
	"攻击力+%d%%",		--187
	"伤害率+%d%%",		--188
    "装备碎片",		--189
    "开始游戏",		--190
    "再来一次",		--191
    "感谢您的帮助，送您%s铜币",		--192
    "兑换道具不足",		--193
    "您今日的加速次数已用完",		--194
	"更换组织后，明天才能玩喔~",		--195
	"开服第%d天开启",		--196
    "今日次数已用完！",		--197
	"领奖",		--198
	"已领取",--------------------------------199
	"忍界争霸已结束，您获得了%d胜%d负，未能晋级下一轮", ------200
	"%d胜%d负", ------201
	"无人下注", ------202
	"该玩家今日加速次数已用完，请为其他玩家加速~", ------203
	"演武币可通过演武场获得", ------204
	"试炼币可通过忍者试炼获得", ------205
	"请输入邮件内容！", ------206
	"邮件发送成功", ------207
	"请输入要发送的内容", ------208
	"今日发送邮件次数已达上限", ------209
	"重置关卡次数需要花费：%d金币。确定重置吗？（今日已重置%d次）", ------210
	"今日已达到重置上限", ------211
	"完成战斗%s/%s", ------212
	"请升级启动天赋属性", ------213
	"天赋树总共消耗天赋点%d", ------214
	"等级已达上限",  ------215
    "%d连胜",------216
    "%d分",------217
    "%d胜",------218
    "第%d天",------219
    "升级成功",------220
    "您已经被淘汰",------221
    "当前:忍界争霸第%d场比赛正在展示中",------222
    "需要达到%d级才能开启下一章节",------223
	"货物还在准备中，敬请期待",------224
	"仅限%s人购买(剩余)%s件",------225
	"需要达到vip%s才能购买",------226
	"仍有宝箱可以开放，确定跳过吗？",---------227
	"%d层剩余",						---------228
	"经验超出上限",						---------229
	"选择材料数量过多",						---------230
	"当前没有任何BUFF",						---------231
	"更新提示",						---------232
	"有新的版本内容需要更新,请前往更新.",						---------233
	"伺服器重置提示",						---------234
	"新的一天正在装载中",						---------235
	"上阵",						---------236
	"合成",						---------237
	"阵容保存成功",						---------238
	"升级的同时品质将自动提升到",			---------239
	"升级条件不足",			---------240
	"没有选择材料",			---------241
	"V%d特权礼包",			---------242
	"确定放弃跳过战斗??",			---------243
	"忍者等级无法超过队伍等级",			---------244
	"（每日活动）",			---------245
	"试炼币不足",			---------246
	"",			---------247
	"神兽来袭",			---------248
	"神兽来袭2选1",			---------249
	"确认选择%s吗？",			---------250
	"忍者需达到紫色以上品质才可以阶数还原",			---------251
	"所有技能级数和需达到%d才可以技能还原",			---------252
	"所有咒印级数和需达到%d才可以咒印还原",			---------253
	"忍者等级需达到%d才可以经验还原",			---------254
	"前4件已装备武器等级总和达到%d才可重生",			---------255
	"该道具尚未进行提升，无需还原",			---------256
	"至少需要1件已升星的武器。",			---------257
	"缺少重生石",					--------------258
	"还原忍者%s%s，可以返还以下道具：",		------------259
	"的阶数",		------------260
	"的技能等级",		------------261
	"的咒印等级",		------------262
	"的等级",		------------263
	"的装备等级和阶数",		------------264
	"的忍者手册等级",		------------265
	"的指环等级",		------------266
	"所有装备的星级",		------------267
	"阶数还原",		------------268
	"技能还原",		------------269
	"咒印还原",		------------270
	"经验还原",		------------271
	"装备品质还原",		------------272
	"忍者手册还原",		------------273
	"指环还原",		------------274
	"装备觉醒还原",		------------275
	"选择",		------------276
	"将忍者%s%s还原至初始状态，是否继续？",		------------277
	"返还%s的材料，",		------------278
	"普通重生",		------------279
	"x%s（拥有：%s）",------------280
	"忍者等级需达到%d级",------------281
	"装备降星",------------282
	"装备降星需消耗",------------283
	"降星返还所有觉醒材料,确定使用吗?",------------284
	"请先开放上一神器",------------285
	"开放成功",------------286
	"累积活跃度达到%s，可领取以下奖励：",			--287
	"没有奖励可领取",			--288
	"已达体力上限",			--289
	"进阶成功",			--290
	"VIP等级越高，暴击倍率越高",			--291
	" （每日前10次点金可获得200%加成）",			--292
	"您现在没有加入任何组织",			--293
	"组织等级不足，组织3级开启能量屋",			--294
	"您的材料不足，已为您培养了%d次~",			--295
	"通关 %s 后开启下一章",			--296
	"暂未开启下一章",			--297
	"后可领取",			--298
	"终极奖励仅能领取一次\r\n（建议进度达到100%时再领取！）",			--299
	"是否花费%d金币开启多次宝箱？",		--300
	"该频道为组队频道不能发言",				--301
	"当前等级:%s",			--302
	"队伍等级达到%s可领取奖励",			--303
	"点赞成功，%s人气值+1",			--304
	"您的忍者状态都很好，无忍者可供选择",			--305
	"联动玩家只可登陆特殊的伺服器，请重新选择登陆",			--306
	[307] = "额外赠送%d金币",			--307二充及每次额外赠送，若为0不显示
	[308] = "发送申请成功",			--308找回密码发送邮件成功
	[309] = "!x@% 折",			--309
	[310] = "（若已拥有永久分支进化，将会自动转换为10个相应忍者碎片）",
	[311] = "第%s天解锁",
	[312] = "（获得该忍者后才能使用该分支进化）",
	[313] = "是否花费%d钻石开启一次宝箱？",  -----试炼一键跳过开箱提示
	[314] = "暂无好友加入",
	[315] = "当前未达到名次,无法获得排名奖励",
	[316] = "金币",          --316
	[317]= "噩梦关卡",     --317
	[318]= "批量",     --318
	[319]= "兑换",     --319
	[320]= "使用",     --320
	[321]= "一键升级成功！",	  --321
	[322]= "高级万能碎片不足!",	  --322
	[323]= "每队必须上阵一名忍者!",	  --323
	[324]= "购买",	  --324
	[325]= "排行榜活动已结束",	  --325
	[326]= "排行榜将在%d天%d小时后开启",	  --326
	[327]= "排行榜将在%d小时后开启",	  --327
	[328]= "排行榜将在%d分钟后开启",	  --328
	[329]= "未上榜",	  --329
	[330]= "%d之后",	  --330
	[331]= "排行榜将在%d秒后开启",	  --331
	[332]= "报名时间:%s-%s",	  --332
	[333]= "开始时间:%s",	  --333
	[334]= "排行榜尚未开放，请在本期结束后查看",	  --334
	[335]= "未上榜",	  --335冠军试炼使用
}

activity_tip_str_info = {
	"每天储值都会有好礼相送喔",		--1
	"今日已储值%d金币,再充%d金币即可领取",	--2
	"未达到储值条件喔~",			--3
	"需进度达到:%d%%",				--4
}

activity_recruit_ship_str = {
	{	
		"%|4|最强大脑，强力控制%",
		"可启动%|4|手鞠、卡卡西%的羁绊",
		"输出控制，最佳搭档，你值得拥有",
		"奥义：影缝术",
	},
	{
		"快速回复%|4|查克拉、全体%攻击",
		"可启动%|4|鸣人、小樱%的羁绊",
		"觉醒后和鸣人组成双重利刃，出血吧~",
		"任意储值即可获得，全屏秒杀脆皮敌人",
	},
	{	
		"%|4|SOLO之王，最强单挑忍者%",
		"可启动%|4|鹿丸、手鞠%的羁绊",
		"最强的进攻就是最好的防守，旗木卡卡西——木叶第一技师！",
		"V12可从VIP12礼包获得，「卡卡西」绝不会让你失望"
	},
}

skill_attributes_text_tips = {
	"生命",
	"攻击",
	"防御",
	"术防",
	"生命",
	"攻击",
	"防御",
	"术防",
	"暴击率",
	"抗暴率",
	"格挡率",
	"破击率",
	"命中率",
	"闪避率",
	"物理免伤",
	"忍术免伤",
	"治疗率增加",
	"被治疗率增加",
	"最终伤害",
	"最终减伤",
	"初始查克拉",
	"体质",
	"力量",
	"灵力",
	"物理攻击",
	"额外伤害",
	"治疗值",
	"被治疗值",
	"出血伤害",
	"中毒伤害",
	"出血免伤",
	"中毒免伤",
	"经验",
	"伤害加成",
	"伤害减免",
	"PVP终伤",
	"PVP免伤",
	"初始合击点数",
	"每次出手增加的查克拉",
	"出血伤害",
	"吸血率",
	"查克拉",
	"反弹率",
	"暴击强度",
	"免控率",
	"小技能触发机率",
	"格挡强度",
	"控制率",
	"治疗效果",
	"——",
	"忍者类型克制伤害",
	"溅射伤害",
	"技能伤害",
	"被治疗率减少",
	"伤害提升",
	"奥义伤害%",
	"增加造成的奥义伤害",
	"减少造成的奥义伤害",
	"增加暴击伤害",
	"减少暴击伤害",
	"受到的奥义伤害增加",
	"查克拉回复速度",
	"受到伤害降低",
	"降低攻击",
	"降低防御",
	"伤害加成百分比提升",
	"降低奥义伤害率",
	"降低伤害减免",
	"降低防御",
	"降低查克拉回复速度",
	"忍者类型克制伤害加成",
	"忍者类型克制伤害减免",
	"降低攻击",
	"奥义抗性",
	"减少奥义抗性",
	"降低免控率",
	"复活机率",
	"被复活机率",
	"复活继承血量",
	"复活继承查克拉",
	"被复活继承血量",
	"被复活继承查克拉",
	"增加复活机率",
	"增加复活继承血量",
	"当前属性加成：", --85
	"下一阶属性加成：", --86
}

cultivate_spirit_attributes_name = {
	"暴击率",
	"抗暴率",
	"伤害率",
	"免伤率",
	"格挡率",
	"破挡率",
	"攻击",
	"防御",
	"生命",
}
union_red_envelopes_tips = {
	"铜币",
	"金币",
	"通灵契约",
}

union_job_title = {
	"首领",
	"副首领",
	"成员",
	"升职成功", --4
	"降职成功", --5
    "确认踢出该成员？",		--6
    "确认把首领转交给 %s？您的职位将与对方对换",		--7
}
-------------组织科技捐献说明
union_science_text = {
	"抽卡卡西是组织活动，可获得卡卡西碎片等道具。",
	"提升等级可提高玩法次数和免费置换次数",
	"在大和的木遁中，通关的距离越远，奖励越高",
	"升级后可增加玩法次数和获得铜币上限",
	"在组织红包中成员不仅可以抢系统红包，还可以分享红包给朋友们喔！",
	"可增加红包里包含的铜币、金币数量",
	"科技是第一生产力",
	"升级科技可额外提高组织成员上限",
}

union_limit_title = {
	"允许任何人加入",
	"需要申请才能加入",
	"禁止任何人加入",
	"无限制",
}
skill_quality_text = {
	"必杀技",
	"奥义",
	"被动技能",
}

equip_tips_text = {
	"快速添加",
	"一键升级",
}

---------------资源类型对应的图标,品质框调用
_props_image_name = {
	"4002,2",--	1:铜币
	"4001,2",--	2:金币
	"4007,2",--	3:竞技币
	"",--	4:将魂
	"3000,2",--	5:觉醒碎片
	"",--	6:道具
	"",--	7:装备
	"4006,2",--	8:队伍经验
	"",--	9:耐力
	"",--	10:功能点开启
	"",--	11:上阵人数
	"4005,2",--	12:体力
	"",--	13:忍者
	"",--	14:演武场排名
	"",--	15:伤害类型
	"",--	16:比武积分
	"",--	17:霸气
	"4006,2",--	18:试炼币
	"",--	19:日常任务积分
	"",--	20:叛军中的功勋
	"",--	21:叛军中的战功
	"",--	22:日常副本基础奖励
	"",--	23:日常副本额外奖励
	"",--	24:叛军中的出击令
	"",--	25:免战时间
	"",--	26:成就积分
	"",--	27:？
	"4013,2",--	28:组织币
	"",--	29:排位赛胜点
	"",--	30:排位赛积分
	"",--	31:国战的战功令
	"",--	32:魔陷卡
	"",--	33:驯兽魂
	"4008,2",--	34:天赋点
	"4009,2",--	35:探索币
	"4065,2",--	36:矿石
	"",--	37:？
	"",--	38:？
	"4039,4",--	39:VIP经验
	""
}

_reward_image_name = {
	"4002",--	1:铜币
	"4001",--	2:金币
	"4004",--	3:竞技币
	"4007",--	4:将魂
	"4008",--	5:兽魂
	"4006",--	6:荣誉
	"4005",--	7:体力
	"3017",--	8:精力
	"4005",--	9:战功
}

---------------------品质对应颜色
_quality_color = {
	{255,255,255},----------0白色
	{0,255,0},--------------1绿色
	{0,255,255},------------2蓝色
	{255,0,255},------------3紫色
	{243,152,0},------------4橙色
	{255,0,0},--------------5红色
	{255,255,0},------------6金色
	{212,131,255},------------7紫粉色
}

--富文本颜色
chat_rich_text_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R69 G250 B133
	cc.c3b(10, 207, 242),				---------------------3 品质蓝 R69 G244 B250
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R214 G72 B255
	cc.c3b(204, 197, 11),			---------------------5 品质橙 R255 G142 B42
	cc.c3b(239, 22, 22),				---------------------6 品质红 R255 G44 B34
	cc.c3b(98, 55, 0),				---------------------7 品质褐 R98 G55 B0
	cc.c3b(0, 0, 0),				---------------------8 品质黑 R0 G0 B0
	cc.c3b(254, 212, 68),				------9 限时排行活动钻石数量
	cc.c3b(255, 139, 0),				------10 限时排行活动钻石数量
}
--小助手颜色
chat_rich_text_two_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R69 G250 B133
	cc.c3b(10, 207, 242),				---------------------3 品质蓝 R69 G244 B250
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R214 G72 B255
	cc.c3b(255, 138, 0),			---------------------5 品质橙 R255 G142 B42
	cc.c3b(239, 22, 22),				---------------------6 品质红 R255 G44 B34
}

--羁绊颜色
the_color_of_the_fetters = {
	cc.c3b(135,135,135),					--1 缘分未激活颜色
	cc.c3b(50,255,255),					--2 缘分激活颜色
	cc.c3b(144,144,144),					--3 缘分未激活颜色内
	cc.c3b(255,215,0),					--4 缘分激活颜色内
}
activity_add_energy_tips = {
	"早餐体力(%s)",
	"午餐体力(%s)",
	"晚餐体力(%s)",
	"夜宵体力(%s)",
}

---------------------月卡,体力等任务的配置
_daily_mission_param = {
	{"4002","月卡","累计储值250金币可领取|，（剩余%d天）","2-0,100"},----------25元月卡
	{"4002","至尊月卡","累计储值880金币可领取|，（剩余%d天）","2-0,100"},----------88元月卡
	{"4005","领取60点体力","早餐体力(%s)","3-0,60"},
	{"4005","领取60点体力","午餐体力(%s)","3-0,60"},
	{"4005","领取60点体力","晚餐体力(%s)","3-0,60"},
	{"4005","领取60点体力","夜宵体力(%s)","3-0,60"},
}


------全服战力排行活动规则
_activity_full_service_rankings_tips = {
	"排名奖励将于第5天SWT 21:30透过邮件发放。",
	"进度奖励依活动期间达到的最高战力发放。",
	"战力相同,按照排名时间先后排序",
	"至少需要%s战力才能进入前10名排行。",
	"前10名忍者将获得丰厚奖励！全力以赴吧！",
	"惊人奖励！达到指定战力即可全部领取！",
}

_activity_full_service_times_tips = {
	"年",		--1
	"月",		--2
	"日",		--3
	" ",		--4
	"早",		--5
	"中",		--6
	" ",		--7
}

--背景图名称
_back_groud_image_name = {
	"默认场景",
	"砂之隐里",
	"雨之隐里",
}
--功能开启文字 
_model_open_push_tip = {
	{15,"15,达到Lv.15即可参加演武，开启忍界精彩新篇章~"},		--1
	{18,"18级开启铜币副本，实力越强，铜币越多~"},		--2
	{20,"20级开启组织，与战友一起共谋天下~"},			--3
	{24,"达到24级可以挑战忍者试炼，高层的难度与奖励都会让你窒息~"},			--4
	{26,"26级开启装备觉醒，启动装备的隐藏力量~"},			--5
	{28,"28级开放，大大增强忍者属性，让你的敌人闻风丧胆~"},		--6
	{30,"30级开启结印系统，忍术结印，加强忍术效果"},--7
	{32,"32级开启忍者重生，返还初始忍者及全部养成资源！"},			--8
	{32,"32级开启通灵术，通灵兽加成可作用于所有忍者喔~"},			--9
	{35,"35级开启石像山，解锁忍者，获得特定属性加成"},--10
	{36,"36级开启团队精神，与忍者的关系越亲密，忍者的能力越强大~"},			--11
	{40,"40级开放咒印，忍者潜力大开发~"},			--12
	{40,"40级开启成就系统，开启成就，获取团队速度加成"},--13
	{41,"41级开启活跃度，完成指定任务即可领取奖励！"},			--14
	{43,"43级开启刃具系统，专属刃具，实力巨大提升"},--15
	{45,"45级八门解锁，修炼八门遁甲，获取强大能力"},--16
	{46,"46级开启援护小队，来自忍者的神秘力量，提供全队属性加成"},--17
	{48,"48级开启组合卡系统，高阶忍者养成，极大增强战力"},--18
	{50,"功能于Lv.50开放，带你探索更高等级的世界~"},			--19
	{25,"25级开启养成卡册，赶快收集战士并提升战斗力吧"},--20
	{25,"25级开启养成卡册，赶快收集战士并提升战斗力吧"},--21
	{40,"40级开启忍列传，收集英雄魂并解锁对应成就，即可获得战力加成"},--22
	{33,"33级开启神兽，神兽具有独特的战斗技能，并可为全队带来巨额属性加成"},--23

}

-- 抓真身规则说明
-- Clone Breach Rules 
_activity_smoked_eggs_rule_tips = {
    "1. 活动期间，每累计储值60金币可获得1个抓真身用的苦无，每日最多10个苦无。\r\n\r\n2. 抓真身1倍需消耗两*30000和苦无*1，有机率获得3倍、6倍和10倍奖励，即两*90000、两*180000、两*300000。\r\n\r\n3.找到真身即可获得10倍奖励，之后3个分身全部重置；否则可继续尝试寻找真身。\r\n\r\n4.运气好的话，1次就能找到真身并获得10倍奖励；否则3次内必定获得10倍奖励。 ",
    "1. 活动期间，每累计储值60金币可获得1个抓真身用的苦无，每日最多10个苦无。\r\n\r\n 2. 抓真身1倍需消耗金币*10和苦无*1，有机率获得3倍、6倍和10倍奖励，即金币*30、金币*60、金币*90。\r\n\r\n3.找到真身即可获得10倍奖励，之后3个分身全部重置；否则可继续尝试寻找真身。\r\n\r\n4. 运气好的话，1次就能找到真身并获得10倍奖励；否则3次内必定获得10倍奖励。 ",
	}

game_share_tip_text = {
	"分享成功",
	"加入组织才可使用",
	"发送成功",
	"当前没有公告",
}

login_gift_reward_info = {
	"连续登入送雏田",
	"连续登入送雏田",
	"连续登入送鹿丸",
	"连续登入送香磷",
}

login_gift_reward_role_info = {
	"44",
	"44",
	"51",
	"37",
}
--组织战排行前三名颜色
union_fighting_rank_text_color = {
	{255, 158, 0},      -- 1
	{244, 0, 255},          -- 2
	{0, 203, 255},        -- 3
}



--王者之战的战斗推送文字
battle_of_kings_push_text = {
	"%|5|!x@%不敌%|2|!y@%,遗憾落败",
	"%|2|!x@%英勇无敌,战胜%|5|!y@%,获得%|1|!z@%积分,成功晋级",
	"%|2|!x@%打败%|5|!y@%,获得%|1|!z@%积分,成功晋级",
	"%|4|!x@%千钧一发,险胜%|5|!y@%,获得%|1|!z@%积分,成功晋级",
	"您已成功报名,预祝您征战顺利!",
	"预选赛第%d场!",
	"巅峰对决",
	"您已经被淘汰",
}


--招募的预览的对应颜色
recruit_preview_tip_color = {
	{255,255,255},				--0白
	{36,156,31},					--1绿
	{0,115,169},				--2蓝
	{255,0,255},				--3紫
	{255, 150, 0},				--4橙
	{255,0,0},					--5红
	{255,255,0},				--6金
}


home_activity_push_times_info = {
	{"145", {"19:01:00", "20:01:00", "22:01:00", "24:01:00", "03:01:00", "05:01:00"}},		-- 公会红包
	{"82", {"10:01:00", "12:01:00", "15:01:00", "17:01:00","19:01:00","20:01:00" }},					-- 公会战
	{"93", {"12:01:00", "15:01:00", "17:01:00","19:01:00","20:01:00", "22:01:00", "24:01:00", "03:01:00", "05:01:00"}},	-- 数码净化
	{"81", {"10:01:00", "12:01:00", "15:01:00", "17:01:00","19:01:00", "20:01:00", "20:55:00"}},								-- 王者之战
}




-- 火影新增颜色
_naruto_tips_color = {
    {110, 65, 2},         
    {182, 88, 0},
}


--组织小游戏角色形象ID配置
union_small_games_deploy = {
	"111801",
}

account_sys_manager_tips = {
	"登陆成功!",
	"注销成功!",
	"密码修改成功!",
	"长度须为6-18个字元！",
	"长度须为6-18个字元！",
	"密码不一致！",
	"内容包含特殊字元!",
	"内容不可为空!",
	"请输入帐号",
	"请输入密码",
	"Hayate-cs@gfunfun.com",
	"请再次输入密码",
	}

-- 火影新增颜色-公告部分
chat_rich_text_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R10 G242 B32
	cc.c3b(10, 207, 242),				-----------------3 品质蓝 R10 G207 B242
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R222 G70 B204
	cc.c3b(204, 197, 11),			---------------------5 品质橙 R204 G197 B11
	cc.c3b(239, 22, 22),				-----------------6 品质红 R239 G22 B22
	cc.c3b(98, 55, 0),				---------------------7 品质褐 R98 G55 B0
	cc.c3b(0, 0, 0),				---------------------8 品质黑 R0 G0 B0
}

------------【数码宝贝】征战按钮上方气泡内容，格式：NPCid,文字内容
home_duplicate_tips_info = {
	{"3", "恶魔兽就在无限山！"},
	{"5", "进化链可以进化忍者"},
	{"6", "新剧情解锁啦！"},
	{"7", "这里掉落忍者晶石！"},
	{"9", "美美前方唱歌高能"},
	{"11", "马上解锁强力装备"},
	{"14", "即将开启日常任务"},
	{"17", "天女兽觉醒参战！"},
	{"19", "魔王即将复活！"},
	{"23", "精英掉落装备卷轴"},
	{"27", "奥米加兽火速赶往战场"},
	{"32", "觉醒装备快速提升战力"},
	{"37", "这里掉落忍者碎片！"},
	{"47", "升星可以快速提升战力"},
	{"487", "有新剧情，奖励多多"},
}
------------【数码宝贝】主线npc战斗失败，未首充的玩家返回副本界面时必定弹出首充弹窗，如果跳转到养成界面则不弹出。（可任意删减）
battle_fail_show_frist_recharge = {
	"6",-----主线2-3
	"8",-----主线2-5
	"10",----主线2-7
	"12",----主线3-1
	"15",----主线3-4
	"16",----主线3-5
	"17",----主线3-6
	"18",----主线3-7
	"20",----主线4-1
	"21",----主线4-2
	"22",----主线4-3
	"23",----主线4-4
	"24",----主线4-5
	"25",----主线4-6
	"26",----主线4-7
	"27",----主线4-8
	"28",----主线5-1
	"29",----主线5-2
	"30",----主线5-3
	"31",----主线5-4
	"32",----主线5-5
	"33",----主线5-6
	"34",----主线5-7
	"35",----主线5-8
	"36",----主线5-9
	"37",----主线5-10
	"38",----主线6-1
	"39",----主线6-2
	"40",----主线6-3
	"41",----主线6-4
	"42",----主线6-5
	"43",----主线6-6
	"44",----主线6-7
	"45",----主线6-8
	"46",----主线6-9
	"47",----主线6-10
}


------------【数码宝贝】称号功能邮件提示替换文字
_title_param_mail = {
	"演武场",---类型1
	"忍界争霸",---类型2
	"忍者榜",---类型3
	"关卡榜",---类型4
	"前1名",
	"前2名",
	"前3名",
	"无称号",---无称号按钮
}
--【数码宝贝TW】网页跳转（如果需要隐藏直接删除相应配置即可）
_web_page_jump = {
	[1] = "https://www.facebook.com/DM2TW/", --FB粉丝团
	[2] = "http://www.cayenneark.com.tw/info.aspx?G=20171013", --官方网站
	[3] = "http://www.cayenneark.com.tw/mobile/app_service/service_login.aspx?srv=20171013&T=1", --客服中心
	[4] = "https://itunes.apple.com/tw/app/tw.com.cayenneark.ask/id1367360357", --APP评价
	[5] = "http://www.cayenneark.com.tw/mobile/ctc/pay_login.aspx?srv=20171013", --第三方充值入口
	[6] = "https://play.google.com/store/apps/details?id=tw.com.cayenneark.dm2", --GOOGLE评价
	[7] = "https://play.google.com/store/apps/details?id=com.netmaru.digisoul", --数码韩文谷歌安装包地址
}
--【火影】FB分享跳转地址
_web_page_share = {
	[1] = "http://ultimateninjaninjaking.com/game/index", --IOS的FB分享
	[2] = "http://ultimateninjaninjaking.com/game/index", --安卓的FB分享
}
--【数码宝贝】皮肤解锁
tipStringInfo_evolution_status = {
	[0] = "幼年期",
	[1] = "成长期",
	[2] = "成熟期",
	[3] = "完全体",
	[4] = "究极体",
	[5] = "第三形态",
}
--【数码宝贝】皮肤解锁
tipStringInfo_evolution_status_tips = {
	"到达%s后开放",---皮肤解锁提示
	"敬请期待",---皮肤解锁提示
	"默认形象",---皮肤解锁提示
	"永久",
	"天",
	"购买皮肤？",
	"换肤成功",---换肤成功提示
	"无购买途径，请关注相关活动",  -- 分支进化购买提示
	"活动中获得",  -- 活动中皮肤在分支进化中提示
	"购买皮肤",  --10 分支进化购买提示标题
}
--石像山
tipStringInfo_constellation_tips = {
	"第%d座石像山",---名称
	"%d级开启",---开启条件
	"获得%s", -- 属性加成(未获得该数码兽)
	"%s达到", -- 属性加成(拥有该数码兽)
	"%d级开启", --品级开启条件
	"雕刻成功",
	"更换成功",
}
--【数码宝贝】世界等级
tipStringInfo_world_rank_tips = {
	"因世界等级奖励额外获得",---扫荡额外奖励
}
--跨服矿战
tipStringInfo_cross_server_battel_tips = {
	"购买次数:",--1
	"初级鼓舞",---2
	"中级鼓舞",--3
	"高级鼓舞",--4
	"土豪鼓舞",--5
	"购买次数不足",--6
	"矿石不足",--7
	"已达当前经验最大值", -- 8
	"(下一等级 加成 %d%%)", -- 9
	"(下一等级 加成 %d%%)", -- 10
	"(下一等级 加成 %d%%)", -- 11
	"(下一等级 加成 %d%%)", -- 12
	"(已达今日最高等级)", -- 13
	"点我查看buff相关规则", -- 14
	"免费", -- 15
	"%d级 %s", -- 16
	"%s前", -- 17
	"暂无", -- 18
	"购买抢夺次数?", -- 19
	"购买复仇次数?", -- 20
	"抢夺成功最多可获得资源", -- 21
	"该玩家处于抢夺冷却中", -- 22
	"剩余时间%s", -- 23
	"对方战力远低于你，抢夺无法获得矿石", --24
	"同服玩家，抢夺无法获得矿石", --25
	"鼓舞成功", --26
	"鼓舞次数不足", --27
	"天", --28
	"跨服资源战未开启", --29
	"购买抢夺次数", --30
	"购买复仇次数", --31
}

tipStringInfo_cross_total_war_tips = {
    "超影币不足",--1
    "押注成功",--2
    "购买次数不足",--3
}
--数码合金
tipStringInfo_alloy_matrix_tips = {
	"免费",--1
	"购买次数已达上限",--2
	"该类型手印已存在", -- 3
	"加成或减免手印已存在", -- 4
	"伤害加成",--5
	"伤害减免",--6
	"最大",--7
	"达到%d级后，可进阶为",--8
	"请选择手印",--9
	"未粘贴任何手印",--10
	"提升至%d级",--11
	"等级%d解锁",--12
	"忍术秘笈位置未解锁",--13
	"没有奖励可领取",--14
	"未启动任何忍术",--15
	"手印碎片不足",--16
	"分解可获得手印碎片：",--17
	"强化过的手印在分解后返还所有手印碎片及大部分铜币",--18
	"连击概率",--19
}

-- 7天乐活动对应标签页名称
tipStringInfo_seven_happy_task_name = {
	[1] = "累计登录",----累计登录
	[2] = "主线挑战",----主线挑战
	[3] = "精英挑战",----精英挑战
	[4] = "金币消耗",----金币消耗
	[5] = "忍者成长",----数码兽成长
	[6] = "钻石消耗",----钻石消耗
	[7] = "竞技战斗",----竞技战斗
	[8] = "咒印升级",----斗魂升级
	[9] = "挑战任务",----挑战任务
	[10] = "日常放送",----日常放送
	[11] = "神器培养",----神器培养
	[12] = "公会贡献",----公会贡献
	[13] = "试炼宝箱",----试炼宝箱
	[14] = "试炼积分",----试炼积分
	[15] = "铜币获得",----金币获得
}

-- 钻石十连抽解锁条件
tipStringInfo_diamond_ten_reward_tips = {
	"1级解锁",    -- 1
	"65级解锁",   -- 2
	"85级解锁",   -- 3
}

-- 万代绑定谷歌
tipStringInfo_bind_google_play_tips = {
	"该注册方式已经关闭，请使用其他登录方式",    -- 1
	"去绑定",    -- 2
	"确定",    -- 3
	"已领取",    -- 4
	"该帐户无法绑定",    -- 5
	"绑定成功",    -- 5
}

-- 空岛探索事件名称
tipStringInfo_file_island_event_name_tips = {
	"好友任务",    -- 1
	"团队BOSS",    -- 2
	"随机宝箱",    -- 3
	"趣味问答",    -- 4
	"单人挑战",    -- 5
	"休息",    -- 6
}

-- 空岛探索
tipStringInfo_file_island_tips = {
	"开启次数已达上限",    -- 1
	"一共回答了%d道题目，%d题回答正确，以下是你获得的奖励",    -- 2
	"单人挑战%d",    -- 3
	"是否要退出单人挑战",    -- 4
	"本次探索一共探索了%d次",    -- 5
	"休息",    -- 6
	"关卡未解锁",   	-- 7
	"探索币不足",	-- 8	
	"暂无团队BOSS可挑战",		-- 9
	"暂无任务可领取",		-- 10
	"已挑战过该BOSS",	-- 11
	"已达到今日可参加好友BOSS次数上限",	-- 12	
	"回答正确，学霸附体！",	-- 13
	"回答错误，再接再厉！",	-- 14
	"即将开启",	-- 15
	"探索点不足",	-- 16
	"距离下次邀请时间还有%s",	-- 17
	"刷新成功",	-- 18
	"挑战次数不足！",	-- 19
}
-- 钻石充值限制
tipStringInfo_diamond_recharge_tips = {
	"储值功能暂未开放",     -- 1
}
--成长之路
tipStringInfo_path_growth_tips = {
	"%s级解锁", -- 1
	"免费领取", -- 2
	"圆", -- 3
	"此次储值只在本活动有效", -- 4
	"领取", -- 5
	"活动已结束！", -- 5
}
--探索
tipStringInfo_exploration_tips = {
	"那是障碍物，无法寻路", -- 1
	"是否要退出单人挑战",    -- 2
	"%d级开启",    -- 3
	"恭喜您获得%s*%d",    -- 4
	"是否要退出捕捉挑战",    -- 5
	"是否花费%d钻石购买一次捕捉次数",    -- 6
	"是否要结束本次捕捉",    -- 7
	"效果拔群！获得%d星%s整卡！",    -- 8
	"探索各种事件可累计获得积分，领取各式奖励",    -- 9 每日积分
	"探索各种事件可累计获得积分，领取各式奖励",    -- 10 累计积分
	"是否消耗%d钻石刷新商店",    -- 11
	"精力不足",    -- 12
	"是否消耗%d精力刷新事件，所有事件将会重置（boss除外）",    -- 13
	"人物行走中，地图无法切换", --14
}

tipStringInfo_exploration_event_name_tips = {
	"随机宝箱",    -- 1
	"休息",    -- 2
	"BOSS挑战",    -- 3
	"趣味答题",    -- 4
	"捕捉",    -- 5
	"单人挑战",    -- 6
}
--新活动豪华首充
tipStringInfo_new_activity_tips = {
	"你已储值 %s 金币, 再储值 %s 金币即可领取", -- 1
	"活动已结束", -- 2
	"请输入正确的启动码", -- 3
	"请输入启动码", -- 4
}

--征途精英关卡
tipStringInfo_pve_main_tips = {
	"普通",    -- 1
	"精英",    -- 2
	"噩梦",    -- 3
}
--大冒险
tipStringInfo_pikachu_tips = {
	"活动结束", -- 1
	"忍者跑累了，吃碗拉面补充一下，扣掉%d金币",    -- 2
	"拥有骰子：",    -- 3
	"免费次数：",    -- 4
	"圈",    -- 5
}
--秘宝
tipStringInfo_pokemon_treasure_tips = {
	"单抽奖励%d积分", -- 1
	"连抽奖励%d积分", -- 2
	"免费", -- 3
	"积分", -- 4
	"积分不足", -- 5
	"无限制", -- 6
	"恭喜玩家%|4|!x@%运气爆棚,在忍者秘宝活动抽到%|!qulity@|!y@*!n@%", -- 7
	"%|9|VIP!x@%或%|9|战力!y@%的玩家可参加此活动", -- 8
}
--每日充值送礼
tipStringInfo_daily_recharge_tips = {
	"每日限购%d次", -- 1
	"无限制", -- 2
}
--每日单笔充值、单笔充值
tipStringInfo_daily_once_recharge_tips = {
	-- 每日单笔充值
	"1.每日单笔充值对应档位，即可获得奖励，累计充值达到档位，不能领取此档位奖励", -- 1
	"2.只可完成规定的次数，超过完成次数，无法重复领取奖励。每天会刷新可完成次数", -- 2
	--单笔充值
	"1.单笔充值对应档位，即可获得奖励，累计充值达到档位，不能领取此档位奖励", -- 3
	"2.只可完成规定的次数，超过完成次数，无法重复领取奖励。", -- 4
}
tipStringInfo_pokemon_recharge_rank_tips = {
  "第",
  "~",
  "",
  "需要 %d 点",
  "未上榜",
  "保持当前排名（第%d名），即可获得以下奖励：",
}
--超进化·八门遁甲
tipStringInfo_maga_unlock = {
	"当前忍者星级至%d",  -- 1
	"当前忍者进阶至%s",  -- 2
	"当前忍者咒印等级总数至%d", --3
	"当前忍者八门至%d阶%d级",  --4
	"当前忍者装备总星数至%d", --5
	"当前忍者手印总等级至%d", --6
	"进阶等级至%s", --7
	"八门%d阶%d级",--8
	"当前忍者手印放满且都为%s品质",--9
	"%d阶属性加成", --10
	"八门%d阶段",--11
	"%d阶进化进度",--12
	"属性提升", --13
	"无", --14
	"武器觉醒后才可以使用八门必杀技", --15
	"未开启八门", --16
}
--超进化（八门）进阶对应 =
tipStringInfo_maga_uplv = {
  [1]   = "绿",   --1
  [2]   = "绿+1", --2
  [3]   = "绿+2", --3
  [4]   = "蓝",   --4
  [5]   = "蓝+1", --5
  [6]   = "蓝+2", --6
  [7]   = "蓝+3",  --7
  [8]   = "紫",   --8
  [9]   = "紫+1", --9
  [10]  = "紫+2", --10
  [11]  = "紫+3", --11
  [12]  = "紫+4", --12 
  [13]  = "橙",   --13
  [14]  = "橙+1", --14
  [15]  = "橙+2", --15
  [16]  = "橙+3", --16
  [17]  = "橙+4", --17
  [18]  = "橙+5", --18
  [19]  = "红",   --19
  [20]  = "红+1", --20
  [21]  = "红+2", --21
  [22]  = "红+3", --22
  [23]  = "红+4", --23
  [24]  = "红+5", --24
  [25]  = "金",   --25
}

-- 图鉴
tipStringInfo_exploreBook_unlock_tips = {
	"未达到图鉴启动条件",  -- 1
}
--扭蛋
tipStringInfo_egg_machine = {
	"达到%|9|!x@%级并且达到%|9|VIP!y@%可参与活动",  -- 1
}
--节日红包
tipStringInfo_red_packet = {
	"的红包", --1
}

--世界boss
tipStringInfo_world_boss = {
	"已结束", -- 1
	"个人名称",--2
	"工会名称",--3
	"攻打九尾 %d 次",--4
	"在一次封印九尾活动中造成 %d 总伤害",--5
	"金币刷新 %d 次挑战CD",--6
	"虚位以待",--7
	"未上榜",--8
	"补刀大神！精准打击！您获得了最后一击奖励！",--9
	"幸运大神！踩了狗屎！您获得了惊喜大奖奖励！",--10
	"下期开启时间",--11
	"本期剩余时间",--12
	"是否消耗%d金币重置冷却",--13
	"奖励通过邮件发放",--14
	"惊喜大奖通过邮件发放，最后一击即时发放",--15
}

--援护小队
tipStringInfo_soul_warding = {
	"忍者%d个开启八门阶段%d", --1
	"上级援护等级%d", --2
	"拥有%d个忍者进阶至%s", --3
	"图鉴等级%d",--4
	"战队等级达到%d级",--5
	"拥有%d个忍者等级至%d级", --6
	"解锁条件未完成",--7
	"该守护未启动",--8
}

--援护小队名称
tipStringInfo_soul_warding_name = {
  "火之守护",  --1
  "山之守护",  --2
  "雷之守护",  --3
  "林之守护",  --3
}

--大师训练营
tipStringInfo_training_camp_name = {
	"每日限购%d",--1
	"赛季限购%d",--2
    "%d级解锁",--3
    "等级不足",--4
    "训练币不足",--5
    "兑换成功",--6
    "无限购",--7
    "可升%d级",--8
    "经验值",--9
    "请先成为影级任务大师哦~",--10
    "  恭喜您从经验包中获得%d经验",--11
    "您今日已领过经验包了哟",--12
    "    购买成功,恭喜您获得%d经验",--13
    "充值满%d可购买礼包哦~",--14
    "未达充值条件哦~",--15
    "任务集会所s%d赛季",--16
    "...等",--17
    "任务集会所s%d结束时间:",--18
	"每日获得经验已达上限，完成任务不会获得经验",--19
    "购买等级?",--20
    "已到满级了哟~",--21
    "购买进阶礼包",--22
    "购买豪华进阶礼包",--23
    "恭喜获得影级任务大师称号",--24
} 

--强制更新
tipStringInfo_force_update_jump = {
	[1] = "https://itunes.apple.com/us/app/champion-trainer-new-journey/id1454350111?l=zh&ls=1&mt=8",
}

--积分赛
tipStringInfo_rescue_station = {
   "第",--1
   "名",--2
   "批量兑换",--3
   "任务证书不足",--4
   "捐赠此物品可获得%d积分",--5
   "无可捐赠物品",--6
   "捐赠成功",--7
   "请先完成所有任务哟~",--8,
   "已经领过了哟~",--9
   "恭喜您获得%d积分",--10
   "已到上限了哟~",--11
   "次数用完了哟~",--12
   "领取倒计时:",--13
}

tipStringInfo_rescue_silkbag = {
	"您的揹包暂时还没有忍具哦!",--1
	"生命 ",--2
	"攻击 ",--3
	"防御 ",--4
	"未装备",--5
	"您要分解的忍具品质较高,确定分解?",--6
	"道具不足!",--7
	"升阶中",--8
	"无此类专属忍具",--9
	"已经满级了",--10
	"升级经验",--11
	"升级消耗",--12
	"升阶消耗",--13
	"（长按可以连续使用升级道具）",--14
	"（突破小贴士）",--15
	"是否消耗 %d个 %s 置换",--16
	"替换道具%d不足",--17
	"忍具等级没有变化",--18
	"您要分解的忍具已升级，分解将返还全部资源，确定分解？",--19
	"未选择任何需要分解的忍具", -- 20
	"第1阶段（默认解锁)", -- 21
	"第2阶段（自身达到%s级，并护佑了%s个%s资质以上的护佑型忍具）", -- 22
	"第%s阶段（自身达到%s级，并护佑了%s个%s资质以上的护佑型忍具，且至少%s个为自身专属）", -- 23
	"当该忍具达到%s级时可开启护佑功能", --24
}

tipStringInfo_rescue_silkbag_property = {
	["-1"] = "无",
	["0"] = "生命:",
	["1"] = "攻击:",
	["2"] = "防御:",
	["3"] = "魔防",
	["4"] = "生命",
	["5"] = "攻击",
	["6"] = "防御",
	["7"] = "魔防",
	["8"] = "暴击率:%d",
	["9"] = "抗暴率:%d",
	["10"] = "格挡率:%d",
	["11"] = "破格挡率:%d",
	["12"] = "命中率:%d",
	["13"] = "闪避率:%d",
	["14"] = "物理免伤",
	["15"] = "魔法免伤",
	["16"] = "治疗率:%d",
	["17"] = "被治疗率:%d",
	["18"] = "最终伤害",
	["19"] = "最终减伤:",
	["20"] = "初始怒气:",
	["21"] = "体质",
	["22"] = "力量",
	["23"] = "速度:",
	["24"] = "物理攻击",
	["25"] = "额外伤害",
	["26"] = "治疗值",
	["27"] = "被治疗值",
	["28"] = "灼烧伤害",
	["29"] = "中毒伤害",
	["30"] = "灼伤免伤",
	["31"] = "中毒免伤",
	["32"] = "经验",
	["33"] = "伤害加成:%d",
	["34"] = "伤害减免:%d",
	["35"] = "PVP终伤",
	["36"] = "PVP免伤",
	["37"] = "初始合击点数",
	["38"] = "每次出手增加的怒气",
	["39"] = "灼烧伤害:%d",
	["40"] = "吸血率:%d",
	["41"] = "怒气",
	["42"] = "反弹率:%d",
	["43"] = "暴伤加成:%d",
	["44"] = "免控率%",
	["45"] = "小技能概率:%d",
	["46"] = "格挡加成:%d",
	["47"] = "控制率%",
	["48"] = "--(治疗效果%,废弃）",
	["49"] = "--(暴击强化%,废弃）",
	["50"] = "--(忍者类型克制伤害%,废弃）",
	["51"] = "--(溅射伤害%,废弃）",
	["52"] = "--(技能伤害%,废弃）",
	["53"] = "被治疗率减少:%d",
	["54"] = "伤害提升:%d",
	["55"] = "必杀伤害率:%d",
	["56"] = "增加造成的必杀伤害%",
	["57"] = "减少造成的必杀伤害%",
	["58"] = "暴伤加成:%d",
	["59"] = "减少暴击伤害%",
	["60"] = "受到的必杀伤害增加%",
	["61"] = "怒气回复速度%",
	["62"] = "受到直接伤害降低%",
	["63"] = "降低攻击(%)",
	["64"] = "降低防御",
	["65"] = "伤害加成百分比提升%",
	["66"] = "降低必杀伤害率%",
	["67"] = "--(降低伤害减免百分比%,废弃）",
	["68"] = "降低防御（%）",
	["69"] = "降低怒气回复速度%",
	["70"] = "忍者类型克制伤害加成%",
	["71"] = "忍者类型克制伤害减免%",
	["72"] = "降低攻击",
	["73"] = "增加必杀抗性%",
	["74"] = "减少必杀抗性%",
	["75"] = "降低免控率%",
	["76"] = "复活概率%",
	["77"] = "被复活概率%",
	["78"] = "复活继承血量%",
	["79"] = "复活继承怒气%",
	["80"] = "被复活继承血量%",
	["81"] = "被复活继承怒气%",
	["82"] = "增加复活概率%",
	["83"] = "增加复活继承血量%",
	["84"] = "小技能伤害提升",
}


tipStringInfo_activity_local_data_property = {
	["17"] = "累计消耗%d金币",			-- 累计消耗钻石
	["81"] = "铜币抽卡%d次,金币抽卡%d次",			        -- 抽卡送礼
	["83"] = "竞技积分达到%d",			-- 竞技积分奖励
	["95"] = "累计抽装备宝箱%d次",			-- 抽装备宝箱得天赋点
	["96"] = "抽装备宝箱%d次",			-- 抽装备宝箱有礼
	["102"] = "购买体力%d次",		        -- 体力购买次数奖励
	["103"] = "摇钱%d次",		            -- 点金次数奖励
	["104"] = "蛇道试炼达到%d积分",		-- 试炼积分奖励
	["105"] = "开启蛇道试炼宝箱%d次",		-- 试炼宝箱开启次数奖励
	["106"] = "单笔储值%d金币",			-- 充值送资源
	["107"] = "单笔储值%d金币",				-- 充值返钻
	["108"] = "主线关卡挑战%d次",			-- 主线关卡挑战奖励
	["109"] = "精英关卡挑战%d次",			-- 精英关卡挑战奖励
	["110"] = "消耗%d铜币",			    -- 金币消耗奖励
	["115"] = "消耗%d金币",			    -- 消耗钻石返利活动
	["113"] = "",
	["121"] = "",
	["124"] = "",
	["126"] = "",
	["138"] = "金币购买合金%d次",			-- 抽合金有礼
	["145"] = "单笔储值%d金币",				-- 单笔充值
	["140"] = "忍者净化%d次",			-- 净化挑战有礼
	["141"] = "获得%d搜寻点数",			-- 探索有礼
	["151"] = "单笔储值%d金币",				-- 每日单笔充值 (texto del ["107"])
	["152"] = "每日充值%d金币",
	["153"] = " ",			                -- 筋斗云任务
	["178"] = "单笔储值%d金币",			                -- 特惠礼包
	["179"] = "每日充值%d金币",			                -- 单笔充值
}


--跨服王者之战提示文字
tipStringInfo_cross_server_king_battel_tips = {
	"阵型没有变化",											--1
	"战斗已经结束,无法提交阵容",							--2
	"阵容修改成功",							--3
}
--组合卡相关文字配置
tipStringInfo_combination_card_configure = {
	"敬请期待",			                --1 
	"战斗力: 0",							--2 未解锁时
	"战斗力: %d/%d",							--3
	"·（杜门%d阶/景门%d阶）",			--4 解锁阶级条件
	"镶嵌卡星级:%d/%d",						--5 进阶条件1
	"八门阶数:%d/%d,八门子阶数%d/%d",			--6 进阶条件2
	"战力:%d/%d",  					--7 进阶条件3
	"当前组合卡上阵数(%d)",				--8 当前上阵数
	"扩充后上阵数(%d)",				    --9 扩充后上阵数
	"%s星级:%d/%d",						--10 解锁条件
	"等级:%d",						-- 11 等级显示
	"固定槽等级之和达到:%d",		-- 12 槽位解锁条件
	"固定槽位%d等级达到:%d",		-- 13 槽位解锁条件
	"未解锁",					-- 14 未解锁
	"可解锁",					-- 15 可解锁			
}

--组合卡相关文字颜色配置(rgb三色数值)
tipStringInfo_combination_card_configure_color = {
	"127,127,127",			                --1 敬请期待(置灰)
	"0,128,0",							            --2 条件达成(绿色)
	"255,0,0",							     --3 条件未达成(红色)
	"0,255,0",										--4 消耗道具够
	"255,0,0",										--5 消耗道具不够
}

--组合卡提示文字
tipStringInfo_combination_card_tip = {
	"解锁成功",			                --1 
	"升级成功",							--2 
	"升阶成功",							--3
	"槽位解锁成功",			--4 
	"扩充成功",			 --5
	"扩充券不足",			--6
	"条件未达成",				--7
	"没有符合条件的上阵卡",		-- 8
	"组合卡已上阵,镶嵌卡不可更改",	--9
	"没有相应碎片,无法转化",		-- 10
	"已达扩充上限!",				-- 11
	"道具不足!",					-- 12
	"已达到最高等级！",					-- 13
}

-- 组合卡品质色彩
tipStringInfo_combination_card_quality = {
	"白",						--1
	"绿",						--2
	"蓝",						--3
	"紫",						--4					--5
	"白",						--6
	"橙",						--7
}
--特权卡按钮文本
tipStringInfo_vip_card_tip = {
	"充值%s钻石",			                --1 
	"领取",							--2 
	"已领取",							--3
	"VIP%s每日奖励",							--4	
}
-- 公会援助相关描述
tipStringInfo_union_donation_tip = {
	"一天前",						--1
	"您还没有选择需要求助的碎片",						--2
	"您今日的援助奖励已达上限,无法继续获得援助奖励",						--3
    "您今日该类型的援助奖励已达上限，继续捐赠将无法获得援助奖励，是否确认捐赠",
}
-- 大R专属
tipStringInfo_Exclusive_customer_service_tip = {
	"恭喜成为%d。非常感谢您的支持。成为%d后，可享受营运团队提供的礼物和更优质的服务。请透过%s联系我们",				--1
}
-- 卡册系统描述
tipStringInfo_illustration_tip = {
	"%d级卡册",			                --1 卡册等级
	"0,0,0",							--2 道具不足颜色
	"0,128,0",							--3 道具足颜色
	"开启成功!",						--4 激活成功	
	"未上榜",							--5 排行未上榜
	"级",								--6 等级		
	"0,128,0",							--7 成就颜色	
	"卡册评分达到%s启动:",				--8 成就文本
	"%s    对应卡册等级达到%s/%s级",					--9 组合卡册基础条件
	"未完成",							--10 组合卡册特殊条件
	"已完成",							--11 组合卡册特殊条件
	"你还未激活此卡",					--12 组合卡册跳转提示
	"还差%s个%s即可升级卡册",			--13 组合卡册跳转提示
	"隐藏任务进度    %s",				--14 组合卡册隐藏条件文本
	"共%s条隐藏任务完成",				--15 组合卡册隐藏条件文本

}
tipStringInfo_property_name_and_value = {
	["-1"] = "无",
	["0"] = "生命:",
	["1"] = "攻击:",
	["2"] = "防御:",
	["3"] = "魔防",
	["4"] = "生命",
	["5"] = "攻击",
	["6"] = "防御",
	["7"] = "魔防",
	["8"] = "暴击率:%s",
	["9"] = "抗暴率:%s",
	["10"] = "格挡率:%s",
	["11"] = "破格挡率:%s",
	["12"] = "命中率:%s",
	["13"] = "闪避率:%s",
	["14"] = "物理免伤",
	["15"] = "魔法免伤",
	["16"] = "治疗率:%s",
	["17"] = "被治疗率:%s",
	["18"] = "最终伤害",
	["19"] = "最终减伤:",
	["20"] = "初始怒气:",
	["21"] = "体质",
	["22"] = "力量",
	["23"] = "速度:",
	["24"] = "物理攻击",
	["25"] = "额外伤害",
	["26"] = "治疗值",
	["27"] = "被治疗值",
	["28"] = "灼烧伤害",
	["29"] = "中毒伤害",
	["30"] = "灼伤免伤",
	["31"] = "中毒免伤",
	["32"] = "经验",
	["33"] = "伤害加成:%s",
	["34"] = "伤害减免:%s",
	["35"] = "PVP终伤",
	["36"] = "PVP免伤",
	["37"] = "初始合击点数",
	["38"] = "每次出手增加的怒气",
	["39"] = "灼烧伤害:%s",
	["40"] = "吸血率:%s",
	["41"] = "怒气",
	["42"] = "反弹率:%s",
	["43"] = "暴伤加成:%s",
	["44"] = "免控率%",
	["45"] = "小技能概率:%s",
	["46"] = "格挡加成:%s",
	["47"] = "控制率%",
	["48"] = "--(治疗效果%,废弃）",
	["49"] = "--(暴击强化%,废弃）",
	["50"] = "--(忍者类型克制伤害%,废弃）",
	["51"] = "--(溅射伤害%,废弃）",
	["52"] = "--(技能伤害%,废弃）",
	["53"] = "被治疗率减少:%s",
	["54"] = "伤害提升:%s",
	["55"] = "必杀伤害率:%s",
	["56"] = "增加造成的必杀伤害%",
	["57"] = "减少造成的必杀伤害%",
	["58"] = "暴伤加成:%s",
	["59"] = "减少暴击伤害%",
	["60"] = "受到的必杀伤害增加%",
	["61"] = "怒气回复速度%",
	["62"] = "受到直接伤害降低%",
	["63"] = "降低攻击(%)",
	["64"] = "降低防御",
	["65"] = "伤害加成百分比提升%",
	["66"] = "降低必杀伤害率%",
	["67"] = "--(降低伤害减免百分比%,废弃）",
	["68"] = "降低防御（%）",
	["69"] = "降低怒气回复速度%",
	["70"] = "忍者类型克制伤害加成%",
	["71"] = "忍者类型克制伤害减免%",
	["72"] = "降低攻击",
	["73"] = "增加必杀抗性%",
	["74"] = "减少必杀抗性%",
	["75"] = "降低免控率%",
	["76"] = "复活概率%",
	["77"] = "被复活概率%",
	["78"] = "复活继承血量%",
	["79"] = "复活继承怒气%",
	["80"] = "被复活继承血量%",
	["81"] = "被复活继承怒气%",
	["82"] = "增加复活概率%",
	["83"] = "增加复活继承血量%",
	["84"] = "小技能伤害提升",
}
tipStringInfo_property_harden_name_and_value = {
	["-1"] = "无",
	["0"] = "生命:",
	["1"] = "攻击:",
	["2"] = "防御:",
	["3"] = "魔防",
	["4"] = "生命:%s",
	["5"] = "攻击:%s",
	["6"] = "防御:%s",
	["7"] = "魔防",
	["8"] = "暴击率:%s",
	["9"] = "抗暴率:%s",
	["10"] = "格挡率:%s",
	["11"] = "破格挡率:%s",
	["12"] = "命中率:%s",
	["13"] = "闪避率:%s",
	["14"] = "物理免伤",
	["15"] = "魔法免伤",
	["16"] = "治疗率:%s",
	["17"] = "被治疗率:%s",
	["18"] = "最终伤害",
	["19"] = "最终减伤:",
	["20"] = "初始怒气:",
	["21"] = "体质",
	["22"] = "力量",
	["23"] = "速度:",
	["24"] = "物理攻击",
	["25"] = "额外伤害",
	["26"] = "治疗值",
	["27"] = "被治疗值",
	["28"] = "灼烧伤害",
	["29"] = "中毒伤害",
	["30"] = "灼伤免伤",
	["31"] = "中毒免伤",
	["32"] = "经验",
	["33"] = "伤害加成:%s",
	["34"] = "伤害减免:%s",
	["35"] = "PVP终伤",
	["36"] = "PVP免伤",
	["37"] = "初始合击点数",
	["38"] = "每次出手增加的怒气",
	["39"] = "灼烧伤害:%s",
	["40"] = "吸血率:%s",
	["41"] = "怒气",
	["42"] = "反弹率:%s",
	["43"] = "暴伤加成:%s",
	["44"] = "免控率%",
	["45"] = "小技能概率:%s",
	["46"] = "格挡加成:%s",
	["47"] = "控制率%",
	["48"] = "--(治疗效果%,废弃）",
	["49"] = "--(暴击强化%,废弃）",
	["50"] = "--(忍者类型克制伤害%,废弃）",
	["51"] = "--(溅射伤害%,废弃）",
	["52"] = "--(技能伤害%,废弃）",
	["53"] = "被治疗率减少:%s",
	["54"] = "伤害提升:%s",
	["55"] = "必杀伤害率:%s",
	["56"] = "增加造成的必杀伤害%",
	["57"] = "减少造成的必杀伤害%",
	["58"] = "暴伤加成:%s",
	["59"] = "减少暴击伤害%",
	["60"] = "受到的必杀伤害增加%",
	["61"] = "怒气回复速度%",
	["62"] = "受到直接伤害降低%",
	["63"] = "降低攻击(%)",
	["64"] = "降低防御",
	["65"] = "伤害加成百分比提升%",
	["66"] = "降低必杀伤害率%",
	["67"] = "--(降低伤害减免百分比%,废弃）",
	["68"] = "降低防御（%）",
	["69"] = "降低怒气回复速度%",
	["70"] = "忍者类型克制伤害加成%",
	["71"] = "忍者类型克制伤害减免%",
	["72"] = "降低攻击",
	["73"] = "增加必杀抗性%",
	["74"] = "减少必杀抗性%",
	["75"] = "降低免控率%",
	["76"] = "复活概率%",
	["77"] = "被复活概率%",
	["78"] = "复活继承血量%",
	["79"] = "复活继承怒气%",
	["80"] = "被复活继承血量%",
	["81"] = "被复活继承怒气%",
	["82"] = "增加复活概率%",
	["83"] = "增加复活继承血量%",
	["84"] = "小技能伤害提升：%s",
	["90"] = "防克攻伤害加成：%s",
	["91"] = "攻克技伤害加成：%s",
	["92"] = "技克防伤害加成：%s",
	["93"] = "防克攻伤害减免：%s",
	["94"] = "攻克技伤害减免：%s",
	["95"] = "技克防伤害减免：%s",
	
}

tipStringInfo_activity_limit_pool = {
	"第%s名",			                			--1 提示文本
	"金币不足",										--2 提示文本
	"每充值%s金币，可获得一次抽取机会！",			--3 提示文本
	"未上榜",										--4 提示文本
	"活动已结束，现在为展示时间",					--5 提示文本
	"恭喜获得%s积分，赠送：",						--6 提示文本
	"抽取一次",										--7 提示文本
	"抽取十次",										--8 提示文本
	"%s积分以上才能上榜"
}

tipStringInfo_recharge_repair_tips = {
	"亲爱的玩家:如果你在使用谷歌支付的时候，提示错误，那说明你的应用的支付系统出现了问题，为了解决这个问题，我们开放了PAYPAL和WORLDPAY，这两个都是我们的官方支付渠道，没有任何危险，且可以获得更多的钻石。",			                			--1 提示文本1
	"使用说明:如果您依然希望使用谷歌支付，那么请点击下方按钮去谷歌商店下载官方修复工具或者点击支付选择谷歌支付也会跳转，下载后无需打开该工具，重启游戏即可恢复谷歌支付，若依然有问题，请通过邮箱与我们取得联系",										--2 提示文本2
}
tipStringInfo_activity_fortune_bag = {
	"抽取一次",										--1
	"抽取十次",										--2
	"活动已结束!",									--3
	"稀有奖励",										--4
	"普通奖励",										--5
	"配对奖励",										--6

}
tipStringInfo_activity_private_custom = {
	"请先选择道具",			                			--1
	"充值%s金币",			                			--2
}
reconnect_view_string = {
" ",
"网络不稳定，请检查您的网络，然后重试",
" ",
" ",
}
tipStringInfo_activity_egg_dance = {
	"超过购买最大上限",			                		--1
	"金币不足",			                				--2
	"再来一次",			                				--2

}
-- 跨服竞技小队提示
tipStringInfo_team_arena = {
	"申请成功",	--1
	"邀请成功", --2
	"是否请离该队员",--3
	"是否退出该队伍",--4
	"是否提交队伍",--5
	"是否转让队伍",--6
	"队伍名称不能为空",--7
	"请输入%s-%s的数字",--8
	"本次竞技已结束,期待您下一次再来",--9
	"阵型调整成功",--10
}
-- 夏日酷饮活动提示
tipStringInfo_activity_summer_drink = {
	"任务",			                		--1 单个任务标题
	"完成进度",			                	--2 行列任务标题
	"任务%s完成进度",			            --3 行列描述内容
}
-- 秘境之旅活动提示
tipStringInfo_activity_secret_treasure = {
	"第%s层",			                		--1 
	"您已找到终极宝物，",			            --2 
	"请设置终极奖励",			                --3 
	"第%s层解锁",			                	--4 
	"是否进入下一层",			                --5 
	"是否放弃未获得的剩余奖励并前往下一层？",	--6 
}
-- 装备淬炼提示
tipStringInfo_equipment_harden = {
	"装备觉醒到5星开启淬炼",			                		--1 淬炼限制提示
	"花费一个%s锁定该词条,在置换时会消耗",			            --2 锁定提示
	"1/%d",			                --3 	锁定花费的锁定石
	"无可置换词条",			                --4 	置换提示
	"255,0,0",								--5	重生后属性变色(rgb三色值)
	"已到等级上限了哟~",						--6 等级上限提示
	"(范围:%s)",						--7 范围提示
	"锁定石消耗完毕,自动取消锁定",						--8 道具不足提示
	"锁定石不足",					--9 锁定石道具不足提示
	"等级%s",					--10  等级描述
}
-- 帐号封停提示
tipStringInfo_account_closure = {
	"你的帐号已被封停,解封倒计时%s，详情请联系客服",          --1 封禁提示
	"你的帐号已被永久封停，详情请联系客服",							--2 永久封禁提示						
}
-- 忍列传提示
tipStringInfo_role_biography = {
	"激活成就",			    					--1 
	"印记值+%s",			           		 	--2 
	"通过占卜获得",			                	--3 
	"通过活动获得",			                	--4 
	"%s印记",			               			--5 
	"解锁篇章:",			               		--6 
	"解锁升星:",			               		--7 
	"该章节尚未解锁",			               	--8
	"(已激活%s个忍列传）",						--9
	"升至%s星",									--10
	"印记值达到%s",								--11
	"未上榜",									--12
	"铜钱不足",									--13
	"金币不足",									--14
	"免费%d次",									--15
	"占卜1次",									--16
	"占卜10次",									--17
	"道具不足",									--18
	"激活成就:%s",								--19
	"获得大量属性加成", 						--20
	"累计占卜%s/%s",							--21
}

tipStringInfo_command_world = {
	"未上榜",			    					--1 
	"%s积分可上榜",			    				--2
	"积分+%s",									--3
	"公会积分等级:%s",							--4
	"可购买%s次",								--5
	"未上榜",									--6
	"已经是最大可购买次数啦",					--7
	"已经是最小可购买次数啦",					--8
	"兑换道具不足",								--9
	"结束：",									--10
	"已结束",									--11
	"开启：",									--12
	"当前处于领奖展示阶段",						--13
	"跨服排行暂未开启",							--14
	"暂无公会",									--15
	"您现在还没有加入公会",						--16
	"当前处于结算中",						--17
}
tipStringInfo_activity_exchange_prop = {
	"当前兑换的专属刃具尚未装备，且揹包中只有一个，是否确认消耗该刃具",			--1 
}
-- 超級掃蕩提示
tipStringInfo_mopping_word = {
	"扫荡%s次",			    					--1 
	"重置",			    					--1 
	"40",			    					--1 
	"40级开启",			    					--1 
}
-- 半月礼活动
tipStringInfo_activity_month_gift_word = {
	"%s天",			    					--1
	"领取",			    					--2
	"已领取",			    					--3
	"等级和累计登录天数不足，无法领取",          --4
	"累计登录天数不足，无法领取",        --5
	"等级不足，无法领取",          --6
	"已过期",          --7
	"此礼包领取时间已结束",          --8
}
-- 超值团购活动提示
tipStringInfo_activity_group_buy = {
	"充值%s钻石",			                --1 
	"礼包%s",			                	--2 
	"%s钻石",			            		--3 
	"全服累计购买团购礼包次数达到%s次",			            		--4
	"个人累计购买团购礼包次数达到%s次",			            		--5 
	"个人累计购买充值团购礼包次数达到%s次",			            		--6
	"领取",  														--7
	"未完成",  													 --8
	"已领取",                                                      --9
	"%s次",                                                       --10
	"今日限购:",                                                         --11
	"本期限购:",                                                         --12
	"%s折",                                                            --13 XX折扣
	"活动已结束,请期待下次开放", 									--14
}
-- 神兽系统文本
tipStringInfo_magical_animals_word = {
	"完全点亮当前天命后解锁",			    					--1
	"%s阶",	--2
	"神锻",	--3
	"%s阶天赋",	--4
	"解锁神兽所需的道具不足",	--5
	"%s星激活",	--6
	"当前阶数神锻 进度已满，是否继续神锻",--7
	"请选择需要重生的神兽",	--8
	"%s升星后可激活额外效果",--9
	"%s回合",--10
	"解锁神兽后方可神锻",--11
	"暂无",--12
	"当前星级已满级",--13
	"所需道具不足",--14
	"按照技能冷却时间释放",--15
	"技能冷却时间一到就释放技能，若同时完成冷却时间则按照配置顺序释放，",--16
	"按照技能配置释放顺序释放",--17
	"严格按照配置顺序释放技能，若前一共技能没有释放，则后面技能即使完成冷却也不会释放",--18
	"神锻已满级",--19
	"活动",--20
	"该道具可从活动中获得",--21
}

-- 神兽属性文本
tipStringInfo_magical_animals_property_name_and_value = {
    ["-1"] = "无",
	["0"] = "全体生命:",
	["1"] = "全体攻击:",
	["2"] = "全体防御:",
	["4"] = "全体生命:%s",
	["5"] = "全体攻击:%s",
	["6"] = "全体防御:%s",
    ["96"] = "神兽攻击:",
	["97"] = "神兽攻击加成:%s",
	["98"] = "神兽伤害增加:%s",
	["99"] = "神兽伤害减免:%s",
	["100"] = "神兽受到的伤害增加:%s",
	["101"] = "神兽受到的伤害降低:%s",
	["102"] = "神兽暴击伤害:%s",
	["103"] = "神兽暴击率:%s",
	["104"] = "神兽抗暴率:%s",
}
-- 战魂
tipStringInfo_fight_spirit = {
	[1] = "号位",
	[2] = "主要属性",
	[3] = "随机属性",
	[4] = "觉醒属性",
	[5] = "套装属性",
	[6] = "套装技能",
	[7] = "材料不足",
	[8] = "装备[%s]4件套可激活",
	[9] = "强化至%d级可增强一条随机属性",
	[10] = "材料已添加满",
	[11] = "尚未激活套装技能",
	[12] = "揹包",
	[13] = "获得随机属性强化",
	[14] = "属性锁定保持不变",
	[15] = "每次仅能锁定3项，请解锁另一项后尝试",
	[16] = "满级",
	[17] = "经验已达上限",
	[18] = "(强化%s)",
	[19] = "当前无战魂可装备",
	[20] = "当前未装备战魂",
	[21] = "当前无战魂可消耗",
	[22] = "当前未添加战魂",
	[23] = "该战魂已上锁",
	[24] = "有已上锁战魂，请先解锁",
	[25] = "(只能激活一次)",
	[26] = "获得%s条随机属性",
	[27] = "获得随机觉醒属性",
	[28] = "已强化至最高等级",
	[29] = "当前添加材料已达上限",
	[30] = "还没有装备战魂",
	[31] = {144,238,144},--强化成功界面字体颜色
	[32] = {255,255,255},--战魂详情面板正常颜色
	[33] = {191,191,191},--战魂详情面板未激活颜色
	NONE = "无",
}

--战魂品质
tipStringInfo_fight_spirit_quality = {
	"绿色",
	"蓝色",
	"紫色",
	"橙色",
	"红色",
}

tipStringInfo_pay_tips = {
	"网络不稳定，请检查您的网络连接，然后重试",								--1 
	"付款正在验证中。 如果付款成功并且未获得商品，请再次按一下产品档。",								--2 
	"充值失败", -- 3
}


tipStringInfo_customer_service_tips = {							
	"https://chat.whatsapp.com/DGdFMxFHENs4dyNPdeQIZw", -- 1
	"亲爱的忍者，欢迎你的到来，有什么问题敬请留言", -- 2
	"https://ninjarevolution.ryzengames.com/", -- ONElink下载链接
	"加入Ninja Revolution的WhatsApp群组，获取最新消息、活动和客服支持！"
}
-- 七日连充活动描述
tipStringInfo_seven_days_recharge_tips = {							
	"连续充值%s天可领取", -- 1
	"累计充值%s金币可领取", -- 2
	"连续天数",--3
	"累计充值",--4
	"第%s天",--5
	"今天已参与充值,继续充值将不会增加天数",--6
}
-- 代金券提示
tipStringInfo_vouchers_tips = {
	"%s小时后到期",								--1 
	"已过期",								--2 
	"是否选择使用代金券,获得金币%s", -- 3
	"是否选择出售代金券.", --5
	"%s分钟后无法使用",								--5 
}
--竞速活动描述文本
tipStringInfo_racing_activity_description_tip = {
	"队伍总战力达成%s",							--1 
	"主角等级达成%s级",							--2 
}
-- 战力排行活动形象展示(对应Ship_mouldID)
tipStringInfo_fightRank_activity_ship_mould_id = {
  [1] = 351,
}

tipStringInfo_limit_time_equip_box_tips = {
	"需要达到%s积分 ",
}

tipStringInfo_limit_pray_activity_tips = {
	"已完成", -- 1
	"Go to",--2
	"Please select a wish reward at first", -- 3
	"Blessing*1",--4
	"Blessing*10",--5
	"Top up %s diamonds",--6
	"Receive",--7
	"(%s/%s)",--8 礼包限购提示文本			
	"Gift package purchase limit reminder text",--9
}

tipStringInfo_shop_restriction = {
	"每日限购",			                			--1 商店限购提示文本
	"每周限购",										--2 商店限购提示文本
	"每月限购",										--3 商店限购提示文本
	"每日5:00刷新",			                		--1 限购商店刷新提示文本
	"每周一5:00刷新",								--2 限购商店刷新提示文本
	"每月1日5:00刷新",									--3 限购商店刷新提示文本
}
tipStringInfo_limit_pray_activity_tips = {
	"已完成", -- 1
	"前往",--2
	"请先选择祈愿奖励", -- 3
	"祈福一次",--4
	"祈福十次",--5
	"充值%s钻石",--6
	"领取",--7
	"(%s/%s)",--8 礼包限购提示文本			
	"请先选择奖励",--9
}
tipStringInfo_christmas_romance_activity_tips = {
	"圣诞幸运券不足",--1
	"是否花费%s钻石抽奖",--2
	"圣诞商城兑换券不足",--3
	"重置次数不足",--4
	"圣诞刷新券不足",--5
	"活动已结束",--6
	"幸运转盘重置成功!",--7
}

-- 新服庆典标签內容
tipStringInfo_service_sevenday_type_name = {
	[1] = "关卡星级",
	[2] = "能力等级",
	[3] = "星级",
	[4] = "当前奖励（%s%%阶段）： ",
	[5] = "下一奖励（%s%%阶段）： ",	
	[46001] = "累计登录",
	[46002] = "关卡挑战",
	[46003] = "精英挑战",
	[46004] = "铜币消耗",
	[46005] = "忍者成长",
	[46006] = "金币消耗",
	[46007] = "竞技对战",
	[46008] = "咒印升级",
	[46009] = "挑战任务",
	[46010] = "每日礼包",
	[46011] = "通灵修行",
	[46012] = "公会总动员",
	[46013] = "测试宝箱",
	[46014] = "测试点数",
	[46015] = "铜币获得",
}
-- 新招募系统
new_recruit_shop_str = {
	"每日限购：",		 -- 1
	"每周限购：",		 -- 2
	"每月限购：",		 -- 3
	"设置成功",		 -- 4
	"达到%d阶时解锁",	 -- 5
	"请选择",		 -- 6
	"许愿成功",		 -- 7
	"金币不足，是否前往储值？",	-- 8
	"抽奖一次",			 -- 9
	"抽奖十次",			 -- 10
	"未满足兑换条件",    -- 11
	"召唤币不足",    -- 12
	"你没有更多的心愿了",    -- 13
	"Prompt",				-- 14
}
-- 战令系统文本
war_order_str = {
	"剧情任务",		 -- 1
	"主线关卡",		 -- 2
	"精英关卡",		 -- 3
	"试练塔",		 -- 4
	"第%d关",	 -- 5
	"本服累计购买已达%d次",		 -- 6
	"杂货店",		 -- 7
	"特殊商店",	-- 8
	"每日限购:",			 -- 9
	"每周限购:",			 -- 10
	"本期限购:",    -- 11
	"永久限购:",    -- 12
	"道具不足",    -- 13
	"%Y年%m月%d日%H时",		-- 14
	"%d级可用",			-- 15
	"1.电子通行证活动每期为30天。\r\n2.获得经验可提升通行证等级，解锁更多奖励。\r\n3.电子通行证经验可通过完成日常任务与周常任务或充值获得，充值经验比例为1:65。\r\n4.连续购买三期电子通行证，即可获得电子通行证激活道具，可免费激活一项高级奖励。\r\n5.电子通行证的奖励分为普通奖励和高级奖励。达到对应的通行证等级即可获得普通奖励。高级奖励需通过充值或激活道具，并达到对应通行证等级后获得。\r\n6.当本服电子通行证的购买次数达到指定数量时，本服全体玩家均可获得全民购买奖励。\r\n7.商店分为普通商店和特殊商店，可使用普通通行证金币与特殊通行证金币兑换资源。\r\n8.电子通行证仅可激活高级奖励，不含钻石。同时可获得VIP经验与通行证经验，并可激活累计充值与充值资源进度。",	-- 16
	"1.进度通行证分为剧情任务和剧情关卡两种类型。\r\n2.进度通行证可通过完成不同类型的条件来领取奖励。\r\n3.进度通行证的奖励分为普通奖励和高级奖励。达到对应的通行证进度即可获得普通奖励。高级奖励需通过充值或激活道具，并达到对应通行证进度后获得。\r\n4.当本服进度通行证的购买次数达到指定数量时，本服全体玩家均可获得全民购买奖励。\r\n5.全民购买奖励的购买次数仅在同类型通行证中累计，不同类型通行证的购买次数不共享。\r\n6.进度通行证仅可激活高级奖励，不含钻石。同时可获得VIP经验与通行证经验，并可激活累计充值与充值资源进度。\r\n7.每个阶段的高级奖励需单独购买激活。",				----17
	"恭喜获得%d点战令经验",	-- 18
	"没有购买次数",			-- 19	
	"你当前没有可领取的奖励",	-- 20
	"%d级",	-- 21
}
-- 服务器列表显示优化文本
tipStringInfo_sever_list = {
	"推荐服务器",	-- 1 
	"%s-%s",		-- 2 服务器分类名称
	"全服",	-- 3 
}
--字体颜色配置集合
tipStringInfo_color_type_assemble = {
	{60,75,156},				--1进阶材料金币消耗(足够时)
	{255,34,34},				--2进阶材料金币消耗(不足时)
	{60,75,156},				--3角色阵容羁绊词条(激活时)
	{137,160,220},				--4角色阵容羁绊词条(未激活时)
	{73,168,214},				--5数码兽筛选字体颜色（正常）
	{255,255,255},				--6数码兽筛选字体颜色（按下时）
	{255,34,34},				--7材料消耗字体颜色(不足时)
	{44,55,108},				--8觉醒材料字体颜色(足够时)
}
---------------------暗色字
dark_text_color = {
	{45,53,88},----------0白色
	{21,125,48},--------------1绿色
	{36,107,202},------------2蓝色
	{130,60,200},------------3紫色
	{227,123,60},------------4橙色
	{221,71,56},--------------5红色
	{220,160,0},------------6金色
}
--亮色字
bright_words_color = {
	cc.c3b(244,247,234),			---------------------1 品质白 R180 G180 B180
	cc.c3b(61,217,101),			---------------------2 品质绿 R10 G242 B32
	cc.c3b(71,177,226),				-----------------3 品质蓝 R10 G207 B242
	cc.c3b(181,108,255),			---------------------4 品质紫 R222 G70 B204
	cc.c3b(255,162,80),			---------------------5 品质橙 R204 G197 B11
	cc.c3b(255,96,80),				-----------------6 品质红 R239 G22 B22
	cc.c3b(254,231,61),				---------------------7 品质褐 R98 G55 B0
}
tipStringInfo_proup_title_text = {
	"Rulers",              -- 1、规则
}
tipStringInfo_rule_text = {
	"1.每日充值达到对应额度，即可获得对应奖励\r\n2.每日额度将于服务器时间5:00清零，请注意每日刷新时间。\r\n3.每日累计额度按照对应档位的基础额度计算，与额外奖励无关。",    -- 1
}
-- 大富翁文本
tipStringInfo_richman = {
	"骰子数量不足",				-- 1 扔骰子时数量不足提示
	"请选择一个奖励",			-- 2 特殊奖励选择提示
	"%d级",				   -- 3 格子对应等级文本
	"任务获取",					-- 4 骰子获取途径1（废弃）
	"礼包获取",					-- 5 骰子获取途径2（废弃）
	"购买钻石获取",				-- 6 骰子获取途径3（废弃）
	"兑换次数不足",					--7 钻石购买骰子时，兑换次数不足提醒
	"接下来%s回合可获得积分*%s",			--8 积分翻倍显示
	"1.大富翁棋盘共有18个格子，分为14个普通格和4个事件格。\r\n2.事件内容为：获得普通骰子*1、接下来3次投掷骰子的积分*2、选择移动至指定格子（不可选择事件格）。\r\n3.每次投掷骰子均可获得积分。普通骰子每次投掷可获得1积分，幸运骰子每次投掷可获得2积分，达到指定阶段即可领取达标奖励。\r\n4.普通骰子可通过完成活动任务、钻石购买和礼包购买获得，幸运骰子可通过礼包购买获得。\r\n5.活动结束后，未使用的普通骰子将按1:1000兑换为金币，幸运骰子将按1:2000兑换为金币\r\n6.活动结束后，未领取的达标奖励将通过邮件补发给玩家。对于可选奖励，若玩家未做选择，则默认补发满足条件的可选奖励道具。\r\n7.大富翁的14个普通格拥有等级，每落入一次格子，该格子便会升级，满级为6级\r\n8.当棋盘上每盏灯全部点亮时，大富翁将触发神秘大奖",				--9 规则文本
	"该加成可在%s装备中选择",					--10 选择可选奖励提示
	"未配置配对骰子获取活动",		 --11 没有特殊骰子获取活动提示
	"该加成点已无可选次数",		 --12 没有可选奖励次数提示
	"无限次数",					--13 积分奖励无次数限制提示
}
-- 头像索引文本
tipStringInfo_face_text = {
	"获得%s",				-- 1 头像和形象索引文本
	"第%d关",				-- 2 印记阶段文本
	"Wear",					-- 3 佩戴文本
	"使用",					-- 4 使用文本
	"当前头像框正在使用中",	  -- 5 头像框印记界面佩戴提示文本
}
tipStringInfo_watch_ads_text = {
	"(%s/%s)",			             -- 1 观看视频标题,已看次数/总次数
	"今日成功观看%s可额外获得惊喜奖励！",  -- 2 成功觀看多少次次可獲得額外獎勵
	"%s次",		                     -- 3 再观看的次数显示
	"（每周一5:00刷新）",			     -- 4 重置时间提示
	"今日观看影片可免费获得100体力",  -- 5 购买体力界面获得体力
	"%s/%s",						 -- 6 购买体力界面次数
	"广告观看失败",					 -- 7 广告观看失败
	"广告载入中，请稍后再试",	 -- 8 暂无广告提示
	"今日奖励观看次数已用完",	     -- 9 今日有奖观看次数已达上限提示
}
-- 战报统计文本
tipStringInfo_fight_report_detail_tips = {
	"%s(+%s)",				-- 1 排名上升文本
	"%s(-%s)",				-- 2 排名下降文本
}
-- 关闭充值功能文本
tipStringInfo_close_recharge_tips = {
	[1] = "充值功能暂时关闭，开放时间请留意游戏公告",
}

-- Fury: nombre de servidor que llega como SOLO el numero que ve el jugador
-- («2»): ProtocolParserCopy.lua lo compone con este formato.
tipStringInfo_server_name_format = "伺服器%s"

-- Codigos de regalo (punto 7.26): icono, ventana y boton de la ciudad
tipStringInfo_gift_codes = {
	"兑换码",		-- 1 icono y titulo
	"永久有效",		-- 2 no caduca
	"%d天后过期",		-- 3 caduca en N dias
	"%d小时后过期",		-- 4 caduca en N horas
	"新！",		-- 5 codigo de hoy
	"已兑换",		-- 6 ya canjeado
	"点「兑换」会直接填入兑换码介面。复制方法：点击兑换码，在键盘上方的输入栏里长按，选择「复制」。",		-- 7 como copiar
	"暂时没有可用的兑换码。",		-- 8 lista vacia
	"兑换",		-- 9 boton canjear
}
-- Fury: la tienda de suscripciones (FurySubscriptionShop.lua, 29-sep-2026)
_fury_subscription_text = {
	"订阅",		-- 1 icono y titulo
	"高级币：%d",		-- 2 saldo
	"%d天",		-- 3 duracion
	"购买",		-- 4 boton comprar
	"生效中：剩余%d天",		-- 5 activa
	"本周已购买",		-- 6 comprada esta semana
	"高级币不足。",		-- 7 saldo corto
	"是否购买%s？需要%d高级币。",		-- 8 confirmar compra
	"高级商店",		-- 9 boton tienda premium
	"规则",		-- 10 titulo de reglas
	"每日奖励（VIP +%d%%）",		-- 11 premios del dia
	"价格：%d",		-- 12 precio
	"1. 使用高级币购买礼包。",		-- 13 regla 1
	"2. 连续7天每天通过邮件领取奖励，购买后立即收到第一封邮件。",		-- 14 regla 2
	"3. VIP等级越高，每日奖励略多。显示的数量已包含你的加成。",		-- 15 regla 3
	"4. 同一礼包不能同时生效两次。",		-- 16 regla 4
	"5. 每个礼包每个游戏周可购买一次（周一05:00重置）。",		-- 17 regla 5
	"6. 不同礼包可以同时生效。",		-- 18 regla 6
	"7. 高级币来自「高级币」活动：每次充值对应档位的礼包，可获得其基础金币10%的高级币。",		-- 19 regla 7
	"购买成功！今日奖励已发送到邮箱。",		-- 20 compra hecha
	"忍者礼包",		-- 21 nombre paquete 3
	"强化礼包",		-- 22 nombre paquete 4
	"至尊礼包",		-- 23 nombre paquete 5
}
-- Fury: la Tienda Premium (evento 70, 29-sep-2026), rotulo del tope que vuelve a cero
_fury_premium_shop_text = {
	"每日",		-- 1 tope diario
	"每周",		-- 2 tope semanal
}
-- Rango del heroe (sistema E, FuryHeroTitle.lua; docs/systems/rango_heroe.md)
_fury_hero_title_text = {
	"军衔",		-- 1 boton y titulo
	"军衔 %d/%d",		-- 2 rango actual/tope
	"当前",		-- 3 columna actual
	"下一级",		-- 4 columna siguiente
	"生命 +%d",		-- 5 vida
	"攻击 +%d",		-- 6 ataque
	"防御 +%d",		-- 7 defensa
	"升级需求",		-- 8 requisitos
	"提升军衔",		-- 9 boton subir
	"已达最高军衔",		-- 10 en el tope
	"军衔徽章不足。",		-- 11 sin insignias
	"军衔提升！",		-- 12 subida hecha
	"下忍",		-- 13 tramo 1-5
	"中忍",		-- 14 tramo 6-10
	"上忍",		-- 15 tramo 11-15
	"暗部",		-- 16 tramo 16-20
	"影级",		-- 17 tramo 21-25
	"火影",		-- 18 tramo 26-30
	"无军衔",		-- 19 rango 0
}
-- Fury: el jefe interservidor, sistema D (FuryCrossBossWindow.lua)
_fury_cross_boss_text = {
	"宇智波鼬入侵",		-- 1 titulo e icono
	"规则",		-- 2 titulo de las reglas
	"1. 宇智波鼬每天20:00至21:00（服务器时间）入侵。",		-- 3 regla 1
	"2. 每天可以攻击3次：积分为你所有攻击（每次5回合）造成的伤害总和。每次攻击立即获得奖励。",		-- 4 regla 2
	"3. 所有服务器的玩家在同一个伤害排行榜中竞争。",		-- 5 regla 3
	"4. 活动结束后奖励通过邮件发放：排名靠前的玩家获得排名奖励，所有参与攻击的玩家获得参与奖励。",		-- 6 regla 4
	"5. 宇智波鼬的血量由所有服务器共享。即使血量为0，仍可继续攻击获得积分。",		-- 7 regla 5
	"奖励",		-- 8 titulo de premios
	"第%d名",		-- 9 un puesto
	"第%d-%d名",		-- 10 tramo de puestos
	"参与奖",		-- 11 participacion
	"每次攻击",		-- 12 premio de cada ataque
	"今日攻击：%d/%d",		-- 13 ataques de hoy
	"攻击奖励：%s",		-- 14 aviso del premio del golpe
}
-- Fury: el banner especial SR (FuryBannerSR.lua, sistema C, 29-sep-2026)
_fury_banner_sr_text = {
	"SR招募",		-- 1 icono y titulo
	"选择SR",		-- 2 boton elegir
	"你的SR",		-- 3 cabecera sin SR
	"请先选择一名SR英雄。",		-- 4 hay que elegir
	"选择你的SR",		-- 5 titulo de la lista
	"已选择",		-- 6 ya elegido
	"选择",		-- 7 boton elegir de fila
	"SR名单刷新：%s",		-- 8 lista nueva en
	"规则",		-- 9 titulo de reglas
	"1. 从本周名单中选择一名SR英雄，可随时更换。",		-- 10 regla 1
	"2. 四个发光的SR格子给予所选SR的碎片，一个稀有格子给予2个高级币；其余格子给予少量金币、金币宝箱、铜币和碎片。",		-- 11 regla 2
	"3. 每天3次免费单抽；之后每次消耗1张抽奖券或68金币（10连680）。",		-- 12 regla 3
	"4. SR英雄名单每周更换（周一05:00）。",		-- 13 regla 4
	"5. 若你的SR离开名单，抽奖前请重新选择。",		-- 14 regla 5
	"%s 获得了 %s x%d",		-- 15 registro: quien, que, cuanto
	"暂无大奖记录，快来成为第一人！",		-- 16 registro vacio
}
-- Fury: las pociones del heroe, sistema K (FuryHeroPotion.lua, 29-sep-2026)
_fury_potion_text = {
	"药水",		-- 1
	"生效中的药水",		-- 2
	"没有生效中的药水",		-- 3
	"使用",		-- 4
	"拥有：%d",		-- 5
	"剩余%s",		-- 6
	"攻击 +%d",		-- 7
	"生命 +%d",		-- 8
	"防御 +%d",		-- 9
	"替换该类型生效中的药水？剩余时间将会失去。",		-- 10
	"你没有这种药水。可在高级商店购买。",		-- 11
	"药水已使用！",		-- 12
	"规则",		-- 13
	"1. 药水可在数小时内为忍者提供额外的生命、攻击或防御。使用时会消耗背包中的一瓶。",		-- 14
	"2. 共有四种：力量（攻击）、活力（生命）、防御（防御）和至尊（三项全加，各为一半）。",		-- 15
	"3. 每名忍者同一时间每种药水只能有一瓶生效。不同种类可以叠加。",		-- 16
	"4. 使用同类型的另一瓶药水会替换生效中的药水，其剩余时间将会失去。",		-- 17
	"5. 即使离线，时间也会流逝。时间结束后，加成消失。",		-- 18
	"6. 药水在背包中不会过期。可在高级商店购买。",		-- 19
	"%d小时%d分",		-- 20
	"持续%s",		-- 21
}
-- Fury: los artefactos de companero, sistema F (FuryCompanionArtifact.lua, 29-sep-2026)
_fury_companion_artifact_text = {
	"神器",		-- 1 boton y titulo
	"等级 %d/%d",		-- 2 nivel/tope
	"未装备神器",		-- 3 sin artefacto
	"当前",		-- 4 columna actual
	"下一等级",		-- 5 columna siguiente
	"生命 +%d",		-- 6 vida
	"攻击 +%d",		-- 7 ataque
	"防御 +%d",		-- 8 defensa
	"升级",		-- 9 boton subir
	"已满级",		-- 10 nivel maximo
	"神器粉尘不足。",		-- 11 sin polvo
	"神器升级成功！",		-- 12 subida hecha
	"卸下",		-- 13 boton quitar
	"装备神器",		-- 14 boton poner
	"背包中的神器",		-- 15 cabecera mochila
	"你没有神器：可召唤或在高级商店购买。",		-- 16 mochila vacia
	"召唤 x1",		-- 17 invocar 1
	"召唤 x10",		-- 18 invocar 10
	"获得：",		-- 19 resultado invocacion
	"技能：%s",		-- 20 habilidad
	"%d级开启技能",		-- 21 habilidad cerrada
	"暴击率 +%s%%",		-- 22 prop 8
	"抗暴率 +%s%%",		-- 23 prop 9
	"格挡率 +%s%%",		-- 24 prop 10
	"破格挡 +%s%%",		-- 25 prop 11
	"最终伤害 +%s%%",		-- 26 prop 33
	"伤害减免 +%s%%",		-- 27 prop 34
	"伙伴神器",		-- 28 titulo reglas
	"1. 每个忍者有一个神器栏位。装备神器时会从背包取出；卸下或更换时会放回背包。",		-- 29 regla 1
	"2. 等级属于忍者的栏位：更换神器等级不变。",		-- 30 regla 2
	"3. 使用神器粉尘升级：每级提升神器的生命、攻击和防御。",		-- 31 regla 3
	"4. 5级起开启神器技能，并随等级提升。所有战斗中生效。",		-- 32 regla 4
	"5. 可通过此处召唤、高级商店、主线和精英关卡以及活动获得神器和粉尘。",		-- 33 regla 5
	"金币不足。",		-- 34 sin diamantes
}
-- Fury: los prohibidores, sistema I (FuryProhibitor.lua; docs/systems/prohibidores.md)
_fury_prohibitor_text = {
	"禁器",		-- 1 titulo
	"召唤x%d",		-- 2 boton invocar
	"%d金币",		-- 3 precio diamantes
	"%d张召唤券",		-- 4 precio billetes
	"召唤券：%d   禁器精华：%d",		-- 5 billetes y esencia
	"全体忍者：生命+%d  攻击+%d  防御+%d",		-- 6 total a todos
	"未激活",		-- 7 sin activar
	"星级 %d/%d",		-- 8 estrella
	"数量：%d",		-- 9 copias
	"启动",		-- 10 activar
	"升星：%d精华",		-- 11 mejorar
	"分解",		-- 12 convertir
	"已满星",		-- 13 tope
	"规则",		-- 14 titulo reglas
	"1. 使用金币召唤禁器：单抽68，十连680。召唤券足够时优先消耗召唤券（每次1张）。",		-- 15 regla 1
	"2. 各品质概率：",		-- 16 regla 2
	"3. 获得的禁器进入背包。在此消耗1个即可激活：其生命、攻击、防御加成给全体忍者。",		-- 17 regla 3
	"4. 多余的禁器可分解为禁器精华。精华可提升已激活禁器的星级及属性。",		-- 18 regla 4
	"5. 召唤券和禁器精华也可在高级商店购买。",		-- 19 regla 5
	"获得：%s",		-- 20 obtenido
	"是否将%d个分解为%d禁器精华？",		-- 21 confirmar convertir
	"普通",		-- 22 calidad 1
	"稀有",		-- 23 calidad 2
	"史诗",		-- 24 calidad 3
	"传说",		-- 25 calidad 4
	"生命+%d  攻击+%d  防御+%d",		-- 26 atributos de fila
}
-- Fury: las cronicas, sistema G (FuryChronicle.lua, 29-sep-2026)
_fury_chronicle_text = {
	"编年史",		-- 1 titulo, icono y boton
	"编年史书页：%d",		-- 2 paginas que tiene
	"全局编年史",		-- 3 cronica global
	"全体忍者加成",		-- 4 subtitulo global
	"仅此忍者加成",		-- 5 subtitulo del guerrero
	"等级 %d/%d",		-- 6 nivel / tope
	"生命+%d  攻击+%d  防御+%d",		-- 7 atributos de ahora
	"下一级：生命 +%d  攻击 +%d  防御 +%d",		-- 8 atributos del siguiente
	"升级",		-- 9 boton subir
	"已满级",		-- 10 al tope
	"编年史书页不足。",		-- 11 sin paginas
	"编年史已升级！",		-- 12 subida hecha
	"规则",		-- 13 titulo de reglas
	"1. 全局编年史为你的全体忍者提供生命、攻击和防御。",		-- 14 regla 1
	"2. 每名忍者都有自己的编年史：其加成只作用于该忍者。可在此处或忍者界面（编年史按钮）打开。",		-- 15 regla 2
	"3. 两者都用编年史书页升级。等级越高，消耗的书页越多，加成也越大。",		-- 16 regla 3
	"4. 通过召唤、在主线副本中获胜和领取活动奖励（各有每日上限）可获得书页，高级商店也有出售。",		-- 17 regla 4
	"5. 加成会立即计入忍者的属性和战力。",		-- 18 regla 5
}
-- Fury: las torres diaria y semanal (FuryTowers.lua, 29-sep-2026)
_fury_tower_text = {
	"每日之塔",		-- 1
	"每周之塔",		-- 2
	"第%d/%d层",		-- 3
	"%s后重置",		-- 4
	"挑战",		-- 5
	"双倍奖励",		-- 6
	"削弱",		-- 7
	"重置高塔",		-- 8
	"每日排行",		-- 9
	"价格：%d",		-- 10
	"本层已生效",		-- 11
	"本层已使用",		-- 12
	"花费%d高级币为本层购买双倍奖励？",		-- 13
	"花费%d高级币削弱本层敌人（生命和攻击减半）？",		-- 14
	"花费%d高级币将每周之塔重置到第1层？",		-- 15
	"高级币不足。",		-- 16
	"本层已购买过。",		-- 17
	"本周的每周重置已使用。",		-- 18
	"请先从高塔开始挑战。",		-- 19
	"战斗时间太短，请重试。",		-- 20
	"高塔已通关！请在重置后再来。",		-- 21
	"暂时没有可重置的内容。",		-- 22
	"此塔每天自动重置。",		-- 23
	"高级币：%d",		-- 24
	"每日排行 - 前50名",		-- 25
	"我的排名：第%d名（第%d层）",		-- 26
	"暂未上榜",		-- 27
	"第%d名  %s  - 第%d层",		-- 28
	"高塔规则",		-- 29
	"1. 按顺序通关各层，每通关一层即可获得该层奖励。",		-- 30
	"2. 挑战次数不限：失败后仍停留在当前层。",		-- 31
	"3. 双倍奖励：下一次通关的楼层奖励翻倍。每层限一次。",		-- 32
	"4. 削弱：下一层敌人的生命和攻击减半，直到你通关该层。每层限一次。",		-- 33
	"5. 两者均使用高级币支付。",		-- 34
	"6. 每日之塔：共100层，免费，每天05:00重置。每日排行：按最高楼层排名，同层先到者在前。仅显示前50名，且仅前50名在当天结束时通过邮件获得奖励。",		-- 35
	"6. 每周之塔：共200层，每周一05:00重置。每周可付费一次重置到第1层，再次获得各层奖励。",		-- 36
	"排名奖励（每日结束时通过邮件发放）",		-- 37
	"第%d名",		-- 38
	"第%d-%d名",		-- 39
}
-- Fury: las gemas del heroe, sistema M (FuryHeroGem.lua, 29-sep-2026)
_fury_hero_gem_text = {
	"宝石",		-- 1 titulo y boton
	"生命槽位",		-- 2 hueco vida
	"攻击槽位",		-- 3 hueco ataque
	"防御槽位",		-- 4 hueco defensa
	"空",		-- 5 vacio
	"卸下",		-- 6 quitar
	"镶嵌",		-- 7 engastar
	"合成宝石",		-- 8 combinar
	"我的宝石",		-- 9 tus gemas
	"你没有宝石。可在此召唤，或在高级商店购买。",		-- 10 sin gemas
	"生命 +%d",		-- 11 vida
	"攻击 +%d",		-- 12 ataque
	"防御 +%d",		-- 13 defensa
	"召唤 x1",		-- 14 invocar 1
	"召唤 x10",		-- 15 invocar 10
	"获得：",		-- 16 obtenido
	"合成 %d → 1（下一级）",		-- 17 combinar n
	"已满级",		-- 18 nivel maximo
	"该忍者的宝石加成：",		-- 19 bono del guerrero
	"6个槽位：生命2个、攻击2个、防御2个。宝石只能镶嵌在同类槽位；没有空槽位时替换最弱的宝石。相同的宝石可合成为更高一级的宝石。",		-- 20 reglas
	"宝石合成成功！",		-- 21 combinadas
	"宝石不足，无法合成。",		-- 22 faltan gemas
}
-- Fury: pergaminos del heroe, sistema J (FuryHeroScroll.lua)
_fury_hero_scroll_text = {
	"卷轴",		-- 1 boton y titulo
	"等级 %d/%d",		-- 2 nivel/tope
	"未装备卷轴",		-- 3 sin pergamino
	"生命 +%d",		-- 4 vida
	"攻击 +%d",		-- 5 ataque
	"防御 +%d",		-- 6 defensa
	"下一等级",		-- 7 siguiente nivel
	"强化",		-- 8 boton mejorar
	"已满级",		-- 9 en el tope
	"卸下",		-- 10 boton quitar
	"装备神器",		-- 11 boton equipar
	"拥有：%d",		-- 12 cuantos hay
	"卷轴墨水不足。",		-- 13 sin tinta
	"完成！",		-- 14 hecho
	"你的卷轴",		-- 15 lista
	"等级属于该忍者的栏位，更换卷轴时保留。",		-- 16 regla del nivel
}

-- Sistema L: runas del heroe (FuryHeroRune.lua; docs/systems/runas_heroe.md).
_fury_rune_text = {
	"符文",		-- 1 boton y titulo
	"槽位%d",		-- 2 ranura
	"空槽位",		-- 3 vacia
	"未解锁：忍者%d级",		-- 4 cerrada por nivel
	"未解锁：忍者%d级且升星%d次",		-- 5 cerrada por nivel y estrellas
	"卸下符文",		-- 6 quitar
	"镶嵌符文",		-- 7 engarzar
	"合成符文",		-- 8 fusionar
	"拥有符文：%d",		-- 9 cuantas tiene
	"符文粉尘：%d",		-- 10 polvo
	"合成：%d个相同符文+%d符文粉尘",		-- 11 coste fusion
	"召唤符文x1",		-- 12 invocar 1
	"召唤符文x10",		-- 13 invocar 10
	"没有空的符文槽位：请先卸下一个符文。",		-- 14 sin ranura libre
	"符文或符文粉尘不足，无法合成。",		-- 15 faltan para fusionar
	"符文镶嵌成功！",		-- 16 engarzada
	"获得符文：",		-- 17 obtenido
	"我的符文",		-- 18 mis runas
	"你没有符文。可通过召唤、高级商店或精英关卡获得。",		-- 19 sin runas
	"已镶嵌符文",		-- 20 ya engarzada, en el heroe
	"符文加成：生命+%d 攻击+%d 防御+%d",		-- 21 rune stats
}
-- Fury: el arbol de pasivas, sistema H (FuryHeroPassiveTree.lua; docs/systems/arbol_pasivas.md)
_fury_passive_tree_text = {
	"被动之树",		-- 1 titulo y boton
	"节点 %d/%d",		-- 2 nodos abiertos
	"圣树之果：%d",		-- 3 frutos que tiene
	"总加成",		-- 4 total
	"生命 +%d",		-- 5 vida
	"攻击 +%d",		-- 6 ataque
	"防御 +%d",		-- 7 defensa
	"速度 +%d",		-- 8 velocidad
	"暴击率 +%d%%",		-- 9 pasiva 8
	"抗暴率 +%d%%",		-- 10 pasiva 9
	"格挡率 +%d%%",		-- 11 pasiva 10
	"破格挡 +%d%%",		-- 12 pasiva 11
	"最终伤害 +%d%%",		-- 13 pasiva 33
	"伤害减免 +%d%%",		-- 14 pasiva 34
	"分支 %s",		-- 15 rama
	"节点 %d",		-- 16 nodo
	"解锁",		-- 17 boton desbloquear
	"已全部解锁",		-- 18 arbol completo
	"重置",		-- 19 boton reiniciar
	"花费%d金币重置被动之树？返还%d个圣树之果（两不返还）。",		-- 20 confirmar reinicio
	"圣树之果不足。",		-- 21 sin frutos
	"节点已解锁！",		-- 22 nodo abierto
	"已重置被动之树。",		-- 23 reiniciado
	"暂无加成",		-- 24 sin bonus
	"圣树之果：召唤、主线副本胜利、活动奖励（每日上限）以及高级商店。",		-- 25 de donde salen
}
-- Fury: el evento Monedas Premium (179, 30-sep-2026; docs/systems/evento_monedas_premium.md)
_fury_premium_event_text = {
	"高级币",		-- 1 titulo e icono
	"1. 充值列表中对应档位的礼包，即可获得该档位基础金币10%的高级币（翻倍的金币不计入）。",		-- 2 regla 1
	"2. 每次充值可领取一次奖励；每个档位每天最多99次，次数每日重置。月卡不计入。",		-- 3 regla 2
}
-- Fury: el boton «Mejoras» de la ficha del heroe y su panel (30-sep-2026; docs/systems/marco_heroe.md)
_fury_hero_extras_text = {
	"强化",		-- 1 boton y titulo del panel
	"%d级",		-- 2 nivel minimo de un boton bloqueado
}
-- Fury: el pase de temporada (sistema 15, 30-sep-2026; docs/systems/pase_temporada.md)
_fury_season_pass_text = {
	"赛季通行证",		-- 1 titulo e icono
	"第%d赛季",		-- 2 temporada
	"剩余%d天",		-- 3 dias que quedan
	"等级 %d/%d",		-- 4 nivel
	"通行证积分：%d/%d",		-- 5 puntos hacia el siguiente nivel
	"高级：已激活",		-- 6 premium activo
	"解锁高级",		-- 7 boton desbloquear
	"花费%d高级币解锁本赛季高级通行证？",		-- 8 confirmar desbloqueo
	"高级币不足。",		-- 9 sin monedas
	"高级通行证已解锁！",		-- 10 desbloqueado
	"每日任务",		-- 11 cabecera diarias
	"每周任务",		-- 12 cabecera semanales
	"等级奖励",		-- 13 cabecera premios
	"免费通行证",		-- 14 camino gratis
	"高级通行证",		-- 15 camino premium
	"领取",		-- 16 boton cobrar
	"全部领取",		-- 17 boton cobrar todo
	"已全部领取",		-- 18 todo cobrado
	"奖励已领取！",		-- 19 premios cobrados
	"+%d积分",		-- 20 puntos de una mision
	"已达成",		-- 21 mision hecha
	"高级币：%d",		-- 22 saldo de monedas
	"已满级",		-- 23 nivel maximo
	"规则",		-- 24 titulo de reglas
	"1. 每个赛季持续30天。结束后会自动开始带有新奖励的新赛季。",		-- 25 regla 1
	"2. 完成每日和每周任务会立即获得通行证积分，无需领取。积分可以提升通行证等级。",		-- 26 regla 2
	"3. 每个等级都有免费奖励和高级奖励。高级奖励需要用高级币解锁高级通行证（仅限当前赛季）。",		-- 27 regla 3
	"4. 请在此窗口领取奖励。赛季结束时，未领取的奖励将会失效。",		-- 28 regla 4
	"5. 每日任务每天5:00重置，每周任务每周一5:00重置。",		-- 29 regla 5
	"6. 高级币可在「高级币」活动（充值）中获得。",		-- 30 regla 6
	"登录游戏",		-- 31 mision 31 entrar
	"竞技挑战",		-- 32 mision 32 arena
	"召唤忍者",		-- 33 mision 33 invocar
	"剧情关卡战斗",		-- 34 mision 34 historia
	"消耗体力",		-- 35 mision 35 aguante
	"冒险挑战",		-- 36 mision 36 aventura
	"竞技场胜利",		-- 37 mision 37 victorias arena
	"精英关卡战斗",		-- 38 mision 38 elite
	"金币消耗",		-- 39 mision 39 diamantes
	"蛇道试炼战斗",		-- 40 mision 40 torre de pruebas
}
-- Fury: los hitos del servidor (sistema 19, 30-sep-2026; docs/systems/hitos_servidor.md)
_fury_server_milestone_text = {
	"全服里程碑",		-- 1 titulo e icono
	"赛季剩余：%s",		-- 2 fin de temporada
	"召唤次数",		-- 3 metrica 1 invocaciones
	"竞技场战斗",		-- 4 metrica 2 arena
	"充值金币",		-- 5 metrica 3 diamantes recargados
	"全服战力",		-- 6 metrica 4 poder
	"已达成！奖励已通过邮件发放",		-- 7 tramo alcanzado
	"目标：%s",		-- 8 meta
	"进行中",		-- 9 tramo pendiente
	"规则",		-- 10 titulo de reglas
	"1. 本服所有玩家共同推进相同的目标：召唤、竞技场战斗、充值金币和战力。",		-- 11 regla 1
	"2. 本服达成一个目标时，本服每一位玩家都会通过邮件收到一次奖励。",		-- 12 regla 2
	"3. 同一赛季中后来加入的玩家，也会收到已达成目标的奖励。",		-- 13 regla 3
	"4. 每个赛季为期一个月，于每月1日5:00（服务器时间）开始。每个赛季计数从零重新开始。",		-- 14 regla 4
	"5. 全服战力为本服最强玩家的战力总和（战力排行榜）。",		-- 15 regla 5
	"%d天 %02d:%02d",		-- 16 formato dias horas minutos
}
-- Fury: invita a un amigo (FuryInviteFriend.lua, 30-sep-2026; docs/systems/invita_amigo.md)
_fury_invite_text = {
	"邀请好友",		-- 1
	"我的邀请码：%s",		-- 2
	"点击邀请码即可复制：在键盘上方的输入栏中长按并选择“复制”。",		-- 3
	"有奖励的邀请：%d/%d",		-- 4
	"好友邀请码",		-- 5
	"确定",		-- 6
	"填写邀请码剩余时间：%s",		-- 7
	"邀请人：%s",		-- 8
	"只有新角色（创建3天内且低于20级）才能填写好友的邀请码。",		-- 9
	"%d级：邀请人奖励",		-- 10
	"%d级：被邀请好友奖励",		-- 11
	"我邀请的好友",		-- 12
	"还没有邀请好友，快分享你的邀请码吧！",		-- 13
	"%s - %d级",		-- 14
	"奖励已发放至%d级",		-- 15
	"你没有奖励（已达上限）",		-- 16
	"邀请码绑定成功！升级时你们双方都会通过邮件获得奖励。",		-- 17
	"本服务器不存在该邀请码。",		-- 18
	"不能使用自己的邀请码、本账号的邀请码或你邀请的人的邀请码。",		-- 19
	"你已经有邀请人了。",		-- 20
	"你的角色已不是新角色：只能在创建后3天内且20级之前填写邀请码。",		-- 21
	"请输入6位邀请码。",		-- 22
	"规则",		-- 23
	"1. 每位玩家都有专属邀请码：分享给你的好友吧。",		-- 24
	"2. 新角色（创建3天内且低于20级）可以填写同一服务器玩家的邀请码，仅限一次。一个账号只能有一个邀请人。",		-- 25
	"3. 被邀请的好友达到20级、40级和60级时，你们双方都会通过邮件获得奖励。",		-- 26
	"4. 邀请人最多可因%d位被邀请好友获得奖励。",		-- 27
	"%d天%d小时",		-- 28
	"输入邀请码",		-- 29 seccion introducir
	"1. 好友把他的邀请码告诉你（你的在上方）。",		-- 30 paso 1
	"2. 在这里输入并点击确认：仅限创建后3天内且20级前。",		-- 31 paso 2
	"3. 达到20、40、60级时，你们两人都会通过邮件获得奖励。",		-- 32 paso 3
}
-- Fury: las ofertas relampago (FuryFlashOffers.lua, 30-sep-2026)
_fury_flash_offers_text = {
	"闪电特惠",		-- 1
	"高级币：%d",		-- 2
	"%s后结束",		-- 3
	"%s后刷新特惠",		-- 4
	"购买",		-- 5
	"商品已售罄",		-- 6
	"剩余：%d/%d",		-- 7
	"高级币不足。",		-- 8
	"是否购买%s？需要%d高级币。",		-- 9
	"购买成功！",		-- 10
	"规则",		-- 11
	"1. 每天会多次限时出现折扣礼包，持续数小时。所有玩家看到的礼包相同，每轮都会更换。",		-- 12
	"2. 使用高级币购买。每个礼包在每轮中都有每位玩家的购买上限。",		-- 13
	"当前没有特惠",		-- 14
	"闪电礼包",		-- 15
}
-- Fury: el pase de energia semanal (FuryEnergyPass.lua, 30-sep-2026; docs/systems/pase_energia.md)
_fury_energy_pass_text = {
	"体力通行证",		-- 1
	"每日体力 + 1次免费补满",		-- 2
	"免费补满",		-- 3
	"体力已补满！",		-- 4
	"体力通行证已激活！今日的额外体力已发放。",		-- 5
	"8. 体力通行证：使用高级币购买，持续%d天（含购买当天）。同一时间只能有一个生效；结束后可再次购买。",		-- 6
	"9. 生效期间：每个游戏日体力+%d（登录或打开本商店时发放），并且每天可免费补满一次体力，直至当前等级上限。每日05:00刷新。",		-- 7
}
