 -----------(0目前的动画方式,1新的)
animationMode = 1

-------------(内存是否充足，用于释放内存控制)
phoneMemoryEnough = true

------------(待机是否自由移动)
fightingMoveMode = 1 ---(0移动,1固定不移动)

___is_open_leadname = true   --  开启主角名称使用系统字库(繁体)

-----------------------连击条绘制坐标(X,Y，正右，负左，正上，负下)
qtePosition = {
	"536,370",----------------1
	"556,290",----------------2
	"536,220",----------------3
	"636,370",----------------4
	"656,290",----------------5
	"636,220",----------------6
	"556,290",----------------默认位
}

-------------------------资源抢夺初始坐标(X,Y)
capture_resource = {
	"0,784",----------------(第一排第一个点)(左上角为第一排)
    "-220,672",----------------(第二排第一个点)
}

----------------等级奖励(领取等级,奖励类型,奖励ID,奖励数量)
levelReward = {
	"6,7,13,1",------------------------七星宝刀
	"16,6,73,1",-----------------------橙色忍者卡
	"20,2,-1,1000",--------------------1000金币
}
----------------等级奖励开关(0关闭，1开启)
levelRewardMode = 1

-----------------------男女主角普攻光效ID
user_skill_effic_id = {
327,
214,
}


-----------------------男女主角默认语音ID
user_voice_id = {
55013,
55113,
}

---------------------------成就分页(分页名称，分页图标索引，是否显示(0显示，-1不显示))
achieveName = {
	{"沖級達人",11,0,1},----------------1
	{"完美通關",1,0,2},-----------------2
	{"戰力提升",3,0,3},-----------------3
	{"戰力爆表",3,-1,4},-----------------4
	{"特權在手",13,0,5},-----------------5
	{"神兵利器",5,0,6},-----------------6
	{"寶物祕笈",4,0,7},-----------------7
	{"最強陣容",12,0,8},-----------------8
	{"蕩平羅剎",9,0,9},-----------------9
	{"無之境地",6,0,10},-----------------10
	{"拔刀相助",7,-1,11},-----------------11
	{"懲惡揚善",9,0,12},-----------------12
	{"攢星達人",10,-1,13},-----------------13
	{"躍遷之力",6,-1,14},-----------------14
	{"精英通關",1,-1,15},-----------------15
}

-- 下载更新包提示
update_download_info = "正在玩命更新%s資料"

--------------------------------------------抢夺战斗背景音乐
battle_fight_type_10_bg_music = 2
--------------------------------------------演武场战斗背景音乐
battle_fight_type_11_bg_music = 2

spineAnimations = {
	"00_daiji",-----------------------待机			0
	"01_qianchong",-------------------前冲			1
	"02_huichong",--------------------回冲			2
	"01_qianchong",-------------------前冲			3
	"00_daiji",-----------------------待机			4
	"03_beiji",-----------------------被击			5
	"03_beiji",-----------------------被击			6
	"04_kbeiji",----------------------空中被击		7
	"04_kbeiji",----------------------空中被击		8
	"02_huichong",--------------------回冲			9
	"05_xuanyun",---------------------眩晕			10
	"06_siwang",----------------------死亡			11
	"06_siwang",----------------------死亡			12
	"06_siwang",----------------------死亡			13
	"07_pugong",----------------------普攻			14
	"08_jineng",----------------------技能			15
	"12_heti",------------------------合击			16
	"00_daiji",-----------------------待机			17
	"01_qianchong",-------------------前冲			18
	"11_xialuo",----------------------下落			19
	"00_daiji",-----------------------待机			20
	"01_qianchong",-------------------前冲			21
	"02_huichong",--------------------回冲			22
	"02_huichong",--------------------回冲			23
	"00_daiji",-----------------------待机			24
	"09_kzputong",--------------------空中/对空普攻	25
	"10_kzjineng",--------------------空中/对空技能	26
	"28_ddsiwang",--------------------倒地死亡		27
	"31_ji1",-------------------------单体技能		28
	"32_ji2",-------------------------一列技能		29
	"33_ji3",-------------------------横排技能		30
	"34_ji4",-------------------------全体技能		31
	"35_ji5",-------------------------加血技能		32
	"36_ji1",-------------------------空中单体技能	33
	"37_ji2",-------------------------空中一列技能	34
	"38_ji3",-------------------------空中横排技能	35
	"39_ji4",-------------------------空中全体技能	36
	"40_ji5",-------------------------空中加血技能	37
	"13_jueji",-----------------------绝技攻击		38
	"29_daodi",-----------------------浮空倒地		39
}

effectAnimations = {
	"animation",
	"animation2",
	"animation3",
}


npcAnimationsNew = {
	"animation1",
	"animation2",
	"animation3",
	"animation4",
	"animation5",
	"animation6",
	"animation7",
	"animation8",
	"animation9",
	"animation10",
}

npcAnimations = {
	"animation_standby",
	"animation_click",
}

---------------------------------------合体技图标的动画参数
fight_heti_icon_precent = {
	"0,0",
	"0.9,22",
	"1,42",
	"0.85,68",
	"0,0",
}

-- talking data app_id
jttd_app_id = "C042F20ACC52530B739322FCCBABC000"

-- 七日活动奖励的忍者信息
_seven_day_activity_reward_hero_ids = {
    232, -- 韦陀
    364, -- 烈阳神 
    485, -- 剑魔连城
    573, -- 金鹏
}

-- 龙虎门的项目中添加镜头的控制参数(人物横向间距，人物纵向间距，背景缩放比例，远景缩放比例，地表缩放比例，近景缩放比例)
_camera_controller = {
	--{_half_width = 400, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1, _far_view_scale=1.199578, _earth_view_scale=1.498681, _near_view_scale=1.996485}, ----------角色150%
	--{_half_width = 560, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1, _far_view_scale=1.110459, _earth_view_scale=1.248352, _near_view_scale=1.425345}, ----------角色125%
	--{_half_width = 640, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.1, _far_view_scale=1.044118, _earth_view_scale=1.092308, _near_view_scale=1.145161}, --------角色110%
	--{_half_width = 660, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.09, _far_view_scale=1.036496, _earth_view_scale=1.075758, _near_view_scale=1.118110}, -------角色107.5%
	--{_half_width = 680, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.08, _far_view_scale=1.024346, _earth_view_scale=1.049908, _near_view_scale=1.076777}, -------角色105%
	--{_half_width = 700, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.07, _far_view_scale=1.012478, _earth_view_scale=1.025271, _near_view_scale=1.038391}, -------角色102.5%
	--{_half_width = 720, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.06, _far_view_scale=1.000000, _earth_view_scale=1.000000, _near_view_scale=1.000000}, ---------角色100%
	--{_half_width = 880, _half_height = 360, _move_height=240*1.25, _width = 2272, _height = 1280, _background_scale=1.05, _far_view_scale=0.922827, _earth_view_scale=0.856712, _near_view_scale=0.799437}, ---------角色85%
	--{_half_width = 1040, _half_height = 580, _move_height=240*1.00, _width = 2272, _height = 1280, _background_scale=1.04, _far_view_scale=0.856712, _earth_view_scale=0.749340, _near_view_scale=0.665885}, --------角色75%
	{_half_width = 720, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.06, _far_view_scale=1.000000, _earth_view_scale=1.000000, _near_view_scale=1.000000}, ---------角色100%
	{_half_width = 880, _half_height = 360, _move_height=240*1.25, _width = 2272, _height = 1280, _background_scale=1.05, _far_view_scale=0.922827, _earth_view_scale=0.856712, _near_view_scale=0.799437}, ---------角色85%
	{_half_width = 1040, _half_height = 580, _move_height=240*1.00, _width = 2272, _height = 1280, _background_scale=1.04, _far_view_scale=0.856712, _earth_view_scale=0.749340, _near_view_scale=0.665885}, --------角色75%
	{_half_width = 1200, _half_height = 600, _move_height=240*0.75, _width = 2272, _height = 1280, _background_scale=1.03, _far_view_scale=0.798875, _earth_view_scale=0.665105, _near_view_scale=0.569709}, --------角色66%
	{_half_width = 1360, _half_height = 820, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.02, _far_view_scale=0.748353, _earth_view_scale=0.597895, _near_view_scale=0.497809}, --------角色60%
	{_half_width = 1680, _half_height = 820, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.01, _far_view_scale=0.666667, _earth_view_scale=0.500000, _near_view_scale=0.400000}, --------角色50%
	{_half_width = 2272, _half_height = 1280, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.1, _far_view_scale=0.666667, _earth_view_scale=0.500000, _near_view_scale=0.400000}, --------角色50%
}

-- 战斗控制参数
_battle_controller = {
	_role_movd_smallest_distance = 10, --角色发动攻击需要移动到目标点时，与目标点距离大于此像素才调用移动动作，否则直接发动攻击
	_draw_hit_damage_duration = 2, --绘制连击数的等待时间(秒)
	_melee_hit_distance = 2, --1格为80像素，此距离表示多少格1就是1格，0.5就是半格
	_random_move_time = {0.0, 0.0, 0.0, 0.0}, --同时出手随机值(用于拉开攻击时间差)
	_explode_effice_id = 777, --终结一击炸开光效的ID
	_dead_effice_id = 199, --角色死亡光效的ID
	_vertigo_effice_id = -1, -- 52, --角色眩晕光效的ID
	_invincible_effice_id = -1, -- 54, --角色无敌，增加防御光效的ID
	_burn_effice_id = -1, -- 51, --角色燃烧光效的ID
	_poisoning_effice_id = -1, -- 53, --角色中毒光效的ID
	_back_jump_distance = 160, --闪避时后跳的距离(像素)
	_back_base_pos_distance = 560,--被击方剩余阵营区域范围
	_back_base_pos_cell_distance = 240,--多段返回出生点的距离
	_back_base_pos_wait_time = 0.1,--多段返回出生点的等待时间(秒)
	_camp_space = 120,--阵营间的间距
	_camp_attack_space = 160,--角色攻击的活动间距
	_back_base_pos_start_min_wait_time = 100,--战斗开始时移动启动的随机时间最小值(毫秒)
	_back_base_pos_start_max_wait_time = 500, --战斗开始时移动启动的随机时间最大值(毫秒)
	_back_base_pos_moving_min_wait_time = 100,--战斗中时移动启动的随机时间最小值(毫秒)
	_back_base_pos_moving_max_wait_time = 100,--战斗中时移动启动的随机时间最大值(毫秒)
	_shadow_max_height = 300,--投影最大显示高度，到达这个高度会全透明显示
	_shadow_max_proportion = 50,--投影的最大放大比例(%)，到达最高点会放大到这个比例
	_air_pursuit_min_height = 50,--空中追击最低高度限制，目标超过此高度才会调用25，26空中攻击动作
	_air_hurt_min_height = 10,--浮空被击动作调用的最低高度限制，目标超过此高度才会调用空中被击动作
	_air_pursuit_change_posX = 0,--空中追击，追击者位置修正偏移值(X)
	_air_pursuit_change_posY = 0,--空中追击，追击者位置修正偏移值(Y)
	_byattck_flight_height = 1000,--------浮空高度上限(基于出生点)
	_byattck_flight_width = 200,--------击飞距离上限(基于出生点)
	_screen_scale_min = 0.8,------------------镜头拉远最大限制(地图大小：100%=1，80%=0.8)
	_solid_position = {fwin._height / 2, fwin._height / 4, 0}, ---------------镜头缩放的基准点(左上,中，左下)
	_rebound_distance = 0,--------------------------版边反弹距离
}


-- 跑动距离与速度控制
_run_controller = {
	{_run_distance = 0 , _run_time = 0.0}, --单位：像素，秒
	{_run_distance = 40, _run_time = 0.2}, --单位：像素，秒
	{_run_distance = 60, _run_time = 0.22}, --单位：像素，秒
	{_run_distance = 80, _run_time = 0.24}, --单位：像素，秒
	{_run_distance = 100, _run_time = 0.26}, --单位：像素，秒
	{_run_distance = 120, _run_time = 0.28}, --单位：像素，秒
	{_run_distance = 140, _run_time = 0.30}, --单位：像素，秒
	{_run_distance = 160, _run_time = 0.32}, --单位：像素，秒
	{_run_distance = 180, _run_time = 0.34}, --单位：像素，秒
	{_run_distance = 200, _run_time = 0.36}, --单位：像素，秒
	{_run_distance = 220, _run_time = 0.38}, --单位：像素，秒
	{_run_distance = 240, _run_time = 0.40}, --单位：像素，秒
	{_run_distance = 260, _run_time = 0.42}, --单位：像素，秒
	{_run_distance = 280, _run_time = 0.44}, --单位：像素，秒
	{_run_distance = 300, _run_time = 0.46}, --单位：像素，秒
	{_run_distance = 320, _run_time = 0.48}, --单位：像素，秒
	{_run_distance = 340, _run_time = 0.50}, --单位：像素，秒
	{_run_distance = 360, _run_time = 0.52}, --单位：像素，秒
	{_run_distance = 380, _run_time = 0.54}, --单位：像素，秒
	{_run_distance = 400, _run_time = 0.56}, --单位：像素，秒
	{_run_distance = 99999, _run_time = 0.56}, --单位：像素，秒
}


-- 所有tip信息内容
_All_tip_string_info = {
	_warriorName = "忍者",
	_energyName = "體力", -- 体力
	_fuelName = "精力", --精力/精力
	_fundName = "銅幣",
	_crystalName = "金幣",
	_fetterName = "羈絆",
	_decomposeName = "回收",
	_rebirthName = "退化",
	_wrestleName = "演武場",
	_recruitPropName = "普通招募書",
	_expPropName = "金經驗獸",
	_fuelPropName = "體力丸",
	_expName = "隊伍經驗",
	_reputation = "演武幣",
	_equip = "裝備",
	_treasure = "寶物",
	_glories = "試煉幣",
	_soulName = "天賦點",
	_destiny = "晶片",--天命
	_hero = "天賦點",
	_exploit = "試煉幣",
	_union_exploit = "組織幣",
	_winName= "勝點",
	_integralName= "積分",
	_arena= "擂臺賽獎勵",
	_juexingsuipian = "覺醒碎片",
	_matrix_essence = "手印碎片",
	_skinName = "分支進化",
	_explore_money = "探索幣",
	_holy_essence = "寶物精華",
}


--------------资源获取途径
user_resource_info = {
	_silver_to_get_index = {306,307,308,309,310},----------------铜币
	_reputation_to_get_index = {125},------------声望
	_glories_to_get_index = {126},---------------荣誉
	_soul_to_get_index = {123,124},------------------兽魂
	_exploit_to_get_index = {127},---------------战功
	_hero_to_get_index = {306,307,308,309,310},------------------将魂
}


-- 月卡显示信息
_month_card_tip = {
	"立即獲得%d金幣，連續%d天每天可領取%d金幣%s！",
	"每天可領取%d金幣%s，剩餘%d天",
	"恭喜您購買%d圓月卡成功！\r\n每日都可以領取免費資源喲！",
	"領取成功，恭喜您獲得%d金幣%s！",
}

-- 所有tip信息内容描述
_All_tip_string_info_description = {
	_warriorNameDescription = "忍者",
	_divineNameDescription = "靈異探險",
	_energyNameDescription = "挑戰關卡需要消耗體力",
	_fuelNameDescription = "精力",
	_fundNameDescription = "遊戲中的主要貨幣",---------------------------------【数码宝贝】铜币描述
	_crystalNameDescription = "世間萬物皆可明碼標價",------------------------------【数码宝贝】金币描述
	_soulJadeNameDescription = "分解忍者可獲得獸魂，可在神祕商店兌換稀有道具",---------------将魂描述
	_steelSoulNameDescription = "獸魂",
	_strengthNameDescription = "物防",
	_defenseNameDescription = "術防",
	_fetterNameDescription = "羈絆",
	_decomposeNameDescription = "回收",
	_rebirthNameDescription = "退化",
	_wrestleNameDescription = "演武場",
	_machineryPagodaNameDescription = "地獄之門",
	_duelNameDescription = "決鬥",
	_silverBossNameDescription = "黃金大虛",
	_recruitLevelOneDescription = "普通招募",
	_recruitLevelTwoDescription = "高級招募",
	_recruitLevelThreeDescription = "陣營招募",
	_recruitPropNameDescription = "普通招募書",
	_expPropNameDescription = "金經驗獸",
	_fuelPropNameDescription = "體力丸",
	_expNameDescription = "隊伍經驗",
	_reputationDescription = "演武場獲得，用於演武商店購買道具",----------------【数码宝贝】竞技币描述
	_equipDescription = "裝備",
	_treasureDescription = "寶物",
	_gloriesDescription = "忍者試煉獲得，用於試煉商店購買道具",-----------------------【数码宝贝】试炼币描述
	_lackHeadtip= "缺少上陣忍者！",
	_equip= "分解裝備可獲得榮譽，可在裝備商店兌換稀有道具",
	_exploitDescription= "光丘守護後可獲得功勳，用於在戰功商店進行消費",
	_unionDescription= "用於在組織商店兌換資源",
	_winNameDescription= "通過跨服擂臺賽獲得，可在勝點商店兌換稀有忍者和道具",-----------------------胜点描述
	_integralNameDescription= "通過跨服擂臺賽獲得，可在積分商店兌換稀有忍者和道具",-----------------------积分描述
	_arenaDescription= "打開有驚喜！",-----------------------擂台赛奖励描述
	_talentPointTip= "可用於提升天賦等級",-----------------------【数码宝贝】天赋点描述
	_vipExpDescription = "用於提升VIP等級",----------------------【数码宝贝】VIP经验描述
	_mineralDescription = "跨服資源戰特定產出資源，可用於稀有資源的購買",----------------------【数码宝贝】矿石描述
	_AwakeningDebrisDescription = "每開啟一個武器寶箱可獲得1個覺醒碎片，可在覺醒碎片兌換活動中兌換其他道具。",----------------------【数码宝贝】觉醒碎片描述
	_AlloyMatrixJHDescription = "手印分解後得到，用於升級手印.",----------------------【数码宝贝】合金精华
	_explore_money_description = "用於探索商店兌換道具",----------------------【数码宝贝】探索币
	_holy_essence_description = "用於檔島中的冒險家寶物養成，可以提升玩家能力",----------------------【数码宝贝】圣物精华
}
--数码魂
_supernaturalSoul = "分解躍遷道具可獲得忍者魂，可在躍遷商店兌換躍遷道具"


-- VIP特权说明文字
_vip_privilege_info = {
	privilege_one = "累計儲值%|1|60%金幣即可享受該特權\r\nV1首儲大禮包：%|1|升級禮包%\r\n每天可購買體力%|1|3%次\r\n每日可使用搖錢之術%|1|5%次\r\n每天重置精英關卡次數%|1|1%次,",
	privilege_two = "累計儲值%|1|300%金幣即可享受該特權\r\nV2超值大禮包：%|1|裝備鑰匙（有機會獲得稀有裝備材料）%\r\n可以啟動%|1|月卡%福利，啟動後能在每日活動中領取%|1|100金幣福利（31天）%\r\n每天可購買體力%|1|4%次\r\n每日可使用搖錢之術%|1|7%次\r\n每天重置精英關卡次數%|1|2%次\r\n包含V1所有內容,",
	privilege_three = "累計儲值%|1|600%金幣即可享受該特權\r\nV3超值大禮包：%|1|16資質宇智波鼬%\r\n%|1|技能點恢復時間降至1分鐘/點%\r\n每日體力購買次數：%|1|5%\r\n每日搖錢樹次數：%|1|9%\r\n精英副本重置次數：%|1|2%\r\n解鎖戰鬥速度%|1|x4%\r\n包含V2所有獎勵",
	privilege_four = "累計儲值%|1|1000%金幣即可享受該特權\r\nV4超值大禮包：%|1|16資質宇智波鼬專屬指環、專屬卷軸%\r\n可啟動%|1|金幣月卡%，啟動後可在每日任務中領取%|1|100金幣（31天）%\r\n%|1|開啟主線副本掃蕩10次%\r\n每日體力購買次數：%|1|6%\r\n每日搖錢樹次數：%|1|12%\r\n精英副本重置次數：%|1|2%\r\n戰鬥外遊戲速度%|1|x1.25%（可在設定中關閉）\r\n包含V3所有獎勵",
	privilege_five = "累計儲值%|1|2000%金幣即可享受該特權\r\nV5超值大禮包：%|1|16資質宇智波鼬碎片%\r\n開啟每日任務：%|1|返利（金幣返利）%\r\n每日體力購買次數：%|1|7%\r\n每日搖錢樹次數：%|1|16%\r\n精英副本重置次數：%|1|3%\r\n%|1|開啟演武跳過戰鬥功能，無冷卻時間%\r\n%|1|開啟研究所至尊捐獻%\r\n包含V4所有獎勵",
	privilege_six = "累計儲值%|1|3000%金幣即可享受該特權\r\nV6超值大禮包：%|1|16資質宇智波鼬專屬武器%\r\n%|1|開啟主線副本掃蕩50次%\r\n%|1|演武戰敗積分+2%\r\n每日體力購買次數：%|1|8%\r\n每日搖錢樹次數：%|1|20%\r\n精英副本重置次數：%|1|3%\r\n解鎖戰鬥速度%|1|x5%\r\n包含V5所有獎勵",
	privilege_seven = "累計儲值%|1|5000%金幣即可享受該特權\r\nV7超值大禮包：%|1|17資質死門 - 凱碎片%\r\n%|1|忍者試煉積分+10％%\r\n每日體力購買次數：%|1|9%\r\n每日搖錢樹次數：%|1|25%\r\n精英副本重置次數：%|1|3%\r\n包含V6所有獎勵",
	privilege_eight = "累計儲值%|1|7000%金幣即可享受該特權\r\nV8超值大禮包：%|1|17資質死門 - 凱專屬指環和卷軸%\r\n開啟每日任務：每日體力購買次數：%|1|10%\r\n每日搖錢樹次數：%|1|30%\r\n精英副本重置次數：%|1|3%\r\n演武戰鬥冷卻時間降至%|1|2%分鐘\r\n開啟每日任務%|1|每日禮物：武器寶箱鑰匙*1%\r\n戰鬥外遊戲速度%|1|x1.5%（可在設定中關閉）\r\n包含V7所有獎勵",
	privilege_nine = "累計儲值%|1|10000%金幣即可享受該特權\r\nV9超值大禮包：%|1|17資質死門 - 凱碎片和培養材料%\r\n%|1|技能點恢復時間：5秒/點%\r\n每日體力購買次數：%|1|11%\r\n每日搖錢樹次數：%|1|35%\r\n精英副本重置次數：%|1|3%\r\n包含V8所有獎勵",
	privilege_ten = "累計儲值%|1|15000%金幣即可享受該特權\r\nV10超值大禮包：%|1|17資質死門 - 凱專屬武器%\r\n%|1|戰隊等級達到Lv.40時，開啟忍者試煉跳過72層功能%\r\n每日體力購買次數：%|1|12%\r\n每日搖錢樹次數：%|1|40%\r\n精英副本重置次數：%|1|4%\r\n開啟每日任務%|1|每日禮物：天賦點魔盒*1%\r\n解鎖戰鬥速度%|1|x6%\r\n包含V9所有獎勵",
	privilege_eleven = "累計儲值%|1|20000%金幣即可享受該特權\r\nV11超值大禮包：%|1|17資質死門 - 凱碎片和禮物%\r\n%|1|每日搖錢樹次數：50%\r\n精英副本重置次數：%|1|4%\r\n包含V10所有獎勵",
	privilege_twelve = "累計儲值%|1|30000%金幣即可享受該特權\r\nV12超值大禮包：%|1|17資質六道仙人 - 斑%\r\n%|1|忍者試煉積分+15％%\r\n每日體力購買次數：%|1|14%\r\n每日搖錢樹次數：%|1|60%\r\n精英副本重置次數：%|1|4%\r\n包含V11所有獎勵",
	privilege_thirteen = "累計儲值%|1|60000%金幣即可享受該特權\r\nV13超值大禮包：%|1|17資質六道仙人 - 斑碎片、專屬指環、專屬卷軸%\r\n%|1|戰隊等級達到Lv.40時，開啟忍者試煉跳過74層功能%\r\n每日體力購買次數：%|1|15%\r\n每日搖錢樹次數：%|1|80%\r\n精英副本重置次數：%|1|5%\r\n 演武戰鬥冷卻時間降至%|1|1%分鐘\r\n開啟每日任務%|1|每日禮物：通靈契約*20%\r\n包含V12所有獎勵",
	privilege_fourteen = "累計儲值%|1|120000%金幣即可享受該特權\r\nV14超值大禮包：%|1|17資質六道仙人 - 斑專屬武器%\r\n%|1|忍者試煉積分+30％%\r\n每日體力購買次數：%|1|16%\r\n每日搖錢樹次數：%|1|100%\r\n精英副本重置次數：%|1|5%\r\n包含V13所有獎勵",
	privilege_fifteen = "累計儲值%|1|200000%金幣即可享受該特權\r\nV15超值大禮包：%|1|高級萬能碎片和17資質六道仙人 - 斑專屬忍具%\r\n%|1|每日體力購買次數：17%\r\n每日搖錢樹次數：%|1|160%\r\n精英副本重置次數：%|1|5%\r\n包含V14所有獎勵",
	privilege_sixteen = "累計儲值%|1|300000%金幣即可享受該特權\r\nV16超值大禮包：%|1|各類17資質自選箱%\r\n%|1|戰隊等級達到Lv.40時，開啟忍者試煉跳過76層功能%\r\n開啟每日任務%|1|每日禮物：高級萬能碎片*1%\r\n包含V15所有獎勵",
	privilege_seventeen = "累計儲值%|1|500000%金幣即可享受該特權\r\nV17超值大禮包：%|1|大量金幣和鑽石禮物%\r\n開啟每日任務%|1|每日禮物：高級萬能碎片*2%\r\n包含V16所有獎勵",
	privilege_eighteen = "累計儲值%|1|800000%金幣即可享受該特權\r\nV18超值大禮包：%|1|大量金幣和鑽石禮物%\r\n %|1|戰隊等級達到Lv.40時，開啟忍者試煉跳過78層功能%\r\n包含V17所有獎勵",
	privilege_nineteen = "累計儲值%|1|1500000%金幣即可享受該特權\r\nV19超值大禮包：%|1|宇智波斑 - 土遁穢土轉生（巔峰）%\r\n 包含VIP 18特權及以下內容，",
	privilege_twenty = "累計儲值%|1|2000000%金幣即可享受該特權\r\nV20超值大禮包：%|1|宇智波斑 - 土遁穢土轉生（巔峰）專屬武器%\r\n 包含VIP 19特權及以下內容，",
}

-- 分解界面说明文字
_Decompose_tip_info = "1.點擊“+”進入選擇介面，每次可最多選擇5個忍者、裝備、寶物或時裝進行分解。\r\n2.只可分解4星及以上未成長的忍者，分解後返還所有升級花費並獲得獸魂。\r\n3.可分解3星和4星裝備，分解後返還所有升級花費並獲得覺醒書。\r\n4.可分解5星裝備，分解後返還所有升級花費並獲得橙裝鑄造材料。\r\n5.只可分解5星寶物，分解後可獲得靈氣精華並返還所有強化經驗(返還的經驗在分解獲得的藍色經驗寶物中)\r\n6.分解時裝可獲得時裝精華\r\n7.分解後，所分解的忍者、裝備、寶物或時裝將會消失。"


-- 退化界面说明文字
_Regeneration_tip_info = "1.點擊“+”進入選擇介面，每次只可選擇1個忍者、裝備、寶物或時裝進行退化。\r\n2.可退化強化等級在2級及以上的4星忍者和5星忍者，退化後返還所有花費(成長所消耗的銅幣不返還)，退化後的忍者恢復成長等級為0階，強化等級為1級。\r\n3.可退化6星忍者，退化後變為5星+7，等級不變，並返還成長和橙色成長所消耗的所有銅幣及材料。\r\n4.只可退化5星且強化等級大於0的裝備，退化後返還所有強化費用，並根據洗煉屬性返還覺醒書。\r\n5.只可退化強化等級大於0的時裝，退化後返還所有強化費用和時裝精華。\r\n6.只可退化4星及以上，強化過的寶物，退化後返還所有升級花費，並根據寶物等級返還經驗寶物和覺醒寶物\r\n7.每次退化需要花費一定銅幣。"


-- 灵异探险界面的说明文字
_Divine_explain_tip_info = "1.點亮靶心圖表案上的所有圖案或點擊任何圖案都可以獲得星數獎勵。\r\n\r\n2.通過獲得的星數可兌換獎勵，星數越多兌換的獎勵越多。\r\n\r\n3.每日淩晨0點重置探險次數、當前星數及獎勵。"

-- 限时队长级说明文字
_Limited_hero_tip_info = "1.在活動介面中使用免費抽取或者銅幣抽取忍者即可獲得10積分。\r\n2.每累積獲得150積分，即可獲得1次免費銅幣抽取次數。\r\n3.每次抽取可隨機獲得4星或5星忍者，5星忍者中包含限時活動忍者。\r\n4.活動結束時，根據積分排名，將會發放排名獎勵。\r\n5.玩家每達到1000積分時必定抽中當前限時隊長。\r\n6.積分達到60分的玩家將額外獲得：10個金經驗獸，銅幣20萬，500個成長石(該獎勵與排名獎勵可同時獲得)\r\n活動結束的當天內獎勵即會發放，通過獎勵中心領取。"

-- 超级变变变说明文字(限时兑换)
_Super_change_tip_info = "1.活動期間內，玩家可使用指定的物品進行兌換，獲得新的物品；\r\n2.可使用未強化過的裝備或寶物進行兌換；\r\n3.兌換後會失去原有物品並獲得兌換後的新物品。"

-- 分段折扣说明文字
_Divide_sell_tip_info = "1.活動期間根據全服購買的指定道具數量對該道具進行打折。\r\n2.當指定道具消耗數量達到指定數量時，商店內出售的該道具價格也將相應的發生變化。\r\n"

-- 跨服幸运大转盘说明文字
_Luck_turntable_tip_info = "1.活動期間使用免費或銅幣轉動幸運大轉盤都可獲得1積分，活動結束後會根據積分排名發放對應獎勵；\r\n2.免費次數不會累加，免費次數使用後12小時會恢復；\r\n3.活動期間使用免費或銅幣轉動幸運大轉盤都會增加一點次數獎勵進度條，達到對應次數可立刻領取獎勵；\r\n4.每天有5次免費刷新機會可刷新轉盤上的獎勵，免費次數用完後可使用銅幣刷新，當玩家抽中高級道具時會強制刷新轉盤；\r\n5.免費刷新或使用銅幣刷新都有機會刷出高級限量道具(限量道具售光後無法再刷出)；\r\n6.免費轉動或使用銅幣轉動幸運大轉盤都有機會獲得幸運大獎；\r\n7.系統會將玩家轉動轉盤消耗的銅幣按一定比例累加到幸運大獎獎池，累加無上限；\r\n8.當玩家轉到幸運大獎後，將會獨得獎池內一定比例的銅幣大獎；\r\n9.幸運大轉盤資料所有伺服器互通。"

-- 灵王宫说明文字
_spirite_palace_tip_info = "1.每天可獲得一次免費重置機會(不可累加)；\r\n2.靈王宮共有五層，每層達到可移動次數上限後就出現下一層入口，達到第五層終點即完成本輪探險；\r\n3.點擊岔道口的事件圖示可以查看事件說明，點擊移動可觸發該事件，或直接點擊下方箭頭進行移動；\r\n4.每觸發一個事件都會獲得一定的積分，積分可在靈王宮商店兌換道具；\r\n5.每次移動都會消耗1點行動力，行動力為0時不可再移動；\r\n6.首次進入靈王宮或重置後，會根據玩家當前陣容確定當前探險陣型，探險陣型一旦確定，本次探險過程中將無法進行改變；\r\n7.首次進入靈王宮或重置後，會根據玩家當前陣容所有忍者生命之和的三倍生成一條血槽，玩家在探險過程中會遭遇戰鬥，戰鬥結束後會根據忍者的損血量消耗血槽進行補充，如果血槽降到0便無法繼續探險。"

-- 跨服战说明文字
_cross_server_tip_info = "【更新戰鬥資訊】\r\nA)戰鬥資訊\r\n是指跟玩家戰鬥相關的資料，即上陣忍者、裝備、鬼道、陣型等所有可以影響玩家戰鬥強弱的相關資訊。\r\nB)更新戰鬥資訊\r\n玩家每次變動戰鬥資訊後需要點擊“更新戰鬥資訊”來向跨界爭霸戰遊戲伺服器上傳最新的戰鬥資訊，否則遊戲伺服器上的玩家戰鬥資訊不會改變。\r\n【跨界爭霸戰規則】\r\nA)先手規則\r\n戰鬥力高的玩家為先手\r\nB)海選賽規則\r\n1、瀞靈廷組海選賽規則\r\n1)隨機分配對手，每場1局，每場間隔10分鐘\r\n2)玩家不會再遇到已出局的對手\r\n3)如果玩家累積失敗3場則被淘汰出局，直至決出最後32強\r\n4)玩家可以在我的資訊中“我的戰績”處查看自己的戰績\r\n2、流魂街組海選賽規則\r\n1)瀞靈廷組海選賽結束後，去除瀞靈廷組出線的選手，其他玩家進行流魂街組海選賽\r\n2)隨機分配對手，每場1局，每場間隔10分鐘\r\n3)玩家不會再遇到已出局的對手\r\n4)如果玩家累積失敗3場則被淘汰出局，直至決出最後32強，海選結束\r\n5)玩家可以在我的資訊中“我的戰績”處查看自己的戰績\r\nC)晉級賽規則\r\n1、海選賽出線的瀞靈廷32強和流魂街32強分成16組，以每組2人進行5局3勝的比賽，獲得3場勝利的玩家晉級，每局間隔20分鐘\r\n2、每場晉級賽間隔1天\r\n3、瀞靈廷組和流魂街組分別決出各自組的冠軍\r\n4、進入晉級賽的玩家自動進入跨服跨界爭霸賽的海選\r\n【跨服跨界爭霸賽規則】\r\nA)先手規則\r\n戰鬥力高的玩家為先手\r\nB)海選賽規則\r\n1、瀞靈廷組海選賽規則\r\n1)隨機分配對手，每場1局，每場間隔10分鐘\r\n2)玩家不會再遇到已出局的對手\r\n3)如果玩家累積失敗3場則被淘汰出局，直至決出最後32強\r\n4)玩家可以在我的資訊中“我的戰績”處查看自己的戰績\r\n2、流魂街組海選賽規則\r\n1)瀞靈廷組海選賽結束後，去除瀞靈廷組出線的選手，其他玩家進行流魂街組海選賽\r\n2)隨機分配對手，每場1局，每場間隔10分鐘\r\n3)玩家不會再遇到已出局的對手\r\n4)如果玩家累積失敗3場則被淘汰出局，直至決出最後32強，海選結束\r\n5)玩家可以在我的資訊中“我的戰績”處查看自己的戰績\r\nC)晉級賽規則\r\n1、海選賽出線的瀞靈廷32強和流魂街32強分成16組，以每組2人進行5局3勝的比賽，獲得3場勝利的玩家晉級，每局間隔20分鐘\r\n2、每場晉級賽間隔1天\r\n3、瀞靈廷組和流魂街組分別決出各自組的冠軍\r\n4、跨服跨界爭霸賽瀞靈廷組冠軍所在伺服器所有玩家可獲得禮包獎勵\r\n【助威規則】\r\n晉級賽階段，每場晉級賽玩家只可為1名玩家助威，被助威的玩家如果進入下一輪比賽，則助威的玩家可獲得助威獎勵。每場晉級賽結束後發放助威獎勵，當獎勵發放完畢後，可進行下一場晉級賽的助威。"

-- 副队长说明文字
_vice_captain_tip_info = "1.上陣中的副隊長，每隔一段時間獲得一定經驗；\r\n2.只有上陣中的副隊長纔可進行出戰操作，出戰的副隊長可在戰前將自身技能屬性提供給上陣忍者；\r\n3.一次只能出戰一名副隊長；\r\n4.培養可增加副隊長經驗，當副隊長升到一定等級時可獲得技能點；\r\n5.技能點可用來開啟技能槽、領悟技能、升級技能。"

--侵略者帮助奖励文字
_betray_army_reward_tip_info = "1.光丘守護可獲得功勳獎勵，主要是大量銅幣、晶片石和橙色經驗寶物。\r\n2.光丘守護還可獲得戰功，戰功可在戰功商店購買稀有忍者和晶片石。"

--侵略者帮助功勋文字
_betray_army_exploit_tip_info = "1.35級後，每次挑戰主線副本和精英副本都有概率發現侵略者，可以單獨或邀請好友一起光丘守護。\r\n2.每次光丘守護會獲得功勳值，傷害越高功勳值越多，忍者每成長+1對侵略者傷害提升2.5倍！\r\n3.若擊殺侵略者，發現侵略者的玩家和給予最後一擊的玩家都可獲得銅幣獎勵。"

--侵略者帮助战功文字
_betray_army_credit_tip_info = "1.攻打侵略者時，每消耗一個挑戰書，都可獲得50戰功。\r\n2.若進入光丘守護的每日功勳榜和每日傷害榜前200名，還可獲得額外的排名戰功獎勵。\r\n3.每天12:00-14:00怒攻只消耗1個挑戰書，18:00-20:00攻打侵略者功勳翻倍。"

--组织资源抢夺帮助信息
_capture_resource_tip_info = "1.擊敗建築守衛者可佔領該建築，並可獲得資源產出獎勵；\r\n2.每名玩家可同時佔領多個建築，相鄰的建築可獲得資源產出加成；\r\n3.每個建築有對應的佔領條件，佔領建築的陣容為臨時組建陣容，跟原有陣容相互獨立；\r\n4.可派出原陣容中已上陣的忍者，不會計算裝備和寶物屬性，緣分會按照新的上陣情況重新計算；\r\n5.佔領成功後，所派出的忍者將成為建築守衛，不可中途更換；\r\n6.攻打建築或佔領建築可獲得積分，每週二和每週五中午12點會根據積分排名發放獎勵，並清空積分；\r\n7.攻打建築無論勝利失敗可獲得5積分，佔領建築後每分鐘可獲得1積分(佔領結束時根據佔領時間獲得)；\r\n8.排名獎勵需要玩家自行進入獎勵頁面領取，獎勵會保存到下一次排行結算，結算時會刪除未領取的獎勵(積分為0的玩家無法獲得獎勵)。"

---组织战帮助信息
_union_fight_tip_info = "報名階段：\r\n1.週三3點開啟報名；\r\n2.加入組織48小時的成員才能參與組織戰；\r\n3.組織戰為跨服戰鬥，會根據組織戰力匹配對手。\r\n\r\n準備階段：\r\n1.週四3點開啟準備階段；\r\n2.首領和副首領可部署防守陣型；\r\n3.組織成員在前後城各擁有一個防守格；\r\n4.暗格在被攻擊前處於資訊不明狀態。\r\n\r\n戰鬥階段：\r\n1.週五3點開啟戰鬥，22點結算戰鬥；\r\n2.每人3次嘗試進攻機會，2次擊殺次數；\r\n3.守衛為1的據點進入【失守】狀態，可被通過；\r\n4.守衛為0的據點進入【攻陷】狀態，可取得積分；\r\n5.特殊據點包含額外獎勵，攻陷該據點後可領取；\r\n6.結算時積分高的組織獲勝，如果積分相同，戰力低的組織獲勝；\r\n7.勝利或失敗的組織都會獲得獎勵，失敗的獎勵是勝利的一半。"


_emailTypeAllTip = {			--记录邮件的类型
	"演武場被擊敗排名下降",
	"演武場成功防守",
	"演武場排名獎勵",
	"演武場幸運排名獎勵",
	"決鬥被擊敗",
	"決鬥排名獎勵",
	-- "抢夺",
	-- "演武场被击败排名不变",
	-- "好友申请",
	"好友已同意",
	"好友已拒絕",
	-- "好友断绝",
	-- "好友留言",
	-- "好友被通过",
	-- "好友被拒绝",
	-- "充值成功",
	-- "VIP",
	"組織已通過",
	"組織被拒絕",
	"被組織踢出",
	-- "演武场排名奖励",
	-- "演武场幸运排名奖励",
	-- "决斗排名奖励",
	"演武場被擊敗排名不變",
	"資源礦到期",
	"資源礦協助",
	"資源礦搶奪",
	"",
	"資源礦搶奪失敗",
	"資源礦搶奪成功",
	"資源礦防守成功",
	"資源礦防守失敗",
	"資源礦到期",
}

_emailTypeFriendTip = {		
	"好友申請",
	"好友已同意",
	"好友已拒絕",
	"好友斷絕",
	"好友留言",
	"好友被通過",
	"好友被拒絕",
}

_emailTypeFightTip = {		
	"演武場被擊敗排名下降",
	"演武場成功防守",
	--"演武场排名奖励",
	--"演武场幸运排名奖励",
	"決鬥被擊敗",
	--"决斗排名奖励",
	"搶奪",
	"演武場被擊敗排名不變",
}

_emailTypeSystemTip = {
	"儲值成功",
	"VIP",
	"組織已通過",
	"組織被拒絕",
	"被組織踢出",
	"演武場排名獎勵",
	"演武場幸運排名獎勵",
	"決鬥排名獎勵",
}
		
_emailTimeDraw = {
	"今天",
	"1天前",
	"2天前",
	"3天前",
	"4天前",
	"5天前",
	"6天前",
	"7天前",
	"8天前",
	"9天前",
	"10天前",
	"11天前",
	"12天前",
	"13天前",
	"14天前",
}

-- 游戏中功能未开启的提示信息
_function_unopened_tip_string = "功能暫未開啟"
_unopened_tip = "未開啟"
_opened_tip = "開啟"
_wait_open_tip = "即將開放"

--向性, 0无,1魏,2蜀,3吴,4群
heroCamp = {
	"無",
	"疫苗",
	"數據",
	"病毒",
	"其他",
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
string_equiprety_name = {
	"生 命:",--0(固定值)
	"攻 擊:",--1(固定值)
	"防 禦:",--2(固定值)
	"術防+",--3(固定值)
	"生 命:",--4 百分比
	"攻 擊:",--5 百分比
	"防 禦:",--6 百分比
	"術防+",--7 百分比
	"暴擊率+",--8 百分比
	"抗暴率+",--9 百分比
	"格擋率+",--10 百分比
	"破擊率+",--11 百分比
	"命中率+",--12 百分比
	"閃避率+",--13 百分比
	"物理免傷+",--14 百分比
	"魔法免傷+",--15 百分比
	"治療率+",--16 百分比
	"被治療率",--17 百分比
	"最終傷害+",--18(固定值)
	"最終減傷+",--19(固定值)
	"初始查克拉+",--20(固定值)
	"耐久+",--21(固定值)
	"火力+",--22(固定值)
	"速度+",--23(固定值)
	"物理攻擊+",--24(固定值)
	"魔法攻擊+",--25(固定值)
	"治療值+",--26(固定值)
	"被治療值+",--27(固定值)
	"出血傷害+",--28(固定值)
	"中毒傷害+",--29(固定值)
	"出血免傷+",--30(固定值)
	"中毒免傷+",--31(固定值)
	"經驗+",--32(固定值)
	"最終傷害+",--33 百分比		
	"最終減傷+",--34 百分比	
	"最終減傷+",--35 百分比
	"%",--36 百分比
	"0K",--37
	"00M",--38 
	"K",--39 
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
string_equiprety_name_teo = {
	"生命",--0(固定值)
	"攻擊",--1(固定值)
	"物防",--2(固定值)
	"術防",--3(固定值)
	"生命",--4 百分比
	"攻擊",--5 百分比
	"物防",--6 百分比
	"術防",--7 百分比
	"暴擊率",--8 百分比
	"抗暴率",--9 百分比
	"格擋率",--10 百分比
	"破擊率",--11 百分比
	"命中率",--12 百分比
	"閃避率",--13 百分比
	"物理免傷",--14 百分比
	"魔法免傷",--15 百分比
	"治療率",--16 百分比
	"被治療率",--17 百分比
	"最終傷害",--18(固定值)
	"最終減傷",--19(固定值)
	"初始查克拉",--20(固定值)
	"耐久",--21(固定值)
	"火力",--22(固定值)
	"速度",--23(固定值)
	"物理攻擊",--24(固定值)
	"魔法攻擊",--25(固定值)
	"治療值",--26(固定值)
	"被治療值",--27(固定值)
	"出血傷害",--28(固定值)
	"中毒傷害",--29(固定值)
	"出血免傷",--30(固定值)
	"中毒免傷",--31(固定值)
	"經驗",--32(固定值)
	"最終傷害",--33 百分比		
	"最終減傷",--34 百分比	
	"最終減傷",--35 百分比
	"%",--36 百分比
	"0K",--37
	"00M",--38 
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
--用于附加在取值后面,是显示固定值还是百分比
string_equiprety_name_vlua_type = {
	"",--0(固定值)
	"",--1(固定值)
	"",--2(固定值)
	"",--3(固定值)
	"%",--4 百分比
	"%",--5 百分比
	"%",--6 百分比
	"%",--7 百分比
	"%",--8 百分比
	"%",--9 百分比
	"%",--10 百分比
	"%",--11 百分比
	"%",--12 百分比
	"%",--13 百分比
	"%",--14 百分比
	"%",--15 百分比
	"%",--16 百分比
	"%",--17 百分比
	"",--18(固定值)
	"",--19(固定值)
	"",--20(固定值)
	"",--21(固定值)
	"",--22(固定值)
	"",--23(固定值)
	"",--24(固定值)
	"",--25(固定值)
	"",--26(固定值)
	"",--27(固定值)
	"",--28(固定值)
	"",--29(固定值)
	"",--30(固定值)
	"",--31(固定值)
	"",--32(固定值)
	"%",--33 百分比		
	"%",--34 百分比	
	"%",--35 百分比
	"",--36 百分比
	"",--37
	"",--38 
}

-- 宝物属性类型定义
_influence_type = {
	"生命",--0(固定值)		
	"攻擊",--1(固定值)		
	"物防",--2(固定值)		
	"術防",--3(固定值)		
	"生命",--4 百分比		
	"攻擊",--5 百分比		
	"物防",--6 百分比		
	"術防",--7 百分比		
	"暴擊率",--8 百分比		
	"抗暴率",--9 百分比		
	"格擋率",--10 百分比		
	"破擊率",--11 百分比		
	"命中率",--12 百分比		
	"閃避率",--13 百分比		
	"物理免傷",--14 百分比		
	"魔法免傷",--15 百分比		
	"治療率",--16 百分比		
	"被治療率",--17 百分比		
	"最終傷害",--18(固定值)		
	"最終減傷",--19(固定值)		
	"初始查克拉",--20(固定值)		
	"體質",--21(固定值)		
	"力量",--22(固定值)		
	"靈力",--23(固定值)		
	"物理攻擊",--24(固定值)		
	"魔法攻擊",--25(固定值)		
	"治療值",--26(固定值)		
	"被治療值",--27(固定值)		
	"出血傷害",--28(固定值)		
	"中毒傷害",--29(固定值)		
	"出血免傷",--30(固定值)		
	"中毒免傷",--31(固定值)		
	"經驗",--32(固定值)		
	"最終傷害",--33 百分比		
	"最終減傷",--34 百分比
	"PVP增傷",--35 百分比		
	"PVP減傷",--36 百分比
	"查克拉恢復",--37 (固定值)
}

--奖励物品类型
reward_prop_list = {
	"銅幣",
	"金幣",
	"演武幣",
	"忍者魂",
	"天賦點",
	"道具",
	"裝備",
	"隊伍經驗",
	"精力",
	"功能點",
	"上陣數",
	"體力",
	"忍者",
}

_reward_icon_name = {
	"icon_gold",------------铜币
	"icon_gem",------------金币
	"",------------声望
	"",------------将魂(无用)
	"icon_jianghun",------------兽魂
	"",------------道具
	"",------------装备
	"ext",------------经验
	"icon_immo",------------精力
	"",----------功能点
	"",--------上阵数
	"icon_power",------------体力
	"",------------忍者
}

_equiprety_name = {
	"生命",
	"攻擊",
	"物防",
	"術防",
	"生命",
	"攻擊",
	"物防",
	"術防",
	"暴擊",
	"抗暴",
	"格擋",
	"破擊",
	"命中",
	"閃避",
	"物理免傷",
	"魔法免傷",
	"被治療率",
}

_property = {
	"生命",
	"攻擊",
	"物防",
	"術防",
	"耐久",
	"火力",
	"速度",
}

----

--包裹已满的提示
_pack_fill_tip = {
	propPackTip = "您的道具倉庫已滿",
	treasurePackTip = "您的寶物倉庫已滿",
	equipPackTip = "您的裝備倉庫已滿,請先清理一下吧!",
	equipFragmentPackTip = "您的裝備碎片倉庫已滿",
	heroPackTip = "您的忍者倉庫已滿,請先清理一下吧!",
	fashionPackTip = "您的時裝倉庫已滿",
	ghostPackTip = "您的鬼道倉庫已滿",
	viceCaptainPackTip = "您的副隊長倉庫已滿",
}

-- 字符串拼接数组  -- FLAG!!!!
_string_piece_info = {
	"請選擇伺服器", --------------------------------------------1
	"第",		   	--------------------------------------------2
	"關",			--------------------------------------------3
	"數量",			--------------------------------------------4
	"裝備於",		--------------------------------------------5
	"LV",			--------------------------------------------6
	"武器",			--------------------------------------------7
	"腰帶",			--------------------------------------------8
	"頭盔",			--------------------------------------------9
	"鎧甲",			--------------------------------------------10
	"裝備中",		--------------------------------------------11
	"數量不足",		--------------------------------------------12
	"本次抽中橙色忍者機率X",------------------------------------13
	"倍",-------------------------------------------------------14
	"首次抽取必得紫色忍者",-------------------------------------15
	"等級",-----------------------------------------------------16
	"價格",-----------------------------------------------------17
	"達到VIP4可跳過精英副本戰鬥",-------------------------------18
	"需要通過該關卡後才能跳過！",-------------------------------19
	"達到VIP4可跳過經驗寶物副本戰鬥",---------------------------20
	"達到VIP4可跳過金經驗獸副本戰鬥",---------------------------21
	"5級可使用戰鬥加速",----------------------------------------22
	"5級可使用戰鬥加速",----------------------------------------23
	"請選擇需要出售的裝備",-------------------------------------24
	"您已經選擇出售",-------------------------------------------25
	"個裝備",---------------------------------------------------26
	"總計出售可獲得",-------------------------------------------27
	"銅幣",-----------------------------------------------------28
	"進化", 	------------------------------------------------29	
	"強化等級達到上限", 	------------------------------------30	
	"件效果", 	------------------------------------------------31
	" ", 	----------------------------------------------------32
	"忍者",-----------------------------------------------------33
	"未上榜",---------------------------------------------------34
	"點擊+選擇材料忍者才能升級喔！",----------------------------35
	"您當前沒有藍色以下品質的忍者或經驗忍者，無法添加",---------36
	"緣分",-----------------------------------------------------37
	"天賦",-----------------------------------------------------38
	"忍者說明",-------------------------------------------------39
	"進化+",----------------------------------------------------40
	"級開放",---------------------------------------------------41
	"強化+",----------------------------------------------------42
	"技能",-----------------------------------------------------43
	"資質",-----------------------------------------------------44
	"精煉",-----------------------------------------------------45
	"",-------------------------------------------------------46
	"可啟動緣分+1",---------------------------------------------47
	"2件效果",--------------------------------------------------48
	"3件效果",--------------------------------------------------49
	"4件效果",--------------------------------------------------50
	"進化",-----------------------------------------------------51
	"啟動",-----------------------------------------------------52
	"每次只能選擇5個忍者",-------------------------------------53
	"30級才開放裝備精煉,請提升等級再來吧!",----------------54
	"出售所選的",-----------------------------------------------55
	"個寶物，獲得",---------------------------------------------56
	"銅幣，您確定要出售嗎？",-----------------------------------57
	"疫苗種",---------------------------------------------------58
	"數據種",---------------------------------------------------59
	"病毒種",---------------------------------------------------60
	"其他",---------------------------------------------------61
	"此忍者已達到等級上限",-------------------------------62
	"碎片",-----------------------------------------------------63
	"忍者",-----------------------------------------------------64
	"緣分",-----------------------------------------------------65
	"組合技",-----------------------------------------------------66
	"可啟動緣分+",----------------------------------------------67
	"LV:",------------------------------------------------------68
	"今日可買",-------------------------------------------------69
	"次",-------------------------------------------------------70
	"已達購買上限",---------------------------------------------71
	"普通招募書不足",-----------------------------------------------72
	"大型開發書不足",-----------------------------------------------73
	"金幣不足",-------------------------------------------------74
	"無購買上限",-----------------------------------------------75
	"購買成功",-------------------------------------------------76
	"價格每日凌晨12:00刷新",--------------------------------------77
	"該忍者進化次數已達上限！",---------------------------------78
	"需要等級到達",---------------------------------------------79
	"進化所需忍者不足",-----------------------------------------80
	"進化所需道具不足",-----------------------------------------81
	"進化所需裝備不足",-----------------------------------------82
	"需要達到VIP%d及以上可購買",----------------------------------------------83
	"請選擇人物",-----------------------------------------------84
	"道具數量不足",---------------------------------------------85
	"銅幣不足",---------------------------------------------86
	"您當前沒有任何品質小於橙色的忍者！",-----------------87
	"請先選擇你要分解的",---------------------------------88
	"沒有可重生的",---------------------------------------------89
	"忍者已滿級",-----------------------------------------------90
	"進化已達上限",---------------------------------------------91
	"進化成功",-------------------------------------------------92
	"出售成功,共獲銅幣",----------------------------------------93
	"你當前沒有符合條件的裝備！",-------------------------94
	"每次只能選擇5件武器",-------------------------------------95
	"防禦",-----------------------------------------------------96
	"第",-------------------------------------------------------97
	" ",-----------------------------------------------------98
	"資源更新失敗，是否重新更新？",-------------99
	"網路不給力喲~請重新連接~！",-----------------100
	"您將要更新",-----------------------------------------101
	"的資源，您現在要更新麼？選擇不更新將會退出遊戲。",---------102
	"30級開啟",-------------------------------------------------103
	"等級不足",-------------------------------------------------104
	"已通關",---------------------------------------------------105
	"完美通關",-------------------------------------------------106
	"更新完畢",-------------------------------------------------107
	"你沒有綠、藍品質的裝備可選擇",--------------------108
	"暫無可出售裝備",-------------------------------------------109
	"您沒有任何該品質的裝備",------------------------------110
	"您沒有任何該品質的忍者",------------------------------111
	"暫無可出售忍者",-------------------------------------------112
	"今日挑戰次數已經用完",-------------------------------------113
	"你沒有白、綠、藍品質的忍者可選擇",--------------------114
	"援軍",-----------------------------------------------------115
	"已上陣",---------------------------------------------------116
	"不能超過12個字元！",-------------------------------117
	"主角暱稱不可為空！",---------------------------------------118
	"暱稱中不可包含特殊字元！",---------------------------------119
	"主線副本",-------------------------------------------------120
	"無限山",-------------------------------------------------121
	"商城-橙色箱子",--------------------------------------------122
	"[主線副本]掉落",------------------------------------123
	"可以在神祕商店購得",---------------------------------------124
	"有幾率開出裝備碎片",---------------------------------------125
	"培養液不足",-----------------------------------------------126
	"銅幣不足",-------------------------------------------------127
	"金幣不足",-------------------------------------------------128
	"VIP5可培養10次，當前VIP等級不足。儲值可提升VIP等級",---129
	"VIP4可培養5次，當前VIP等級不足。儲值可提升VIP等級",---130
	"已刷新",---------------------------------------------------131
	"光丘守護",-------------------------------------------------132
	"未開放",---------------------------------------------------133
	"經驗",-----------------------------------------------------134
	"日常副本",-------------------------------------------------135
	"郵件",-----------------------------------------------------136
	"好友介面",-------------------------------------------------137
	"日常任務",-------------------------------------------------138
	"大師榜",---------------------------------------------------139
	"內容",-----------------------------------------------------140
	"開放天賦: ",-----------------------------------------------141
	"培養1次",-------------------------------------------------142
	"培養5次",-------------------------------------------------143	
	"培養10次",-------------------------------------------------144
	"點擊選擇",-------------------------------------------------145
	"玩家詳細資訊及操作",---------------------------------------146
	"組織商店",-------------------------------------------------147
	"恭喜你獲得",-----------------------------------------------148
	"道具使用成功！",-------------------------------------------149
	"0k",-------------------------------------------------------150
	"未上榜",---------------------------------------------------151
	"X",--------------------------------------------------------152
	"+",--------------------------------------------------------153
	"恭喜你開啟功能點",-----------------------------------------154
	"恭喜你的上陣數提高",-------------------------------------155
	"點",-------------------------------------------------------156
	"已達到購買上限",-------------------------------------------157
	"演武場",---------------------------------------------------158
	"名可購買",-------------------------------------------------159
	"可購買",---------------------------------------------------160
	"刷新次數上限",---------------------------------------------161
	"強化等級+",------------------------------------------------162
	"強化暴擊",-------------------------------------------------163
	"冷卻時間",-------------------------------------------------164
	"秒",-------------------------------------------------------165
	"沒有藍色品質以下的寶物了",---------------------------------166
	"陣容查看",-------------------------------------------------167
	"暫無可出售寶物",-------------------------------------------168
	"你沒有藍、紫品質的寶物可選擇",--------------------169
	"您沒有任何該品質的寶物",------------------------------170
	"請選擇你要出售的寶物",--------------------------------171
	"今日可買",-------------------------------------------------172
	"次",-------------------------------------------------------173
	"1星",-----------------------------------------------------174
	"2星",-----------------------------------------------------175
	"3星",-----------------------------------------------------176
	"(無忍者陣亡)",---------------------------------------------177
	"(1忍者陣亡)",----------------------------------------------178
	"(多於1忍者陣亡)",------------------------------------------179
	"獲得%s顆星星後可獲取喲!",----------------------------------180
	"您已經領取該寶箱啦!",--------------------------------------181
	"級開啟",---------------------------------------------------182
	"獲得《",---------------------------------------------------183
	"》X",--------------------------------------------------184
	"演武場獎勵",-----------------------------------------------185
	"恭喜您在演武場中位列",-------------------------------------186
	"名，鑒於神勇表現，特發以上\r\n獎勵。",-------------------------187
	"獎勵發放",-------------------------------------------------188
	"VIP寶箱",--------------------------------------------------189
	"演武場幸運獎勵",-------------------------------------------190
	"(與",------------------------------------------------------191
	"達成合擊)",------------------------------------------------192
	"精練成功",-------------------------------------------------193
	"提升1階",-------------------------------------------------194
	"今日已聚寶",-----------------------------------------------195
	"採集簍累積了",---------------------------------------196
	"銅幣啦，再聚寶",---------------------------------------197
	"次即可領取獎勵",----------------------------------------198
	"暫未開放",-------------------------------------------------199
	"可啟動合擊技",---------------------------------------------200
	"美食已經準\r\n備好了，快請享用吧~",----------201
	"今天的美食\r\n已喫完，還請明日\r\n再來~",--202
	"美食醬正在\r\n努力，晚點再來\r\n吧~",--203
	"儲值送禮",-------------------------------------------------204【数码宝贝】活动
	"活動時間內，完成對應目標就可以獲得獎勵！",--------------------------------------205【数码宝贝】活动
	"儲值",-----------------------------------------206【数码宝贝】活动
	"金幣",-------------------------------------------------------207
	"點擊+號,選擇素材進行寶物強化吧",-------------------------208
	"累計消費",----------------------------------------------------209
	"活動時間內，累計消費達到指定金額就可以獲得獎勵！",------------------------------210【数码宝贝】活动
	"累計消耗",----------------------------------------------------211【数码宝贝】活动
	"體力回復了",----------------------------------------------------212
	"5級可使用戰鬥加速",---------------------------213
	"5級可使用戰鬥加速",---------------------------214
	"每日儲值",----------------------------------------------------215
	"金幣以上！即可領取豪華獎勵",---------------------------216
	"圓",----------------------------------------------------217
	"首次儲值額外贈送",----------------------------------------------------218
	"金幣\r\n（限購一次）",----------------------------------------------------219
	"儲值額外贈送",----------------------------------------------------220
	"首儲成功，恭喜獲得",----------------------------------------------------221
	"金幣！",----------------------------------------------------222
	"立即獲得",----------------------------------------------------223
	"金幣，連續",--------------------------------------------------224
	"\r\n天每天可領取",------------------------------------------------225
	"沒有可退化的寶物",------------------------------------------------226
	"沒有可退化的忍者",------------------------------------------------227
	"VIP",------------------------------------------------228
	"每天可領取",------------------------------------------------229
	"金幣，剩餘\r\n ",------------------------------------------------230
	"天",------------------------------------------------231
	"領取月卡每日獎勵成功，恭喜獲得",------------------------------------------------232
	"剩餘可領取時間：",------------------------------------------------233
	"忍者分解後將會獲得以下物品",------------------------------------------------234
	"裝備分解後將會獲得以下物品",------------------------------------------------235
	"忍者退化後將會獲得以下物品",------------------------------------------------236
	"寶物退化後將會獲得以下物品",------------------------------------------------237
	"VIP等級已達上限",------------------------------------------------238
	"恭喜購買",------------------------------------------------239
	"月卡成功！每日都可以領取免費金幣喲!",------------------------------------------------240
	"使用成功！體力補充完畢，快去【出擊】吧！",------------------------------------------------241
	"40級才開放寶物精煉,請提升等級再來吧!",----------------242
	"金幣，並額外獲得的",----------------243
	"金幣！",----------------244
	"儲值成功，恭喜獲得",----------------245
	"金幣，快繼續闖關吧",----------------246
	"領取月卡每日獎勵成功，剩\r\n餘",----------------247
	"是否花費",----------------248
	"重置副本",----------------249
	"今日還可重置",----------------250
	"次",----------------251
	"今日重置次數已用完",----------------252
	"今日挑戰次數已用完",----------------253
	"晶片值",----------------254
	"榮譽不足",----------------255
	"~~~目前什麼都沒有喲~~~",----------------256
	"您還沒有輸入任何文字",----------------257
	"你要和自己聊天嗎",----------------258
	"已申請添加",----------------259
	"為好友",----------------260
	"已添加",----------------261
	"到黑名單",----------------262
	"已經在你的黑名單了",----------------263
	"確定將",----------------264
	"拉入黑名單?拉入黑名單後,你將無法收到對方的聊天資訊",----------------265
	"奪寶",----------------266
	"積分",----------------267
	"上線",----------------268
	"",----------------269
	"分鐘",----------------270
	"小時",----------------271
	"周以上",----------------272
	"當前金幣不足，是否前往儲值",----------------273
	"當前VIP等級不足，是否前往儲值",----------------274
	"是否與",----------------275
	"絕交,你們的友誼真的走到盡頭了嗎?",----------------276
	"是否花費200金幣購買等級基金？",----------------277【数码宝贝】等级基金
	"需要達到VIP3才能購買喔~",----------------278【数码宝贝】等级基金
	"成功購買等級基金，快去練級領獎勵吧~",----------------279【数码宝贝】等级基金
	"名字不能為空",----------------280
	"已有%s人購買啦~",----------------281
	"購買人數到達",----------------282
	"即可領取",----------------283
	"等級到達",----------------284
	"採集箱已經空空如也，明日繼續採集吧!",----------------285
	"採集箱已經喫撐了！快領取裡面的銅幣吧！",----------------286
	"快來挑戰無限山吧！",----------------287
	"小時前",----------------288
	"分鐘前",----------------289
	"剛剛",----------------290
	"天前",----------------291
	"奪寶資訊",----------------292
	"疫苗進度",----------------293
	"資料進度",----------------294
	"病毒進度",----------------295
	"其他進度",----------------296
	"經驗忍者不可以強化",----------297
	"經驗忍者不可以精煉",----------298
	"40級開啟",----------299
	"不可強化",----------300
	"不可精煉",----------301
	"活動未開啟",----------302
	"戰力",----------303
	"請選擇一個獎勵類型",----------304
	"已結束",----------305
	"僅限前%s人購買（剩餘%s件）",----------306
	"冷卻時間",----------307
	"秒",----------308
	"發送成功",----------309
	"無",----------310
	"使用成功！出擊次數增加",----------311
	"挑戰書數量不足，請先購買",----------312
	"留言成功",----------313
	"名稱不能超過6個字元",----------314
	"請輸入您的暱稱喲~",----------315
	"當前金幣不足，是否前往儲值？",----------316
	"名",----------317
	" 今日點贊次數已經用完,請明日再來吧",----------318
	"該玩家很懶，什麼都沒有留下",----------319
	"今日功勳達到",----------320
	"可以領取",----------321
	"達到VIP",----------322
	"後開啟",----------323
	"暫無",----------324
	"沒有可領取的體力",----------325
	"今日領取次數已用完",----------326
	"需要通過該關卡才能進行掃蕩",----------327
	"需要達到3星才能掃蕩",----------328
	"15級才開放奪寶，請努力提升等級再來吧！",----------329
	"第",----------330
	"",----------331
	"戰功x",----------332
	"的緣分",----------333
	"啟動",----------334
	"侵略者已被擊殺",----------335
	"好友%s造成x%d傷害",----------336
	"發現",----------337
	"，是否前往攻打？",----------338
	"強化成功!,寶物經驗增加",----------339
	"成功升到",----------340
	"請輸入暱稱:",----------341
	"請輸入資訊:",----------342
	"5級才能穿戴裝備,請努力提升等級再來吧！",----------343
	"已滿級",----------344
	"此忍者已經滿級,不需要再升級了!",----------345
	"不能進化",----------346
	"不可躍遷",----------347
	"培養屬性已滿,請提升忍者等級可提高培養屬性上限",----------348
	"已滿值",----------349
	"請選擇需要出售的忍者",----------350
	"恭喜獲得",----------351
	"達到VIP%d纔可購買，儲值可提升VIP等級",----------352
	"演武幣不足",----------------353
	"成功領取1點精力",------------354
	"還在為基礎資源煩惱嗎？限時兌換強勢來襲，各種福利爽翻天！",------------355
	"是否確定購買VIP%s禮包？",------------356
	"光丘守護獎勵",------------357
	"掃蕩",------------358
	"（每次消耗%d點體力）",------------359
	"通關 %s 開啟",---------------------360
	"每天只能挑戰%d次！",---------------------361
	"這是為您精心準備的獎勵，還望笑納！",------------------362,
	"伺服器維護中,請稍後重試!",---------------------------363
	"點贊成功,並獲得%d銅幣!",---------------------------364
	"暫未開放獲得途徑",------------------365
	"與%s合擊",---------------------------------------------366
	"剩餘次數",---------------------------------------------367
	"土豪，求抱大腿~~~！",----------368
	"材料經驗已超出等級上限，是否繼續升級？",----------369
	"和",----------370
	",",----------371
	"可購買%d次",------------372
	"要邀請好友一起光丘守護嗎？",------------373
	"暱稱不可為空",----------374
	"您還沒有輸入任何資訊",----------375
	"努力載入中，耐心等待",------------------376
	"叛軍發現",-------377 不要替换此文字，前端根据此文字替换成 379的文字
	"叛軍擊殺",-------378 不要替换此文字，前端根据此文字替换成 380的文字
	"發現侵略者",-------379 用于377的转换
	"擊殺侵略者",-------380 用于378的转换
	"晶片已達上限",-------381
	"經驗寶物無法強化和精煉！",--------382
	"主角無法使用此方式升級！",--------383
	"該忍者無法進化！",----------------384
	"您選擇了高品質忍者，確認消耗？",----------------385
	"您選擇了高品質寶物，確認消耗？",----------------386
	"是否花費%d金幣購買？",----------------------------387
	"是否花費%d金幣學習技能？",----------------------------388
	"確定消耗%d金幣學習10次？",----------------------------389
	"達到%d級可以領取",----------------------------390
	"上陣忍者數量不可超過%s人",----------------------------391
	"上陣忍者等級不可超過%s級",----------------------------392
	"上陣忍者品質不可低於%s品質",----------------------------393
	"%d小時收益%d%s",----------------------------394
	"請先上陣忍者",----------------------------395
	"確定放棄佔領？放棄可收穫%d%s\n\r(可前往獎勵中心領取)",----------------------------396
	"急報！您的地盤被人搶去了！",----------------------------397 地盘被抢夺
	"您有地盤佔領時間已滿",----------------------------398 地盘到期
	"恭喜您成功搶佔到一個地盤",----------------------------399 
	"很遺憾，地盤未搶佔成功",----------------------------400 
	"恭喜您成功延長佔領時間",----------------------------401 
	"資源搶奪獎勵",------------402
	"(可前往獎勵中心領取)",------------403
	"該忍者正在駐守中，無法提升等級",------------404
	"擴充次數已達上限",------------405
	"是否花費%d金幣擴充1個佔領上限？",------------406
	"購買成功，佔領上限+1",------------407
	"積分獎勵",------------408
	"每小時取得%s%s",------------409
	"可佔領4小時",------------410
	"很遺憾，暫時未搜索到對應的空建築",------------------411
	"請輸入座標X:",----------412
	"請輸入座標Y:",----------413
	"請輸入地圖索引:",----------414
	"搜索地圖超過最大上限",------------------415
	"搜索座標超出最大區域",------------------416
	"輸入地圖資訊錯誤",------------------417
	"輸入X座標資訊錯誤",------------------418
	"輸入Y座標資訊錯誤",------------------419
	"系統檢測到您的屬性資料異常，請重新登陸",------------------420
	"剩餘%s天",------------------421
	"您的角色已被封停，詳情請聯絡客服人員",------------------422
	"恭喜玩家%s，獲得金幣%s",-----------423
	"排位賽獎勵",-----------424
	"戰神令不足",-----------425
	"已到達頂級，無法成長",-----------426
	"裝備退化後將會獲得以下物品",-----------427
	"每次只能選擇五個寶物",-----------------428
	"請選擇獎勵",-----------------429
	"可兌換%d次",-----------------430
	"可領取%d次",-----------------431
	"隊伍中有6個忍者時援軍才可上陣",-----------------432
	[433] = "登陸",-----------------433
}
--- 定义活动信息
_tip_info_activity = {
	-- 此处不填写值,在下面标记的序号里填写
}
_tip_info_activity[21]={"每日儲值送禮","有錢任性，活動期間，當日累計儲值達到指定金額即可領取各種稀有資源和道具。"}
_tip_info_activity[24]={"登陸送禮","活動期間，累計登入達到指定天數即可獲得稀有道具~！累計登入%d天"}
_tip_info_activity[43]={"演武雙倍","活動期間，活動期間，參與演武場的玩家，可獲得指定道具的雙倍獎勵~！"}
_tip_info_activity[44]={"副本雙倍","活動期間，活動期間，副本掉落的指定道具的掉落率將翻倍，抓緊時間刷刷刷！"}
_tip_info_activity[45]={"單筆儲值送禮","活動期間，單筆儲值達到指定金額即可獲得超值道具單筆儲值%d金幣"}
_tip_info_activity[46]={"招募折扣","活動期間，忍者招募可享20%優惠！"}
_tip_info_activity[47]={"光丘守護","侵略者來襲，活動期間，攻擊侵略者和擊殺侵略者的玩家都會獲得豐厚的獎勵！",{"攻擊侵略者%d名","擊殺侵略者%d名"}}
_tip_info_activity[62]={"碎片兌換","活動時間內，可以兌換指定道具！"}------------------【数码宝贝】限时兑换
_tip_info_activity[70]={"高級商店","在這裡使用高級幣。每件商品都有各自的每日或每週購買上限。"}-------------------限时兑换
_tip_info_activity[71]={"裝備市場","活動期間，大量稀有裝備折價大拍賣！快將你心儀已久的裝備帶走吧！"}---------------限时兑换
_tip_info_activity[76]={"折扣販售","活動期間，玩家可以使用指定資源兌換稀有資源！心動不如行動！"}------------------------------------限时兑换
_tip_info_activity[90]={"搖錢樹200%X","活動期間，前10次點金可獲得雙倍兩！"}------------------------------------点金双倍
_tip_info_activity[94]={" 體力購買200%加成","活動期間，前5次購買體力可享200%加成，千萬別錯過！"}
_tip_info_activity[97]={"主線副本2倍掉落","活動時間內，主線關卡物品雙倍掉落！快去戰鬥吧！"}
_tip_info_activity[98]={"精英副本2倍掉落","活動時間內，精英關卡物品雙倍掉落！快去戰鬥吧！"}
_tip_info_activity[99]={"兩挑戰2倍掉落","活動時間內，銅幣挑戰活動關卡物品雙倍掉落！快去戰鬥吧！"}
_tip_info_activity[100]={"精英關卡次數增加","活動時間內，精英關卡可挑戰次數每天額外增加3次，快去獲得心儀忍者的碎片吧！"}
_tip_info_activity[101]={"銅幣挑戰次數增加","活動時間內，銅幣挑戰活動關卡可挑戰次數每天額外增加1次，快去戰鬥吧！"}
_tip_info_activity[114]={"限定招募","%s參上！活動時間內，可以通過限定招募抽卡（V%s以上玩家可見）獲得！（抽卡次數不計入活動任務抽卡計數）", "%s、%s2選1！活動時間內，可以通過限定招募抽卡（V%s以上玩家可見）獲得！（抽卡次數不計入活動任務抽卡計數）"}
_tip_info_activity[120]={"節日關卡掉落","活動時間內，主線關卡和精英關卡戰鬥勝利會有一定幾率額外掉落%s（可以兌換稀有資源）！快去戰鬥吧！"}
_tip_info_activity[121]={"節日道具兌換", "活動時間內，可以兌換指定道具！"}
_tip_info_activity[122]={"節日登陸有禮","活動時間內，完成對應目標就可以獲得獎勵！"}
_tip_info_activity[123]={"關卡掉落徽章", "活動時間內，主線關卡和精英關卡戰鬥勝利會有一定幾率額外掉落%s（可以兌換稀有資源）！快去戰鬥吧！"}
_tip_info_activity[124]={"護額限時兌換", "活動時間內，可以兌換指定道具！"}
_tip_info_activity[125]={"護額登陸有禮", "活動時間內，完成對應目標就可以獲得獎勵！"}
_tip_info_activity[126]={"任務贈送護額", "活動時間內，完成對應目標就可以獲得獎勵！"}
_tip_info_activity[128]={"經驗挑戰次數增加","活動時間內，銅幣挑戰活動關卡可挑戰次數每天額外增加1次，快去戰鬥吧！"}
_tip_info_activity[129]={"技之作戰次數增加","活動時間內，銅幣挑戰活動關卡可挑戰次數每天額外增加1次，快去戰鬥吧！"}
_tip_info_activity[130]={"分身挑戰次數增加","活動時間內，銅幣挑戰活動關卡可挑戰次數每天額外增加1次，快去戰鬥吧！"}
_tip_info_activity[131]={"經驗挑戰2倍掉落","活動時間內，經驗挑戰物品雙倍掉落！快去戰鬥吧！"}
_tip_info_activity[132]={"技能挑戰2倍掉落","活動時間內，技之挑戰物品雙倍掉落!快去戰鬥吧!"}
_tip_info_activity[133]={"分身挑戰2倍掉落","活動時間內，分身挑戰物品雙倍掉落!快去戰鬥吧!"}
_tip_info_activity[134]={"忍者試煉2倍獎勵","活動期間,每個試煉寶箱首次免費打開獲得銅幣翻倍!"}
_tip_info_activity[135]={"白絕必出忍者","活動時間內,白絕軍團會必然刷新%s，快去挑戰吧！"}

_vip_qianming = {
	{4,"沒有銅幣怎麼能養活我呢？","提督，再來一碗飯吧~~"},--------------------------------------------VIP0  铜币500000
	{201,"哼哼，沒體力了吧~快快退下吧~！","有了體力，就可以繼續出擊了！"},----------------------------VIP1  兵粮丸10
	{7,"想奪寶，沒有精力怎麼行？！","有了精力，就可以吊打“非提”了！"},--------------------------------VIP2  精力丸10
	{212,"箱子大拍賣了~走過路過，不要錯過！","馬上就可以跟北魔王買好喫的了，嘿嘿~"},------------------VIP3  橙色宝物箱子5
	{110,"嘿嘿，這個裡面可以開出連裝炮醬喲~","提督桑~快買呀~快買呀~~"},-------------------------------VIP4  橙色装备箱子5
	{220,"獸魂的榮譽，你值得擁有！","哇，這麼多獸魂，還在等什麼呢？"},--------------------------------VIP5  兽魂1000
	{129,"提督~提督，你快告訴我，誰最漂亮？","好多刷新令啊~不買喫虧喲~"},-----------------------------VIP6  刷新卡50
	{216,"棒棒各棒~精煉書可以強化裝備喲~","要想擁有我這樣的身材，必須精煉~"},-------------------------VIP7  高级觉醒书100
	{113,"有了它，就可以精煉電探了！","電探和魚雷都是需要寶物精煉書的喲~"},---------------------------VIP8  宝物觉醒书500
	{102,"這點錢都不願意出嗎？提督。","那我晚上可就不會理你了，哼！"},--------------------------------VIP9  跃迁石1000
	{105,"這個我要了，提督，快來付錢！","阿犬，提督再不付錢，就去咬她！"},----------------------------VIP10 超级觉醒书100
	{115,"哇！恭喜！","好多精煉書哇~提督，我要嘛~快給我吧~！"},---------------------------VIP11 宝物觉醒书1000
	{5,"晶片源纔是取得戰鬥勝利的關鍵！","這麼多晶片源，簡直要發大財了~！"},---------------------------VIP12 跃迁石2500
}
-- _string_piece_info
_probabilityName = {
	"高概率",
	"較高概率",
	"一般概率",
	"較低概率",
	"低概率",
	"極低概率",
}
-- 副本名称分类
_plot_copy_name = {
	"主線副本",
	"精英副本",
	"忍者副本",
	"日常副本",
	"隱藏副本",
}

_ship_types_by_color = {
	"白色",		--1
	"綠色",		--2
	"藍色",		--3
	"紫色",		--4
	"橙色",		--5
	"紅色",		--6
	"金色",		--7

}

-- 名称
_my_gane_name = {
	"銅幣",---------------1
	"金幣",--------------2
	"演武幣",---------------3
	"戰功",---------------4
	"天賦點",-------------5
	"試煉幣",---------------6
	"隊伍經驗",---------------7
	"體力",---------------8
	"體力",---------------9
	"功能點",-------------10
	"演武幣",---------------11
	"體力",---------------12
	"組織幣",	--------13
	"其他項目站位",	-------------14
	"天賦點",	----------15
	"活躍度",	----------16
	"VIP經驗",	----------17
	"礦石",	----------18
}


tip_equip_numerical_info_explain = {
	"獲得裝備",
	"失去裝備",
}

tip_equip_action_info_explain = {
	"裝備強化",
	"裝備一鍵強化",
	"裝備升級",
	"裝備裝備",
	"裝備卸下",
	"裝備合成",
	"裝備分解",
}


tip_online_time = {
	"您好，不能重複領取已領過的獎勵",		--1
	"暫無可用裝備，可去無限山碰碰運氣喔~",		--2
}

--战士信息界面文字颜色
_hero_color_info = {
	--[[
	{95,92,83}, --灰的缘分
	{0,170,65}, --亮的缘分名称
	{117,39,3},--亮的缘分说明
	{95,92,83},--灰的天赋
	{230,12,10},--亮的天赋名称
	{255,144,0},--亮的天赋说明
	{240,109,0},--天赋需求
	{16,138,5},--无缘分无天赋的颜色
	{110,43,10},--资源更新的颜色
	--]]
	{172,172,172}, --灰的缘分
	{1,219,32}, --亮的缘分名称
	{220,78,0},--亮的缘分说明
	{172,172,172},--灰的天赋
	{233,10,10},--亮的天赋名称
	{255,155,58},--亮的天赋说明
	{220,78,0},--天赋需求
	{16,138,5},--无缘分无天赋的颜色
	{110,43,10},--资源更新的颜色
	{34,244,255},--资源更新的颜色10
	{255,255,0},--资源更新的颜色11
}


--品质颜色值
tipStringInfo_quality_color_Type = {
	{255,255,255},				--0白
	{0,255,0},					--1绿
	{0,255,255},				--2蓝
	{255,0,255},				--3紫
	{255, 150, 0},				--4橙
	{255,0,0},					--5红
	{255,255,0},				--6金
	{255,150,255},				--7
	{255,0,13},					--8
	{255,0,13},					--9
	{255,0,13},					--10
	{105,79,56},				--12 战士说明颜色
	{127,127,127},					--13 缘分未激活颜色
	{255,255,255},					--14 缘分激活颜色
}

--装备洗练 颜色值
tipStringInfo_EquipmentRefine_color_Type = {
	{0, 255, 53},   -- 加数值(+100)
	{255, 0, 53},   -- 减数值(-100)
	{255, 0, 53},   -- 最大数值(max100)
	{80, 253, 255},   -- 有数字显示时
	{80, 253, 255},   -- 无数字显示时
}
--阵容界面相关颜色值(已开启)
formation_relationship_color_Type = {
	{255,255,255},		--战士信息界面已经激活的缘分R0 G140 B0
	{205,65,6},				--小忍者界面未激活缘分的灰色字未激活缘分 文本字 颜色R205 G65 B6
	{20,119,0},				--小忍者颜色名字R20  G119  B0
	{131,55,0},			--小忍者界面激活缘分 说明R131  G55  B0
	{146,118,118},		--战士信息界面未激活的缘分R:146   G:118  B:118
}

--忍者阵容缘分激活
formation_relationship_color_Type_two = {
	{131,131,131},		--未激活
	{0,255,255},		--激活
}

-- 周几
timeUtil_WeekX = {
	"一",		--1
	"二",		--2
	"三",		--3
	"四",		--4
	"五",		--5
	"六",		--6
	"日",		--7
	"周",		--8
}

server_state_tip_str={
	{0, "關閉"},
	{0, "流暢"},
	{0, "新服"},
	{1, "伺服器維護中，不妨先去喝喝茶"},
	{0, "推薦"},
	{0, "擁擠"},
	{1, "該服務器已關閉註冊，請前往新服註冊體驗"},
}

--品质颜色值
color_Type = {
	{255,255,255},----1 纯白色
	{0,255,0}, -------2 亮绿色
	{0,255,255},------3 亮蓝色
	{255,0,255},------4 亮紫色
	{255, 150, 0},----5 橙色
	{255,0,0},--------6 大红色
	{255,182,0},------7 纯黄色{255,150,255},----8 暗粉色
	{110,43,8},----—--9 深棕色
	{255,0,13},------10 
	{255,0,13},------11 
	{255,75,0},------12 黑石山
	{50,50,50},------13 
	{255,234,42},----14 国战
	{252,244,168},---15 国战
	{255,85,39},-----16 个人战报
	{255,238,141},---17 个人战报
	{234,206,124},---18 将魂副本伤害对象
	{210,103,215},---19 将魂副本伤害对象
	{255,208,0},-----20 聊天
	{255,134,0},-----21 聊天
	{255,222,76},----22 聊天
	{0,120,255},-----23 聊天
	{255,249,201},---24 聊天
	{255,232,166},---25 忍者羁绊
	{18,227,0},------26 忍者羁绊
	{98,55,0},------27 小详情界面文字
	{10,103,0},------28 小详情界面数字
}

game_infomation_tip_str = {			-- 杂项
	"3",---------------------------------- 1 	三国无双
	"6",---------------------------------- 2 	三国无双
	"9",---------------------------------- 3 	三国无双
	"ttttttt",---------------------------- 4 	三国无双排行榜界面
	"yyyyyyyyyy",------------------------- 5 	三国无双排行榜界面
	"xfnhgx",----------------------------- 6 	三国无双排行榜界面
	"【",----------------------------------7 	TreasureChooseForRebornCell
	"】",----------------------------------8 	TreasureChooseForRebornCell
	"300",---------------------------------9 	HeroRecruitListView  招募一次花费金币显示值
	"/120",--------------------------------10 	TreasuresListView  背包上限
	"需要擊敗我方全隊才能通過此關卡",------11 	GuanQia  
	"第一關",------------------------------12 	GuanQia  
	"擊敗敵人",----------------------------13 	GuanQia   
	"90",----------------------------------14 	PaiHang   
	"89",----------------------------------15 	PaiHang   
	"70",----------------------------------16 	PaiHang   
	"yyyyy",-------------------------------17 	ShopList   
	"100",---------------------------------18 	ShopList   
	"20/30",-------------------------------19 	ShopList   
	"達到40星可購買",----------------------20 	ShopList   
}

game_mine_tip_str = {			-- 领地攻讨
	"佔領",-------------------------------------------- 1
	"後可解鎖此據點",---------------------------------- 2
	"銅幣",-------------------------------------------- 3
	"亮晶晶的銅幣,散發著土豪的氣息",------------------- 4
	"防守據點中",------------------------------------------ 5
	"VIP等級不足",--------------------------------------6
	
}

_strengthen_master_info = {		-- 强化大师
	"四件裝備每強化10級，\r\n獲得一次能力提升", ------1
	"四件裝備每覺醒2級，\r\n獲得一次能力提升",--------2
	"兩件寶物每強化5級，\r\n獲得一次能力提升",--------3
	"兩件寶物每覺醒1級，\r\n獲得一次能力提升",--------4
	"湊齊四件裝備，即可開啟強化大師！",------=--5
	"全身裝備強化",-----------------------------------6
	"全身裝備覺醒",-----------------------------------7
	"全身寶物強化",-----------------------------------8
	"全身寶物覺醒",-----------------------------------9
	"裝備強化大師",-----------------------------------10
	"裝備覺醒大師",-----------------------------------11
	"寶物強化大師",-----------------------------------12
	"寶物覺醒大師",-----------------------------------13
	"級達成",-----------------------------------------14
}

_treasure_info = {			-- 回收说明
	"忍者分解", -----------------------------------------------------1
	"裝備分解",------------------------------------------------------2
	"忍者退化",------------------------------------------------------3
	"寶物退化",------------------------------------------------------4
	"1.退化後,初始寶物得到保留,並返還覺醒過程中消耗的同名寶物",------5
	"2.返還所有強化過程中消耗的經驗和銅幣",--------------------------6
	"3.返還所有寶物覺醒書(不返還覺醒時消耗的銅幣)",------------------7
	"1.退化後,返還初始忍者碎片,並返還成長過程中消耗的同名忍者碎片.(不返還成長時消耗的銅幣)",------------------8
	"2.返還所有升級過程中消耗的經驗和銅幣(不返還經驗少於5000的部分)",------------------9
	"3.返還所有培養液(不返還培養時消耗的銅幣和銅幣)",------------------10
	"4.返還所有晶片石(不返還當前停留在經驗條上,所消耗的晶片石)",-------11
	"5.返還躍遷中,所消耗的躍遷石、銅幣、同名忍者",---------------------12
	"6.返還消耗的躍遷裝備,全部返還到包裹中",---------------------------13
	"1.所有裝備都可以進行分解,按照裝備品質返還榮譽",-------------------14
	"2.返還所有強化過程中消耗的銅幣",----------------------------------15
	"3.返還所有裝備覺醒書",--------------------------------------------16
	"1.綠色及綠色以上的忍者可以分解",---------------------------------------------17
	"2.以獸魂形式返還忍者本身以及成長時消耗的同名忍者(不返還成長時消耗的銅幣)",---18
	"3.返還所有升級過程中消耗的經驗和銅幣(不返還經驗少於5000的部分)",-------------19
	"4.返還所有培養液(不返還培養時消耗的銅幣和銅幣)",-----------------------------20
	"5.返還所有晶片石(不返還當前停留在經驗條上,所消耗的晶片石)",------------------21
	"6.返還躍遷中,所有消耗的躍遷石和銅幣;消耗的同名忍者,以獸魂形式返還",----------22
	"7.所有消耗的躍遷裝備,全部以忍者魂的形式返還(不返還合成躍遷裝備所消耗的銅幣)",--23
}

_equip_ment_info = {			-- 装备退化说明
	"裝備退化",--------------------------------------------------------1
	"1.退化後,初始裝備將以碎片形式返還。",-----------------------------2
	"2.返還所有強化過程中消耗的銅幣。",--------------------------------3
	"3.返還所有覺醒過程中消耗的覺醒書。",------------------------------4
	"4.返還所有升星過程中消耗的同名裝備碎片和銅幣(不返還銅幣)",------5
}
--片头战斗数据
_all_star_head_leader = {
[[182 0 1722 1 1 5 11833 1 11 0 0 5 1000000 0 1 11833 1 王小虎 11834 2 12 0 0 5 1000000 0 1 11834 1 王小龙 11835 3 31 0 0 4 1000000 0 1 11835 1 石黑龙 11836 4 18 0 0 5 1000000 0 1 11836 1 蚩尤 11837 6 501 0 0 6 1000000 0 1 11837 1 男主角 0  1  6 11827 1 49 0 0 4 1000000 0 1 11827 1 金罗汉 11828 2 15 0 0 5 1000000 0 1 11828 1 东方无敌 11829 3 55 0 0 4 1000000 0 1 11829 1 王风雷 11830 4 13 0 0 5 1000000 0 1 11830 1 火云邪神 11831 5 2 0 0 6 1000000 0 1 11831 1 天下无敌 11832 6 1 0 0 6 1000000 0 1 11832 1 天下无敌返老还童 0 ]],
[[39 1 20 1 1 0 3 0 0 4 212 0 1 251 0 0 3 1 -1 -1 1 3 0 0 100000 1 0 0 0 0 0 0 1 3 0 0 3 716 0 1 798 0 1 3 3 -1 -1 0 1 0 0 200000 1 0 0 0 0 2 0 0 200000 1 0 0 0 0 3 0 0 200000 1 0 0 0 0 0 0 0 2 0 0 4 65 0 1 70 0 0 2 1 -1 -1 1 3 0 0 100000 1 0 0 0 0 0 0 1 1 0 0 2 590 0 1 663 0 1 1 1 -1 -1 0 1 0 0 200000 1 0 0 0 0 0 0 1 2 3 0 0 3908 0 0 3 1 2 0 0 0 3908 1 4104 0 1 2 3 -1 -1 0 1 0 0 250000 1 0 0 0 0 2 0 0 250000 1 0 0 0 0 3 0 0 250000 1 0 0 0 1 3 0 0 0 3908 1 4104 0 1 3 0 -1 -1 1 1 0 0 0 3908 1 4104 0 1 1 0 -1 -1 0 0 0 0 1 0 0 4 44 0 1 46 0 0 1 3 -1 -1 1 1 0 0 150000 1 0 0 0 1 2 0 0 150000 1 0 0 0 1 3 0 0 150000 1 0 0 0 0 0 0 0 2 3 0 0 4496 0 0 3 0 2 0 0 0 3908 1 4780 0 0 2 3 -1 -1 1 1 0 0 300000 1 0 0 0 1 2 0 0 300000 1 0 0 0 1 3 0 0 300000 1 0 0 0 0 3 0 0 0 3908 1 4780 0 0 3 0 -1 -1 0 1 0 0 0 3908 1 4780 0 0 1 0 -1 -1 0 0 0 1 4 0 0 3 86 0 1 95 0 1 4 4 -1 -1 0 1 0 0 250000 1 0 0 0 0 2 0 0 250000 1 0 0 0 0 3 0 0 250000 1 0 0 0 0 4 0 0 250000 1 0 0 0 0 0 0 0 4 0 0 2 191 0 1 218 0 0 4 1 -1 -1 1 2 0 0 300000 1 0 0 0 0 0 0 1 5 0 0 0 3781 0 1 3967 0 1 5 3 -1 -1 1 2 0 0 9999999 1 0 0 1 0 0 1 3 0 0 9999999 1 0 0 1 0 0 1 4 0 0 9999999 1 0 0 1 0 0 0 0 0 1 5 0 0 3 3782 0 1 3968 0 1 5 4 -1 -1 0 1 0 0 9999999 1 0 0 1 0 0 0 2 0 0 9999999 1 0 0 1 0 0 0 3 0 0 9999999 1 0 0 1 0 0 0 4 0 0 9999999 1 0 0 1 0 0 0 0 0 0 6 0 0 6 2 0 1 3 0 0 6 1 -1 -1 1 5 0 0 9999999 1 0 0 1 0 0 0 0 0 1 6 0 0 3 3803 0 1 3989 0 1 6 1 -1 -1 0 6 0 0 9999999 1 0 0 1 0 0 0 0 1]],
[[182 0 1722 1 1 5 11833 1 11 0 0 5 1000000 0 1 11833 1 王小虎 11834 2 12 0 0 5 1000000 0 1 11834 1 王小龙 11835 3 31 0 0 4 1000000 0 1 11835 1 石黑龙 11836 4 18 0 0 5 1000000 0 1 11836 1 蚩尤 11837 6 511 0 0 6 1000000 0 1 11837 1 女主角 0  1  6 11827 1 49 0 0 4 1000000 0 1 11827 1 金罗汉 11828 2 15 0 0 5 1000000 0 1 11828 1 东方无敌 11829 3 55 0 0 4 1000000 0 1 11829 1 王风雷 11830 4 13 0 0 5 1000000 0 1 11830 1 火云邪神 11831 5 2 0 0 6 1000000 0 1 11831 1 天下无敌 11832 6 1 0 0 6 1000000 0 1 11832 1 天下无敌返老还童 0 ]],
[[39 1 20 1 1 0 1 0 0 3 442 0 1 109 0 0 1 1 -1 -1 1 2 0 0 2847 1 0 0 0 0 0 0 1 2 0 1 0 1541 0 1 468 0 1 2 3 -1 -1 0 1 1 0 1282 1 0 0 0 0 3 1 0 1282 1 0 0 0 0 5 0 0 1282 1 0 0 0 0 0 0 0 3 0 0 3 453 0 1 112 0 0 3 1 -1 -1 1 2 0 0 2963 1 0 0 0 0 0 0 0 5 0 1 0 1 0 1 1 0 0 5 1 -1 -1 1 2 1 0 384 1 0 0 0 0 0 0 0 1 0 0 3 443 0 1 110 0 0 1 1 -1 -1 1 2 0 0 6847 1 0 0 0 0 0 0 1 2 0 1 0 1542 0 1 469 0 1 2 3 -1 -1 0 1 1 0 22817 1 0 0 0 0 3 1 0 22817 1 0 0 0 0 5 0 0 22817 1 0 0 0 0 0 0 0 3 2 0 1 103 0 0 2 0 3 0 0 1 103 1 488 0 0 3 1 -1 -1 1 2 0 0 876486 1 0 0 1 0 0 0 1 0 0 1 103 1 489 0 0 1 0 -1 -1 0 0 1]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 503 0 0 2 999999 0 0 56 1 航母舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 511 0 0 2 999999 0 0 1321 1 驱逐舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 513 0 0 2 999999 0 0 1376 1 巡洋舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
}


--属性变更时提示的颜色值
tipStringInfo_property_change_color_Type = {
	{255,246,190}, 	--白色  r254  g246  b190	-1
	{68,206,36},	--绿色  r68   g206  b36		-2
	{0,180,255},	--蓝色  r0    g180  b255	-3
	{193,72,255},	--紫色  r193  g72   b255	-4
	{255, 150, 0},	--橙色  r255  g150  b0		-5
	{252,18,0},		--红色  r252  g18   b0		-6
	{255,192,0},	--金色  r252  g18   b0		-7
}


tipStringInfo_hero_change_Type = {
	"更換忍者成功!",			--1
	"忍者升級成功!",			--2
	"忍者經驗增加",				--3
	"裝備卸下成功",				--4
	"裝備更換成功",				--5
	"上陣忍者成功!",			--6
	"穿戴裝備成功!",			--7
	"裝備寶物成功!",			--8
}

-- 演武场的文本
tipStringInfo_arena = {
	"%d名內刷新最高排名，可獲得大量金幣！", --1
	"每天%s發放", --2
	"殺入%d名可獲得每日獎勵", --3

}

-- 抢夺的文本
tipStringInfo_plunder = {
	"免戰%d小時", --1
	"尚未集齊所有殘卷，無法合成",--2
	"級",--3
	"第%d次",--4
	"對手匹配成功",--5
	"搶奪他人會解除免戰狀態，要繼續嗎？", --6
	"使用免戰令可保護您的寶物殘卷不被搶走。", --7
	"您已經處於免戰中，\r\n剩餘%s的免戰時間，\r\n需要重複使用嗎？" --8
	
}

-- 购买道具窗口
tipStringInfo_prop_buy = {
	-- 此序列根据 pirates_config中的273 的次序定义
	-- [1] 购买窗口标题
	-- [2] 使用后的提示语
	{"",""},-- 跃迁石,
	{"",""},-- 宝物觉醒书,
	{"",""},-- 刷新令,
	{"",""},-- 天命石,
	{"",""},-- 超级觉醒书,
	{"",""},-- 高级觉醒书,
	{"",""},-- 中级觉醒书,
	{"",""},-- 初级觉醒书,
	{"",""},-- 培养液,
	{"",""},-- 成长石,
	{"使用免戰旗可保護您的寶物碎片不被搶走",""},-- 免战令(小),
	{"使用免戰旗可保護您的寶物碎片不被搶走",""},-- 免战令(大),
	{"",""},-- 小型开发书,
	{"",""},-- 大型开发书,
	{"您目前的體力不足，使用【體力丸】補一補吧！","使用成功！體力補充完畢，快去【副本】吧！"},-- 兵粮丸,
	{"您目前的精力不足，使用【精力丸】補一補吧！",""},-- 精力丸,
	{"您目前的挑戰書不足，使用【挑戰書】恢復吧！","使用成功,挑戰書增加1個！"},-- 挑战书
}
tipStringInfo_prop_buy_tip = {
	"%s數量不足,請先購買",--1
	"購買成功",--2
	"使用%s成功",--3
}


plunder_probability = {
	{500, "高概率"},
	{0, "較高概率"},
	{250, "一般概率"}, 
	{0, "較低概率"},
	{150, "低概率"},
	{0 , "極低概率"}
}

plunder_five = { -- 哪种概率时显示抢5次
	{2, 500}, 	--蓝色品质时需要这么多
	{3, 250},	--紫色品质时需要这么多
	{4, 150},	--橙色品质时需要这么多
}
-- 0白色
-- 1绿色
-- 2蓝色
-- 3紫色
-- 4橙色
-- 5红色
-- 6金色

tipStringInfo_destiny = {
	"恭喜獲得屬性加強", --1

}

-- 三国无双的文字
tipStringInfo_trialTower = {
	"重置次數已用完", --1
	"可免費重置%d次", --2
	"未上榜",	--3
	"星",	--4
	"今日可買%d次",	--5
	"到達%d星可購買",	--6
	"%d~%d關",--7
	"第%d關",--8
	"你還可以繼續挑戰，不需要重置", --9
	"星數不足",--10
	"請先選擇一個合適的屬性加成",--11
	"星數不足",--12
	"沒有任何屬性加成",--13
	"恭喜達成通關條件：", --14
	"沒有達成通關條件：", --15
	"通過了%d關，可重置挑戰", --16
	"(%d級開啟掃蕩)", --17
	"此關卡暫未開啟",--18
	"你確定要回到第一層，從頭開始嗎？",--19
	"今日可買%d次",--20
	"榮譽不足",--21
	"領取成功",--22
	"進行重置，重置會回到第一層喔！",--23
	"今日還可銅幣重置%d次",--24
	"更多",--25
	"前方戰鬥過於兇險,本層無法使用一鍵3星,還請謹慎選擇",--26
	"恭喜你在第%d~%d關中,共獲得了9星",--27
	"已達購買上限",--28
	"紅色裝備精華數量不足",--29
	"52級開啟掃蕩",--30
	"恭喜你在第%d~%d關中,共獲得了%d星",--31
	"當前自動掃蕩至第%d關(系統會幫您自動選擇加成BUFF)，確定掃蕩？",--32
	"已超過歷史最高三星關卡，不可掃蕩喔！",--33
}

tipStringInfo_trialTowerBattleDescribe = {
	{"在%d回合內獲勝","當前回合：",99},
	{"我方死亡不超過%d人","陣亡人數：",6},
	{"剩餘血量高於%d","我方血量：",0},
}

-- 暴击属性用的
tipStringInfo_trialTower_multiplying_color = {
	{198,0,255},----1
	{198,0,255}, -------2
	{255,126,0},------3 

}

-- 暴击属性用的
tipStringInfo_trialTower_multiplying = {
	"暴擊", --1
	"大暴擊", --2
	"幸運暴擊", --3
	"雙倍", --是否双倍(0,1) -4
}

tipStringInfo_trialTower_attribute = {
	"生命加成",--0 血
	"最終傷害",--1 伤
	"暴擊率",--2 爆
	"命中率",--3 命
	"最終減傷",--4 免
	"抗暴率",--5 抗   攻击(%)+5
	"閃避率",--6 闪
}

-------------------------------------------------------------------
-- 0.生命          1.攻击          2.物防           3.法防
-- 4.生命(%)     5.攻击(%)     6.物防(%)      7.法防(%)
-- 8.暴击率(%)   9.抗暴率(%)  10.格挡率(%)   11.破击率(%)
-- 12.命中率(%)  13.闪避率(%)  14.物理免伤(%) 15.法术免伤(%)
-- 16.治疗率(%)  17.被治疗率(%)18.最终伤害      19.最终减伤
-- 20.初始查克拉     21.体质         22.力量          23.灵力
-- 24.物理攻击     25.法术攻击     26.治疗值        27.被治疗值
-- 28.燃烧伤害     29.中毒伤害     30.燃烧免伤      31.中毒免伤
-- 32.经验         33.最终伤害(%)34.最终减伤(%) 35.PVP终伤(%)
-- 36.PVP免伤(%)
--------------------------------------------------------------------
-- 三国无双属性加成
-- 数值从0 开始,自行+1

tipStringInfo_trialTower_attribute_info = {	
	{"生命","+%d.0"},	--1
	{"攻擊","+%d.0"},	--2
	{"防禦","+%d.0"},	--3
	{"術防","+%d.0"},	--4
	{"生命","+%d.0","%"},	--5
	{"攻擊","+%d.0","%"},	--6
	{"防禦","+%d.0","%"},	--7
	{"術防","+%d.0","%"},	--8
	{"暴擊率","+%d.0","%"},	--9
	{"抗暴率","+%d.0","%"},	--10
	{"格擋率","+%d.0","%"},	--11
	{"破擊率","+%d.0","%"},	--12
	{"命中率","+%d.0","%"},	--13
	{"閃避率","+%d.0","%"},	--14
	{"物理免傷","+%d.0","%"},	--15
	{"忍術免傷","+%d.0","%"},	--16
	{"治療率增加","+%d.0","%"},	--17
	{"被治療率增加","+%d.0","%"},	--18
	{"最終傷害","+%d.0"},	--19
	{"最終減傷","+%d.0"},	--20
	{"初始查克拉","+%d.0"},	--21
	{"體質","+%d.0"},	--22
	{"力量","+%d.0"},	--23
	{"靈力","+%d.0"},	--24
	{"物理攻擊","+%d.0"},	--25
	{"額外傷害","+%d.0"},	--26
	{"治療值","+%d.0"},	--27
	{"被治療值","+%d.0"},	--28
	{"出血傷害","+%d.0"},	--29
	{"中毒傷害","+%d.0"},	--30
	{"出血免傷","+%d.0"},	--31
	{"中毒免傷","+%d.0"},	--32
	{"經驗","+%d.0"},	--33
	{"傷害加成","+%d.0","%"},	--34
	{"傷害減免","+%d.0","%"},	--35
	{"PVP終傷","+%d.0","%"},	--36
	{"PVP免傷","+%d.0","%"},	--37
	{"初始合擊點數","+%d.0"},	--38
	{"每次出手增加的查克拉","+%d.0"},	--39
	{"出血傷害","+%d.0","%"},	--40
	{"吸血率","+%d.0","%"},	--41
	{"查克拉","+%d.0"},	--42
	{"反彈率","+%d.0","%"},	--43
	{"暴擊強度","+%d.0","%"},	--44
	{"免控率","+%d.0","%"},	--45
	{"小技能觸發機率","+%d.0","%"},	--46
	{"格擋強度","+%d.0","%"},	--47
	{"控制率","+%d.0","%"},	--48
	{"治療效果","+%d.0","%"},	--49
	{"——","+%d.0","%"},	--50
	{"忍者類型剋制傷害","+%d.0","%"},	--51
	{"濺射傷害","+%d.0","%"},	--52
	{"技能傷害","+%d.0","%"},	--53
	{"被治療率減少","+%d.0","%"},	--54
	{"傷害提升","+%d.0","%"},	--55
	{"奧義傷害率","+%d.0","%"},	--56
	{"增加造成的奧義傷害","+%d.0","%"},	--57
	{"減少造成的奧義傷害","+%d.0","%"},	--58
	{"增加暴擊傷害","+%d.0","%"},	--59
	{"減少暴擊傷害","+%d.0","%"},	--60
	{"受到的奧義傷害增加","+%d.0","%"},	--61
	{"查克拉回復速度","+%d.0","%"},	--62
	{"受到傷害降低","+%d.0","%"},	--63
	{"降低攻擊","+%d.0","%"},	--64
	{"降低防禦","+%d.0"},	--65
	{"傷害加成百分比提升（倍數）","+%d.0","%"},	--66
	{"降低奧義傷害率","+%d.0","%"},	--67
	{"降低傷害減免","+%d.0","%"},	--68
	{"降低防禦","+%d.0","%"},	--69
	{"降低查克拉回復速度","+%d.0","%"},	--70
	{"忍者類型剋制傷害加成","+%d.0","%"},	--71
	{"忍者類型剋制傷害減免","+%d.0","%"},	--72
	{"降低攻擊","+%d.0"},	--73
	{"奧義抗性","+%d.0","%"},	--74
	{"減少奧義抗性","+%d.0","%"},	--75
	{"降低免控率","+%d.0","%"},	--76
	{"復活機率","+%d.0","%"},	--77
	{"被復活機率","+%d.0","%"},	--78
	{"復活繼承血量","+%d.0","%"},	--79
	{"復活繼承查克拉","+%d.0","%"},	--80
	{"被復活繼承血量","+%d.0","%"},	--81
	{"被復活繼承查克拉","+%d.0","%"},	--82
	{"增加復活機率","+%d.0","%"},	--83
	{"增加復活繼承血量","+%d.0","%"},	--84
}

tipStringInfo_resurrection_info_tips = {
	{"指定忍者復活，生命恢復","+%d","%"},	--1		复活用
	{"指定忍者生命恢復","+%d","%"},	--1		单体加血用
	{"全體忍者查克拉恢復","+%d"},	--1			全体加怒用
	{"指定忍者查克拉恢復","+%d"},	--1		单体加怒用
}

tipStringInfo_trialTower_attribute_icon_info = {
	{1,"攻擊系列"},
	{2,"防禦系列"},
	{3,"暴擊系列"},
	{4,"格擋系列"},
}

-- 战斗buff美术字索引对照表
_battle_buff_effect_dictionary = {
	-- effect id       buff type
	"-1",	-- 0为攻击
	"-1",	-- 1为加血
	"artword_34",	-- 2为加怒
	"artword_35",	-- 3为减怒
	"-1",	-- 4为禁怒
	"xuanyun",	-- 5为眩晕
	"-1",	-- 6为中毒
	"artword_3",	-- 7为麻痹
	"artword_4",	-- 8为封技
	"zhuoshao",	-- 9为燃烧
	"-1",	-- 10为爆裂
	"artword_1",	-- 11为增加档格
	"tiebi",	-- 12为无敌
	"-1",	-- 13为必闪
	"-1",	-- 14为吸血
	"-1",	-- 15禁疗
	"-1",	-- 16盲目
	"artword_2",	-- 17冰冻
	"-1",	-- 18备用
	"-1",	-- 19备用
	"-1",	-- 20备用
	"zengjiagongji",	-- 21增加攻击
	"jiangdigongji",	-- 22降低攻击
	"zengjiafangyu",	-- 23增加防御
	"jiangdifangyu",	-- 24降低防御
	"hurt_add",	-- 25受到的伤害增加
	"hurt_sub",	-- 26受到的伤害降低
	"zengjiabaoji",	-- 27增加暴击
	"zengjiakangbao",	-- 28增加抗暴
	"zengjiamingzhong",	-- 29增加命中
	"zengjiashanbi",	-- 30增加闪避
	"chixuhuixue",	-- 31持续回血
	"artword_81",	-- 32清除负面效果
	"artword_10",	-- 33造成的伤害增加
	"-1",	-- 34全体秒杀
	"-1",	-- 35固定伤害
	"artword_27",	-- 36降低治疗效果
	"-1",	-- 37溅射
	"artword_8",	-- 38增加格挡强度
	"artword_22",	-- 39降低格挡率
	"artword_18",	-- 40增加吸血率
	"-1",	-- 41反弹
	"artword_84",	-- 42必杀技触发概率
	"artword_9",	-- 43增加破格挡率
	"artword_15",	-- 44增加反弹率
	"artword_11",	-- 45增加伤害减免
	"-1",	-- 46废弃
	"artword_110",	-- 47降低必杀技触发概率
	"artword_20",	-- 48降低暴击伤害
	"artword_31",	-- 49减少造成的奥义伤害
	"artword_5",	-- 50嘲讽
	"artword_25",	-- 51降低伤害加成
	"artword_10",	-- 52增加伤害加成
	"artword_14",	-- 53增加控制率
	"artword_16",	-- 54增加造成的奥义伤害
	"artword_31",	-- 55减少奥义伤害率
	"artword_56",	-- 56降低查克拉回复速度
	"artword_57",	-- 57提高查克拉回复速度
	"artword_6",	-- 58增加暴击伤害
	"-1",	-- 59--
	"artword_36",	-- 60增加暴击强度
	"artword_26",	-- 61降低伤害减免
	"artword_16",	-- 62增加奥义伤害率
	"artword_7",	-- 63增加格挡率
	"artword_10",	-- 64增加忍者类型克制伤害加成
	"artword_25",	-- 65增加忍者类型克制伤害减免
	"artword_19",	-- 66降低暴击率
	"artword_21",	-- 67降低抗暴率
	"artword_17",	-- 68增加奥义抗性
	"artword_32",	-- 69减少奥义抗性
	"artword_70",	-- 70复活機率
	"-1",	-- 71复活继承血量
	"-1",	-- 72复活继承怒气
	"artword_73",	-- 73增加复活复活機率
	"-1",	-- 74增加复活继承血量
	"artword_75",	-- 75被复活機率
	"-1",	-- 76被复活继承血量
	"-1",	-- 77被复活继承查克拉
	"artword_78",	-- 78免疫控制
	"-1",	-- 79复活
	"artword_80",	-- 80小技能伤害提升
	"fangzhu",	--81放逐效果
	"xuruo",	--82虚弱效果
	"meihuo",	-- 83混乱
	"shihua",	-- 84石化
	"-1",	-- 85复仇触发概率
	"-1",	-- 86复仇倍数
	"fuchou",	-- 87复仇效果
	"meihuo2",	-- 88魅惑     
    "-1",	-- 89复仇
    "-1",	-- 90复仇
   "fuchou2",	-- 91复仇
   "zhenshi",	-- 92真实伤害
    "-1",	-- 93控制真实伤害承受者目标
   "artword_12",	-- 94治疗率降低   
   "artword_44",	-- 95免控率上升   
   "artword_gandian",	-- 96感电
   "artword_gandian_1",	-- 97感电
    "-1",	-- 98复仇触发概率
    "-1",	-- 99复仇倍数
   "fuchou",	-- 100复仇效果
   "-1",	-- 101禁止神兽使用X回合
   "-1",	-- 102免控率降低
   "artword_23",	-- 103格挡强度降低
   "artword_81",	-- 104清除减益BUFF
   "artword_78",	-- 105免控率上升
   "artword_82",	-- 106虚化
   "artword_85",	-- 107清除高级增益buff
    "artword_108",	-- 108无视防御
    "artword_109",	-- 109无视抗暴率
    "artword_111",	-- 110无视格挡率
    "artword_112",	-- 111无视伤害减免
    "artword_113",	-- 112无视奥义抗性
    "artword_86",	-- 113须佐外衣（庇护）
    "artword_29",	-- 114控制率降低
    "artword_83",	-- 115神兽伤害减免
    "artword_xishou",	-- 116完全体尾兽化（伤害吸收）
    "-1",	-- 117究极反击（复仇）概率
    "-1",	-- 118究极反击（复仇）伤害倍数
    "artword_fanji",	-- 119究极反击（复仇）效果（用于程序表现效果）
    "artword_87",	-- 120被治疗率增加
    "-1",	-- 121伤害吸收2（第2套动画+飘字）
   "artword_asbh",	-- 122庇护2（第2套庇护动画+飘字，情人节贝吉塔【爱神庇护】专用）   
   "artword_116",	-- 123小技能伤害降低
   "artword_117",	-- 124被治疗率增加
   "artword_125",	-- 125复活概率降低
   "-1",	-- 126增加计数器
   "-1",	-- 127减少计数器
   "-1",	-- 128清空计数器
   "artword_129",	-- 129停滞（石化2）
   "artword_33",	-- 130降低吸血率
   "artword_131",	-- 131生命链接
   "artword_133",	-- 132添加惩戒爪击
   "artword_134",	-- 133减少惩戒爪击
   "artword_135",	-- 134清空惩戒爪击
   "-1",	-- 135神罚（复仇）概率
   "-1",	-- 136神罚（复仇）伤害倍数
   "artword_132",	-- 137神罚（复仇）效果（用于程序表现效果）
   "artword_136",	-- 138伤害吸收3悟吉塔·极意形态专用【神罚气盾】
}

-- 战斗buff光效索引对照表
_battle_buff_animation_dictionary = {
	-- effect id       buff type
	{"-1"},	-- 0为攻击
	{"-1"},	-- 1为加血
	{"-1"},	-- 2为加怒
	{"-1"},	-- 3为减怒
	{"-1"},	-- 4为禁怒
	{"5", 1, {"standby"}, {{2,222},{2,222},{2,222},{2,222}}},	-- 5为眩晕
	{"-1"},	-- 6为中毒
	{"7", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 7为麻痹
	{"8", 1, {"standby"}, {{-8,100},{-8,100},{-8,100},{-8,100}}},	-- 8为封技
	{"9", 1, {"standby"}, {{0,20},{0,20},{0,20},{0,20}}},	-- 9为燃烧
	{"-1"},	-- 10为爆裂
	{"-1"},	-- 11为增加档格
	{"12", 3, {"start", "standby", "byattack"}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}},	-- 12为无敌
	{"-1"},	-- 13为必闪
	{"-1"},	-- 14为吸血
	{"-1"},	-- 15禁疗
	{"-1"},	-- 16盲目
	{"18", 1, {"standby"}, {{0,20},{0,20},{0,20},{0,20}}},	-- 17冰冻
	{"-1"},	-- 18备用
	{"-1"},	-- 19备用
	{"-1"},	-- 20备用
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 21增加攻击
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 22降低攻击
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 23增加防御
	{"-1"},	-- 24降低防御
	{"-1"},	-- 25受到的伤害增加
	{"-1"},	-- 26受到的伤害降低
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 27增加暴击
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 28增加抗暴
	{"-1"},	-- 29增加命中
	{"-1"},	-- 30增加闪避
	{"-1"},	-- 31持续回血
	{"-1"},	-- 32清楚负面效果
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 33造成的伤害增加
	{"-1"},	-- 34全体秒杀
	{"-1"},	-- 35固定伤害
	{"-1"},	-- 36降低治疗效果
	{"-1"},	-- 37溅射
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 38增加格挡强度
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 39降低格挡率
	{"-1"},	-- 40增加吸血率
	{"-1"},	-- 41反弹
	{"-1"},	-- 42小技能触发概率
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 43增加破格挡率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 44增加反弹率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 45增加伤害减免
	{"-1"},	-- 46废弃
	{"-1"},	-- 47降低小技能触发概率
	{"-1"},	-- 48降低暴击伤害
	{"-1"},	-- 49减少造成的必杀伤害
	{"50", 2, {"start", "standby"}, {{2,100},{17,100},{25,100},{21,180}}, {{2,100},{17,100},{25,100},{21,180}}},	-- 50嘲讽
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 51降低伤害加成
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 52增加伤害加成
	{"-1"},	-- 53增加控制率
	{"-1"},	-- 54增加造成的必杀伤害
	{"-1"},	-- 55减少必杀伤害率
	{"-1"},	-- 56降低怒气回复速度
	{"-1"},	-- 57提高怒气回复速度
	{"-1"},	-- 58增加暴击伤害
	{"-1"},	-- 59--
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 60增加暴击强度
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 61降低伤害减免
	{"-1"},	-- 62增加必杀伤害率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 63增加格挡率
	{"-1"},	-- 64增加忍者类型克制伤害加成
	{"-1"},	-- 65增加忍者类型克制伤害减免
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 66降低暴击率
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 67降低抗暴率
	{"-1"},	-- 68增加必杀抗性
	{"-1"},	-- 69减少必杀抗性
	{"-1"},	-- 70复活概率
	{"-1"},	-- 71复活继承血量
	{"-1"},	-- 72复活继承怒气
	{"-1"},	-- 73增加复活复活概率
	{"-1"},	-- 74增加复活继承血量
	{"-1"},	-- 75被复活概率
	{"-1"},	-- 76被复活继承血量
	{"-1"},	-- 77被复活继承怒气
	{"-1"},	-- 78免疫控制
	{"79", 3, {"start", "start", "start", "standby", "byattack"}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}},	-- 79为复活
	{"-1"},	-- 80小技能伤害提升
	{"81", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--81放逐效果
	{"82", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	--82虚弱效果
	{"83", 1, {"standby"}, {{0,180},{0,180},{0,180},{0,180}}},	--83混乱效果
	{"84", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--84石化效果
	{"-1"},	-- 85增加复仇概率
	{"-1"},	-- 86增加复仇伤害
	{"87", 1, {"start"}, {{0,0},{0,0},{0,0},{0,0}}},	--87复仇闪电
	{"88", 1, {"start"}, {{0,180},{0,180},{0,180},{0,180}}},	--88魅惑效果
	{"-1"},	-- 89增加复仇概率
	{"-1"},	-- 90增加复仇伤害
	{"89", 1, {"start"}, {{0,0},{0,0},{0,0},{0,0}}},	--91复仇闪电
	{"-1"},	-- 92真实伤害
	{"-1"},	-- 93控制真实伤害承受者目标
	{"-1"},	-- 94治疗率增加
	{"-1"},	-- 95免控率上升
	{"92", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 96弱感电
	{"93", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 97强感电
	{"-1"},	-- 98增加复仇概率
	{"-1"},	-- 99增加复仇伤害
	{"94", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--100复仇闪电
	{"-1"},	-- 101禁止神兽使用X回合shi
	{"-1"},	-- 102增加复仇伤害
	{"-1"},	-- 103增加复仇概率
	{"-1"},	-- 104增加复仇伤害
	{"-1"},	-- 105增加复仇概率
	{"95", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	--106虚化
	{"-1"},	-- 107禁止神兽使用X回合shi
	{"-1"},	-- 108无视属性
	{"-1"},	-- 109无视属性
	{"-1"},	-- 110无视属性
	{"-1"},	-- 111无视属性
	{"-1"},	-- 112无视属性
	{"96", 1, {"standby"}, {{0,70},{0,70},{0,70},{0,70}}},-- 113须佐外衣（庇护）
	{"-1"},	-- 114控制率降低
	{"-1"},	-- 115神兽伤害减免
	{"97", 1, {"standby"}, {{0,-40},{0,-40},{0,-40},{0,-40}}},	-- 116完全体尾兽化（伤害吸收）
	{"-1"},	-- 117究极反击（复仇）概率
	{"-1"},	-- 118究极反击（复仇）概率
	{"98", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},-- 119究极反击（复仇）概率
	{"99", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},-- 120睡眠
	{"121", 1, {"standby"}, {{0,80},{0,80},{0,80},{0,80}}},	-- 121伤害吸收2（第2套动画+飘字）
	{"101", 1, {"standby"}, {{0,10},{0,10},{0,10},{0,10}}},	-- 122庇护2（第2套庇护动画+飘字，情人节贝吉塔【爱神庇护】专用）   
	{"-1"},	-- 123小技能伤害降低
	{"-1"},	-- 124被治疗率增加
	{"-1"},	-- 125复活概率降低
	{"-1"},	-- 126增加计数器
	{"-1"},	-- 127减少计数器
	{"-1"},	-- 128清空计数器
	{"129", 1, {"standby"}, {{0,-40},{0,-40},{0,-40},{0,-40}}},	--129停滞（石化2）
	{"-1"},	-- 130降低吸血率
	{"131", 1, {"standby"}, {{0,100},{0,100},{0,100},{0,100}}},	-- 131生命链接
	{"-1"},	-- 132添加惩戒爪击
	{"-1"},	-- 133减少惩戒爪击
	{"-1"},	-- 134清空惩戒爪击
	{"-1"},	-- 135神罚（复仇）概率
	{"-1"},	--136神罚（复仇）伤害倍数
	{"98", 1, {"standby"}, {{0,50},{0,50},{0,50},{0,50}}},	-- 137神罚（复仇）效果（用于程序表现效果）
	{"132", 1, {"standby"}, {{0,100},{0,100},{0,100},{0,100}}},	-- 138伤害吸收
}

-- 戰鬥buff光效头像索引對照表
_battle_buff_head_animation_dictionary = {
	["81"] = {"head_81", 1, {"standby"}, {{-20,0},{-20,0},{-20,0},{-20,0}}},
}

-- 计数器光效配置
_battle_buff_counter_animation = {
	["1-1"] = {"2001", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-2"] = {"2002", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-3"] = {"2003", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-4"] = {"2004", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-5"] = {"2005", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-6"] = {"2006", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-7"] = {"2007", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-8"] = {"2008", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["1-9"] = {"2009", 1, {"standby"}, {{0,260},{0,260},{0,260},{0,260}}},
	["2-1"] = {"1001", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-2"] = {"1002", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-3"] = {"1003", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-4"] = {"1004", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-5"] = {"1005", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
	["2-6"] = {"1006", 1, {"standby"}, {{0,250},{0,250},{0,250},{0,250}}},
}

tipStringInfo_mine_info = {
	"下線",	--1
	"月",--2
	"周",--3
	"天",--4
	"小時",--5
	"分鐘",--6
	"%s忍者",--7
	"%s特產",--8
	"%s簡介",--9
	"(巡邏據點時有幾率獲得)",--10
	"巡邏據點中",	--11
	"巡邏據點完畢",	--12
	"下次收益時間:",--13
	"好友|x|擊潰了侵略者，你獲得了|y|",----------------------------14
	"玩耍%d小時後，",------------------------------------------------------15
	"|x|悠閒的完成了巡視工作，獲得了|y|",------------------------16
	"本次巡邏據點完成，好多獎勵啊！",------17
	"在門主人的關愛下大夥兒都過得非常滋潤，請收下獎勵！",-----18
	"主人加油，我去巡邏據點了！",-----19
	"你放心去戰鬥吧，這裡就交給我啦！",--20
	"x%d進行%d小時",--21
	"的%s嗎？",--22
	{"悠閒的巡邏","認真的巡邏","全力的巡邏"},--23
	"[%s]",--24
	"不要隨意進入好友的據點！",--25 -- 未开启或非防守据点状态下
	"多謝出手相助！這些禮品就送給你啦！",--26 --镇压后获得奖励提示语
	"級",--27
	"已有據點：",--28
	"巡邏據點中的位置：",--29
	"被偷襲的據點：",--30
	"當前沒有好友開啟法易路島，是否前往添加好友",--31
	"上線", --32
	}
--MineManagerFriendList

tipStringInfo_mine_patrol_color = {
	{255,238,94},	----1 时间颜色
	{255,255,255},	----2 普通的描述文字颜色
	{255,44,9},	----3 暴动的描述文字颜色
	{84,255,9},	----4 镇压的描述文字颜色
	{255,228,176},	----5 结束后的描述文字颜色
	{255,246,0},	----6 收益倒计时的颜色
	{255,255,255},	----7 收益倒计时标题的颜色
}

-- 侵略者中 界面刷新请求的间隔时间.单位是秒
tipStringInfo_betrayArmy_request_refresh_interval = 5*60
tipStringInfo_betrayArmy_info = {
	"今日可買%d次",	--1
	"戰功不足",--2
	"已達購買上限",--3
	"紅色忍者精華數量不足",--4
	"成長石數量不足",--5
}

numberToStringArg = {
	"1",
	"2",
	"3",
	"4",
	"5",
	"6",
	"7",
	"8",
	"9",
	"十",
	"百",
	"千",
	"0"
}

--战斗内的1到3档的速度
-- Fury (V2, 2026-09-23): 4-6 son las marchas VIP x4/x5/x6. El valor se
-- guarda en userFightSpeed y el combate recupera la marcha BUSCANDOLO en esta
-- tabla (FightUI.lua), asi que cada marcha necesita un valor DISTINTO.
_fight_run_speed = {
	0.72,--第一档的速度-0.85
	0.62,--第二档的速度-0.66
	0.4,--第三档的速度-0.6
	0.39,--x4 (VIP)
	0.38,--x5 (VIP)
	0.37,--x6 (VIP)
}
-- Escala del planificador en cada marcha del combate (FightUI.lua).
-- Fabrica (client_original): 1.29/1.7/2.0/2.5; 5 y 6 seguian el paso de +0.5.
-- 3-oct-2026: todas +10 % (2 decimales). Las 4-6 se abren por VIP (FuryGameSpeed.lua).
_fight_time_scale = {
	1.42,--第一档的速度
	1.87,--第二档的速度
	2.2,--第三档的速度
	2.75,--x4 (VIP)
	3.3,--x5 (VIP)
	3.85,--x6 (VIP)
}

-- Fury (V2/V3): aviso del boton de velocidad y rotulo del ajuste de velocidad
_fury_speed_text = {
	"戰鬥速度x%d在VIP%d解鎖",
	"遊戲速度x%s",
}

--战斗内武将的成长缩放比利
_fight_evolution_scales = {
	1,--1级
	1,--2级
	1,--3级
	1,--4级
}

tipStringInfo_time_info = {
	"年",	--1
	"月",	--2
	"周",	--3
	"天",	--4
	"小時",	--5
	"分鐘",	--6
	"秒",	--7
	"剛剛",	--8
	"之前",	--9
	"日",	--10
	"時",	--11
	}


-- Vip等级上限控制
_vip_max_grade = {
	20,
	}

-------------------------是否显示分享(0隐藏，1显示)
open_share_fun = 0

-------------------------分享描述文字
share_text = {
	{1,"邀請好友","我在玩最熱血的格鬥手遊《龍虎門》，連擊爽到爆！我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},------------------------------------------
	{2,"通關主線副本第1章","哈哈哈，天下無敵也不是我的對手，我剛剛成功通關了《龍虎門》第1章，我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},----------------------------
	{3,"演武場殺入前1000名","有志者事竟成！經過不懈努力，我終於殺到《龍虎門》演武場前1000名了！我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},------------------------------
	{4,"獲得橙色忍者","《龍虎門》的橙色忍者果然給力！我剛得到一名強力橙色忍者，我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},------------------
	{5,"主角達到30級","才一眨眼的功夫我的《龍虎門》主角就升到30級了？超爽啊！我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},-------------------------------
	{6,"通關主線副本第8章","我剛剛跟龍虎三皇一起擊敗了大龍頭！不信？快來《龍虎門》看看吧！我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},--------------------------------
	{7,"主角達到50級","我的《龍虎門》主角升到50級了！戰力更上一層樓！我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},-----------------------------
	{8,"演武場達到第1名","跪下膜拜吧！本座已經登頂演武場最強之位！快來《龍虎門》一睹我的風采吧！我叫%s，我在%s服，別說我沒告訴你哦，一起來耍吧！"},-------------------------
}

_learn_skill_str ={
	{"以柔克剛","靈活多變","至剛至陽","無堅不摧","攻防兼備","虛實莫測","樸實無華","出其不意"},
	{"無事件相同","1對事件相同","2對事件相同","3事件相同","3帶2事件相同","4事件相同","5事件相同"}
}

_user_pic_index = {
}
_user_pic_index["200101"] = 200101
_user_pic_index["200201"] = 200201
_user_pic_index["200104"] = 200104
_user_pic_index["200203"] = 200203
push_close_class = 
{
	"CampaignClass",
	"DestinySystemClass",
	"HeroRecruitListViewClass",
	"ShopClass",
	"RefiningFurnaceClass",
	"LearingSkillsDevelopClass",
	"ActivityWindowClass",
	"HeroShopClass",
	"OpenServerActivityClass",
	"SevenDaysManagerClass",
	"RechargeDialogClass",
	"LPVEMapClass",
	"HeroStorageClass",
	"PropStorageClass",
	"EmailManagerClass",
	"FameHallClass",
	"FriendManagerClass",
	"PropStorageClass",
	"ArenaClass",
	"PlunderClass",
	"TrialTowerClass",
	"WorldBossClass",
	"HeroDevelopClass",
	"FormationTigerGateClass",
	"DailyTaskClass",
	"CaptureResourceClass",
	"EquipStrengthenRefineStrorageClass",
	"LDuplicateWindowClass",
}
csb_cacher_path = {
	--{1,"activity/7days/week_Activities_list.csb","6","七日活动"},
	--{2,"activity/DailyTasks/dailytasks_list.csb","8","日常任务"},
	--{3,"activity/wonderful/daily_attendance_list.csb","8","签到"},
	--{4,"activity/wonderful/landed_gifts_list.csb","6","累积充值"},
	--{5,"activity/wonderful/open_service_fund_list.csb","6","开服基金"},
	--{6,"activity/wonderful/share_weixin_list.csb","6","微信分享"},
	{7,"campaign/ArenaStorage/ArenaStorage_list_role.csb","10","演武场主"},
	--{8,"campaign/ArenaStorage/ArenaStorage_ranking_list.csb","6","演武场排行榜"},
	--{9,"campaign/ArenaStorage/ArenaStorage_shop_list.csb","6","演武场商店"},
	--{10,"campaign/Snatch/indiana_list.csb","6","抢夺宝物界面"},
	--{11,"campaign/Snatch/snatch_results_list.csb","6","夺5次结算列表"},
	--{12,"campaign/TrialTower/trial_tower_list_list.csb","6","无限山排行榜"},
	--{13,"campaign/TrialTower/trial_tower_raids_list.csb","6","一键三星结算列表"},
	--{14,"campaign/TrialTower/trial_tower_raids_list_1.csb","6","一键三星结算列表2"},
	--{15,"campaign/TrialTower/trial_tower_shop_list.csb","6","无限山商店"},
	--{16,"campaign/WorldBoss/worldBoss_ranking_list.csb","6","光丘守护界面排行榜"},
	--{17,"campaign/WorldBoss/worldBoss_ranking_list_1.csb","6","光丘守护界面排行榜2"},
	--{18,"campaign/WorldBoss/worldBoss_reward_list.csb","6","功勋奖励列表"},
	--{19,"campaign/WorldBoss/worldBoss_shop_list.csb","6","功勋商店列表"},
	--{20,"duplicate/mopping_results_list.csb","6","扫荡列表"},
	--{21,"duplicate/pve_leaderboard_list.csb","6","副本排行榜"},
	--{22,"duplicate/pve_duplicate_k.csb","8","副本"},
	--{23,"email/email_list.csb","6","邮件列表"},
	--{24,"friend/friend_list.csb","6","好友列表"},
	--{25,"friend/friend_tuijian_list.csb","6","推荐好友列表"},
	--{26,"list/list_daoju_1.csb","8","商城道具列表"},
	--{27,"list/list_equipment_1.csb","8","装备仓库列表"},
	--{28,"list/list_equipment_sui_1.csb","8","装备碎片列表"},
	--{29,"list/list_equipment_Wear_1.csb","8","装备穿戴列表"},
	--{30,"list/list_property_1.csb","8","包裹界面"},
	--{31,"list/list_libao.csb","6","商城礼包列表"},
	--{32,"packs/HeroStorage/list_generals_big.csb","10","忍者仓库列表"},
	--{33,"shop/package_preview_list.csb","6","礼包预览列表"},
	--{34,"shop/shop_chongzhi_list.csb","6","充值列表"},
	--{35,"shop/HeroShop/heroShop_list.csb","6","神秘商店列表"},
	--{36,"skills/skills_list_line_list.csb","4","更换技能列表"},
	--{37,"skills/skills_list_xx_list.csb","4","学习技能列表"},
	--{38,"system/famous_rank_list.csb","4","大师榜排行榜列表"},
	--{39,"system/Atlas_list.csb","6","图鉴列表"},
	--{40,"icon/item_big.csb","12","图标icon"},
	--{41,"formation/line_up_icon_up.csb","4","忍者列表图标icon"},
	--{42,"campaign/Snatch/snatch.csb","2","宝物抢夺"},
	--{43,"secret_society/secret_map_icon.csb","30","资源抢夺"},
	--{44,"system/raiders_xzs_right.csb","5","攻略"},
}


--应用推送信息 格式: 时间 "12-30","内容","每天推送次数","类型","设置中的标题"
_app_push_notification = {
	--{"24-0"," Ninjas are longing for power up, they need you!! "},	----长时间未登录推送
	--{"12-0","It is time for Lunch!"},	----领体力12点
	--{"18-0","It is time for Supper!"},	----领体力18点
	{"9-00","美好的一天要從一樂拉麵開始！","1","1","領取體力1"},	--------9点领取能量
	{"12-00","午飯時間到了，美味的一樂叉燒拉麵已準備好！","1","2","領取體力2"},	--------12点领取能量
	{"18-00","晚餐清淡一點吧，就點一碗一樂素拉麵！","1","3","領取體力3"},	--------18点领取能量
	{"21-00","美好的夜宵時間，當然還是一樂！","1","4","領取體力4"},	--------21点领取能量
}

chat_sent_string = 
{
	"暱稱不可為空", ---------------------1
	"請輸入聊天內容", ---------------------2
	"請輸入暱稱:", ---------------------3
	"請輸入文字:", ---------------------4
	"文字過多無法發送", ---------------------5
	"請輸入資訊:", ---------------------6
	"請輸入好友名稱", ---------------------7
	"請輸入玩家名稱", ---------------------8
	"豪氣沖天給大家贈送了拼手氣紅包，大家速度來搶，手速慢就沒了喔", ---------------------9
	"獲得銅幣", ---------------------10
	"您的手速太慢了，紅包已經被搶完啦！", ---------------------11
	"您已搶過該紅包了！", ---------------------12
	"獲得代金券", ---------------------13
	"請不要重複發言", ---------------------14
	"聊天時間間隔太短", ---------------------15
	"內容含有非法字元，請修改", ---------------------16
	"不能贈送給自己", ---------------------17
	"確定",                        ---------------------18
	"請輸入聊天內容",             ---------------------19繁体包这个为繁体2为简体
	"請輸入玩家名稱",            -----------------20繁体包这个为繁体8为简体
}

---------【数码宝贝】资源加载时的提示文字
tipStringInfo_loading_notice_info = {
	"小提示：木葉飛舞之處，火亦生生不息！",					----  1
	"小提示：戰鬥中連續擊打敵人，忍者可獲得攻擊加成喔！",						----  2
	"小提示：這大概就是青春吧！",						----  3
	"小提示：選擇正確的連擊順序會大幅提高戰鬥傷害",					----  4
	"小提示：去組個強力的忍者小隊吧！",							----  5
	"小提示：每天登陸後的第一件事是領取簽到獎勵",								----  6
	"小提示：鳴人和佐助，誰更厲害呢？",					----  7
	"小提示：忍者等級不能超過玩家角色等級",			----  8
	"小提示：合理佈陣讓戰鬥、生活、撩妹更輕鬆",			----  9
	"小提示：我在人生的道路上迷失了方向",				---- 10
	"小提示：完成日常任務可以獲得大量隊伍經驗",				---- 11
	"小提示：忍者武器覺醒後會有大幅提高奧義效果",					---- 12
	"小提示：注意角色間的屬性相剋，不要老罵策劃啊！",				---- 13
	"小提示：啟動忍者之間的羈絆關係會更加強大",		---- 14
	"小提示：每天登陸都有一次免費招募機會",		---- 15
	"小提示：活動副本可以掉落大量銅幣和經驗道具",		---- 16
	"小提示：強化裝備可以快速提升戰鬥力",		---- 17
	"小提示：組織戰決賽為淘汰賽制，大家都要拼盡全力喲！",		---- 18
	"小提示：合理釋放策略技能可以使戰鬥過程更加順利",		---- 19
	"小提示：裝備進階可以快速獲得戰力提升",		---- 20
}

--------------------------------小助手推荐忍者配置(小头像ID,名称,品质|小头像ID,名称,品质|……)
tipStringInfo_strategy_formation = {
	{337, "1031,石黑龍,4|1049,金羅漢,4"},											--病毒种
	{338, "1034,韋陀,4|1040,碎骨門主,4|1057,劍魔連城,4|1065,金鵬,4"},					--疫苗种
	{339, "1037,奪命老妖,4|1046,烈陽神,4|1050,毒將軍,4|1063,翼龍,4"},					--数据种
	{340, "1035,小佩,4|1044,華九公,4|1051,藥神明鏡,4|1058,參聖,4"},						--其他
}
tipStringInfo_union_dynamic_color = {
	{255,242,94},	----1 时间颜色
	{255,244,183},	----2 普通的描述文字颜色
	{191,255,38},	----3 成员名称颜色
	{255,150,0},	----4 舰队经验颜色
	{255,0,0},	--------5 副本NPC颜色
	{5,240,255},	----6 祭天颜色-绿色简单
	{25,149,255},	----7 祭天颜色-蓝色普通
	{219,23,255},	----8 祭天颜色-紫色豪华
}
tipStringInfo_union_zhuangxiu_color = {
	{93,56,24},	----1 普通文字描述-黑色
	{205,5,0},	----2 成员名称颜色-红色
	{199,80,0},	----3 数值颜色
	{0,164,27},	----4 祭天颜色-绿色简单
	{19,119,204},	----5 祭天颜色-蓝色普通
	{161,12,188},	----6 祭天颜色-紫色豪华
}

tipStringInfo_union_str = {			-- 组织文字
	"內部公告",-------------------------------------------- 1
	"組織宣言",---------------------------------- 2
	"這是您自己",-------------------------------------------- 3
	"成員%s進行[%s]，為組織增加%s點經驗",-------------------------------------------- 4
	"成員%s在[%s]時腦洞大開觸發暴擊，為組織增加%s點經驗",-------------------------------------------- 5
	"成員%s加入組織，跟成員們打個招呼吧！",-------------------------------------------- 6
	"成員%s被逐出組織",-------------------------------------------- 7
	"首領%s由於長期不作為被成員%s彈劾，恭喜%s成為新的首領",-------------------------------------------- 8
	"成員%s被任命為副首領，大家熱烈歡迎！",-------------------------------------------- 9
	"大家齊心協力，擊殺[%s],為組織增加了%s點經驗",-------------------------------------------- 10
	"眾團員齊心協力，擊破[%s]，快去領取通關獎勵吧！",-------------------------------------------- 11
	"成員%s退出了組織",-------------------------------------------- 12
	"初級建設",-------------------------------------------- 13
	"普通建設",-------------------------------------------- 14
	"高級建設",-------------------------------------------- 15
	"組織%d級可購買",----------------------------------------16
	"已達購買上限",  ----------------------------------------17
	"今日可買%d次",  ----------------------------------------18
	"可購買%d次",  ----------------------------------------19
	"組織剩餘%d件",  ----------------------------------------20
	"請選擇組織標誌標誌",  ----------------------------------------21
	"請輸入組織名稱",  ----------------------------------------22
	"玄鐵寶箱",-------------------------------------------- 23
	"青銅寶箱",-------------------------------------------- 24
	"白銀寶箱",-------------------------------------------- 25
	"黃金寶箱",-------------------------------------------- 26
	"達到%s點組織貢獻即可領取獎勵",-------------------------------------------- 27
	"您已經領取過該獎勵了！",-------------------------------------------- 28
	"成員%s進行[%s]，增加%s點貢獻進度，為組織增加%s經驗",-------------------------------------------- 29
	"只有你一人時才能解散組織",-------------------------------------------- 30
	"確定要解散組織嗎？",-------------------------------------------- 31
	"您已成功解散組織",-------------------------------------------- 32
	"只有首領和副首領可以修改戰鼓標誌",-------------------------------------------- 33
	"組織等級不足，無法更換",-------------------------------------------- 34
	"未上榜",-------------------------------------------- 35
	"貢獻值不足",-------------------------------------------- 36
	"名稱中包含敏感字元",-------------------------------------------- 37
	"確定取消申請組織？",-------------------------------------------- 38
	"確定花費%s金幣創建組織？",-------------------------------------------- 39
	"恭喜您創建組織成功，快去召集成員加入吧！",-------------------------------------------- 40
	"您今日已建設過了，請明日再來！",-------------------------------------------- 41
	"花費一點銅幣就可以進行建設！",-------------------------------------------- 42
	"花費少量金幣就可以進行建設！",-------------------------------------------- 43
	"這是成長最快的建設方式！",-------------------------------------------- 44
	"VIP等級達到2級可開啟",-------------------------------------------- 45
	"需要先轉讓首領之位元才能退出組織",-------------------------------------------- 46
	"確定離開組織？",-------------------------------------------- 47
	"今日無人建設",-------------------------------------------- 48
	"確認解散組織？你可以做的更好",-------------------------------------------- 49
	"是否花費%s金幣購買%s",-------------------------------------------- 50
	"輸入內容不能為空",-------------------------------------------- 51
	"您已被逐出組織",-------------------------------------------- 52
	"首領之位已移交給%s，讓%s帶領大家繼續前進吧！", ---------------------------53
	"成員%s被任命為副首領", ----------------------------------54
	"副首領%s被罷免職位", ----------------------------------55
	"最多輸入%s字",----------------------------------56
	"沒有更多組織了", ----------------------------------57
	"確認逐出成員", ----------------------------------58
	"該據點尚未開啟", ----------------------------------59
	"放置於", ----------------------------------60
	"明", ----------------------------------61
	"暗", ----------------------------------62
	"資訊不明", ----------------------------------63
	"您許可權不足", ----------------------------------64
	"備戰中", ----------------------------------65
	"戰鬥中", ----------------------------------66
	"休戰中", ----------------------------------67
	"領取成功", ----------------------------------68
	"暫未加入組織", ----------------------------------69
	"剩餘組織貢獻不足", ----------------------------------70
	"報名成功", ----------------------------------71
	"陣容保存成功", ----------------------------------72
	"比賽中無法更換陣容", ----------------------------------73
	"至少放置1個忍者", ----------------------------------74
	"忍者上陣數量超過上限", ----------------------------------75
	"比賽中無法查看昨日戰況", ----------------------------------76
	"組織全部成員被擊敗，組織戰結束",---------------------------77
	"第%d輪比賽結束，成功進入下一輪",---------------------------78
	"組織戰結束，獎勵將在21:30準時發放~",---------------------------79
	"僅限攻型忍者參賽",		--------------------------80
	"僅限防型忍者參賽",		--------------------------81
	"僅限技型忍者參賽",		--------------------------82
	"所有忍者可參賽",			--------------------------83
	"所有忍者可參賽",			-------------------------84
	"第%d場",			-------------------------85
    "報名時間:10:00-20:50，比賽開始時間21:00",			-------------------------86
    "您組織未進入本週組織戰總排行前8，無法參加決賽",			-------------------------87
    "隊",			-------------------------88
    "剩餘人數:",			-------------------------89
    "最大連勝:",			-------------------------90
    "連勝場數:",			-------------------------91
    "總積分:",			-------------------------92
    "當前排名:",			-------------------------93
    "報名人數:",			-------------------------94
    "今天比賽已結束，請明天繼續參加",			-------------------------95
    "本輪組織戰已結束，請等待下一輪組織戰！",			-------------------------96
	"參賽限定：只限%|4|!x@%忍者參賽，每隊%|4|!y@%個，共%|4|!z@%隊",			-------------------------97
	"參賽限定：所有忍者可參賽，每隊%|4|!x@%個，共%|4|!y@%隊",			-------------------------98
	"攻型",			-------------------------99
	"防型",			-------------------------100
	"技型",			-------------------------101		
    "請先加入組織",			-------------------------102
    "戰場情況（當前戰場：1）",			-------------------------103
    "戰場情況（當前戰場：2）",			-------------------------104
    "戰場情況（當前戰場：3）",			-------------------------105
    "%s打敗了%s，獎勵將在21:30準時發放~",			-------------------------106
    "組織無人參賽",			-------------------------107
    "貴組織無人參賽，獎勵將在21:30準時發放~",			-------------------------108
    "由於%s組織該戰場人數為0，自動判負！%s打敗了%s",			-------------------------109
    "組織等級到達3級開啟",			-------------------------110
	"報名",			-------------------------111
	"已報名",			-------------------------112
	"還沒有加入組織",			-------------------------113
	"該戰場您未被相符到",			-------------------------114
}

_union_info = {
	"組織功能介紹",
	"1.組織成員上限：Lv1-30、Lv2-32、Lv3-34……",
	"2.組織等級提升：組織經驗可用於提升組織等級，可透過組織副本和捐獻獲得組織經驗。",
	"3.組織等級提升後可以開啟新的組織副本，提高建設進度獎勵，在組織商店中也會開放更多獎勵道具。",
	"4.成員可以從組織建設和組織副本中獲得組織貢獻，組織貢獻可以在組織商店中購買各種道具。",
	"5.組織貢獻：可透過組織副本和組織捐獻獲得，可在組織商店購買道具。",
	"6.組織首領：組織成員少於10人時，首領可解散組織；首領最多可任命2名副首領，首領和副首領均享有以下權限：審核新成員、踢出成員、編輯組織公告和宣言等。",
	"7.組織成員：加入後24小時內不可被踢出。",
	"8.創建組織7日內，組織成員數不足3人，並且組織等級為1級時，組織會自動解散。",
	"組織建設",
	"1.建設模式：初級建設、普通建設和高級建設。組織成員每天可選擇一種模式進行建設。",
	"2.建設過程中，有機率觸發增益，獲得150%組織貢獻和組織經驗（額外加成不計入進度）",
	"3.組織進度到達對應要求後，全體組織成員均可領取建設進度獎勵。",
	"4.組織等級越高，建設進度獎勵越豐厚。",
	"5.需注意，每天24:00系統會自動清空當天的建設進度獎勵。",
	"6.每天的建設次數不能超過組織成員數上限。",
}



--打开可能获得装备碎片的道具ID
can_get_some_equip_patch =
{
	52,
	53,
	54,
	55,
	56,
	57,
	58,
	59,
	60,
	64,
	65,
	66,
	75,
	84,
	85,
	86,
}


------------擂台赛
warcraft_tip = {
	"未上榜",-----------------1
	"達到%s即可領取",---------2
	"達到%s即可購買",---------3
	"虛位以待",---------------4
	"比賽時間:%s-%s",---------5
	"刷新對手",---------------6
	"刷新挑戰次數",-----------7
	"距離擂臺賽結束還剩",----------------------8
	"本屆已結束，還請主人下次再戰！",----------9
	"王者",-------------10
	"霸者",-------------11
	"勇者",-------------12
	"總積分：",-------------13
	"總勝點：",-------------14
	"剩餘時間：",-------------15
	"開啟時間：",-------------16
	"已結束",-------------17
	"進入擂臺賽",-------------18
	"時辰未到",-------------19
	"刷新需消耗%s金幣",-------------20
	"普通賽",-------------21
	"進級賽",-------------22
	"定段賽",-------------23
	"免費次數：",-------------24
	"%s登錄領取",-------------25
	"達到%d連勝即可領取",-------------26
	"無名之輩",-------------27
	"購買10次挑戰次數",-------------28
}
---------------擂台赛提示框
_warcraft_states_string_info = {
	"晉升成功",
	"晉升失敗",
	"掉段懲罰",
	"晉升賽",
	"恭喜由%s晉升至%s！",
	"晉升比賽失敗，當前積分清零，還請您重頭來過！",
	"由於您連續挑戰失敗，導致勝點低於段位要求，因此由%s降至%s！",
	"積分和勝點均已達到晉升要求，\n贏得三局兩勝或五局三勝的晉升賽\n即可成功晉升！",
}
--中文数字
chinese_num = {
	"1",		--1
	"2",		--2
	"3",		--3
	"4",		--4
	"5",		--5
	"6",		--6
	"7",		--7
	"8",		--8
	"9",		--9
	
}
---------时装
tipStringInfo_fashion_str = {
	"成功強化至%s級", -----------------------------------------1
	"換裝成功", -----------------------------------------------2
	{77,77,77}, -------------------------------------------3
}

tipStringInfo_treasure_seat_str = {
	"[攻擊]", -----------------------------------------1
	"[防禦]", -----------------------------------------------2
	"裝備於", -------------------------------------------3
	"已裝備", -------------------------------------------4
}
---------------跃迁
_awaken_tipString_info = {
	"星", -----------------------------------------1
	"級", -----------------------------------------2
	"合成成功", -----------------------------------3
	"分解躍遷道具", -------------------------------4
	"進階至", -------------------------------------5
	"恭喜進階成功！", -----------------------------6
	"50級開啟", -----------------------------------7
	"50級以上的忍者纔可進行進階", ---------------8
	"忍者等級不足", -----------------------------9
	"躍遷已達到滿級", -----------------------------10
	"需求等級：%s/%s", ----------------------------11
	"恭喜裝備成功！", -----------------------------12
	"一星", ---------------------------------------13
	"二星", ---------------------------------------14
	"三星", ---------------------------------------15
	"（4回合內通關）", -----------------------------16
	"（8回合內通關）", -----------------------------17
	"（20回合內通關）", -----------------------------18
	"橙將或者紅將才能躍遷", ---------------19
}

red_alert_all_str = 
{
	"分解忍者，獲取忍魂",							------------------1
	"獲取高階裝備碎片，返還強化銅幣和鑲嵌的金幣", 	------------------2
	"分解戰馬，獲取隨機馬魂", 						------------------3
	"獲取兵符石，返還所有精煉材料", 				------------------4
	"選擇後分解所有對應品質的%s",					------------------5
	"消耗碎片,合成",								------------------6
	"請先選擇碎片",									------------------7
	"獲得",											------------------8
	"攻擊增加",										------------------9
	"兵力增加",										------------------10
	"物防增加",										------------------11
	"術防增加",										------------------12
	"級",											------------------13
	"第%s次",										------------------14
	"服",											------------------15
	"已上陣",										------------------16
	"已裝備",										------------------17
	"(擁有:%s)",									------------------18
	"基礎",											------------------19
	"強化",											------------------20
	"所有忍者(%s)",									------------------21
	"前排忍者(%s)",									------------------22
	"中排忍者(%s)",									------------------23
	"後排忍者(%s)",									------------------24
	"商品已售罄",									------------------25
	"需要的碎片數量不足",							------------------26
	"包裹中沒有對應的材料",							------------------27
	"升星成功",										------------------28
	"材料不足",										------------------29
	"進階成功",										------------------30
	"需要啟動所有星格",								------------------31
	"請輸入角色名",									------------------32
	"沒有可穿戴的裝備",								------------------33
	"沒有可以更換的裝備",							------------------34
	"未穿戴裝備",									------------------35
	"招募令不足",									------------------36
	"下次免費時間未到",								------------------37
	"獸魂不足",										------------------38
	"已達購買上限",									------------------39
	"忍者受到的傷害減少%s%%，造成的傷害增加%s%%", 	------------------40
	"%s在%s發佈了召集令,是否前往？",				------------------41
	"%s在據點【%s】將我擊敗",						------------------42
	"未入榜",										------------------43
	"購買氣勢值成功",									------------------44
	"請先參加勢力戰",									------------------45
	"復活CD時間中",									------------------46
	"交戰中據點無法撤離",							------------------47
	"正在移動",										------------------48
	"榮譽值沒有達到50",										------------------49
	"時間未到,不可領取",										------------------50	
	"無法離開交戰中的據點，請使用據點中撤軍功能",				------------------51	
	"據點狀態已變更，無法前往",								------------------52	
	"不能進攻對方主城",										------------------53
	"時間已到",											------------------54
	"已領取",											------------------55
	"忍者，您沒有稱謂",										------------------56
	"不能在主城號令"	,										------------------57
	"羣魔亂舞，羅剎白蓮圍剿龍虎",											------------------58
	"天地色變，龍虎白蓮決戰羅剎",											------------------59
	"異軍突起，龍虎羅剎奇襲白蓮",											------------------60
	"玩家攻擊了您，",											------------------61
	"您攻擊了玩家",										------------------62
	"您獲得了勝利！",										------------------63
	"是否確認加入龍虎門，加入該勢力後將無法變更陣營",      -------------------64
	"是否確認加入羅剎教，加入該勢力後將無法變更陣營",     -------------------65
	"是否確認加入白蓮教，加入該勢力後將無法變更陣營",      -------------------66
	"是否確認隨機選擇勢力，選擇後確認後將無法變成陣營",    -------------------67
	"據點沒有被縱火，不可使用滅火",               ----------------68
	"開服五日後，勢力戰開啟",                 ---------------69
	"氣勢值購買",           				      ---------------70
	"購買氣勢值",            				     ---------------71
	"獲得氣勢值",            				     ---------------72
	"復活成功",            				     ---------------73
	"升級",           				----------------74
	"需要城堡達到%s級",				----------------75
	"需要使用者達到%s級",				----------------76
	"%d/小時",          			----------------77
	"%d件/天",          			----------------78
	"金幣不足",          			----------------79
	"銅幣不足",          			----------------80
	"木材不足",          			----------------81
	"沒有可以鑲嵌的金幣",			----------------82
	"未選擇任何金幣",				----------------83
	"[需要%s級兵營]",				----------------84
	"科技已到頂級",					----------------85
	"%02d時",						----------------86
	"%02d分",						----------------87
	"%02d秒",						----------------88
	"升級至%s%s級",					----------------89
	"冷卻cd中",						----------------90
	"【城堡%s級開啟】",				----------------91
	"無法攜帶更多的技能",			----------------92
	"無法裝備更多同類型主公技",		----------------93
	"裝備品級",						----------------94
	"強化等級",						----------------95
	"今日次數耗盡，提升VIP等級可獲得更多次數",	----96
	"品級",							----------------97
	"2件",							----------------98
	"4件",							----------------99
	"6件",							----------------100
	"親愛的玩家您好:",				----------------101
	"未入榜",						----------------102
	"傷害",							----------------103
	"排名",							----------------104
	"請先通過上一個副本",			----------------105金币副本为开启提示
	"請先通過上一個難度",			----------------106金币副本为开启提示
	"領主%s級開啟",					----------------107金币副本为开启提示
	"未開啟",						----------------108
	"已經達到最高品質",				----------------109
	"損失銅幣:%s",					----------------110
	"獲得銅幣:%s",					----------------111
	"無損失",						----------------112
	"搶奪失敗",						----------------113
	"自己的不能搶",					----------------114
	"同陣營的不能搶",				----------------115
	"已經被搶光了",					----------------116
	"%s級",						----------------117
	"第%s關",						----------------118
	"重置次數已用完",				----------------119
	"沒有排名",						----------------120
	"請選擇援軍",					----------------121
	"%d萬",							----------------122
	"請選擇需要退化的忍者",			----------------123
	"挑戰次數不足",					----------------124
	"購買次數",						----------------125
	"總戰力:",						----------------126
	"進度:",						----------------127
	"家族威望:",						----------------128
	"%s已經升級至%s級",				----------------129
	"是否花費%d金幣立即完成升級",		------------130
	"選擇出售數量",					----------------131
	"選擇使用數量",					----------------132
	"是否確定出售該物品",			----------------133
	"該boss已被擊敗",				----------------134
	"每日3:00自動重置",				----------------135
	"每日8:00至24:00開啟",				------------136
	"週三、週六20:00-20:45開啟",			------------137
	"剩餘運送 %s/%s 掠奪 %s/%s",			------------138
	"今日已完成",					----------------139
	"軍資正在運送中",				----------------140
	"今日運送次數已用完",				------------141
	"是否花費%d金幣，立即完成護送的當前軍資？",	----142
	"可用於建築和兵營科技升級",	--------------------143
	"需要先通關前置關卡",			----------------144
	"第%s名",				------------------------145
	"%s/小時",				------------------------146
	"購買次數已達上限",				----------------147
	"是否花費%s金幣購買一次挑戰次數？",		--------148
	"掃%s次",				------------------------149
	"獲得%s稱號後可以挑戰",			----------------150
	"累計%s天獎勵",				--------------------151
	"【無】",				------------------------152
	"親,請按指引操作哦",			--------------------153
	"VIP等級不足",				--------------------154
	"對",					------------------------155
	"造成傷害",					--------------------156
	"暫未加入組織",				--------------------157
	"升級佇列已滿",				--------------------158
	"%s--%s區",					--------------------159
	"%s件",						--------------------160
	"第%s關-第%s關",				--------------------161
	"今日攻打煉獄次數已用盡",		----------------162
	"升級至%s級%s",				--------------------163
	"請解除忍者羈絆再進行分解",	--------------------164
	"首領或者副首領才能號令",	--------------------165
	"您沒有加入組織",	----------------------------166
	"您的糧草不足",	--------------------------------167
	"您是否確定消耗%d糧草發佈號令？",	----------------168
	"前往",							----------------169
	"領取",							----------------170
	[241]="恭喜儲值成功",							----------------241【数码宝贝】限时好礼
}
pay_success_tip_info = {
	"恭喜購買%s成功！每日都可以領取免費金幣喲!",
}

choose_camp_tip_string = {
	"是否確認加入龍虎門，加入該勢力後將無法變更陣營",      -------------------1
	"是否確認加入羅剎教，加入該勢力後將無法變更陣營",     -------------------2
	"是否確認加入白蓮教，加入該勢力後將無法變更陣營",      -------------------3
	"是否確認隨機選擇勢力，選擇後確認後將無法變成陣營",    -------------------4
}

national_truce_dec =  --国战说明
{
	{"【規則】","勢力戰領地分為龍虎門領地、白蓮教領地、羅剎教領地、中立區4個區域。"},
	{"","每個勢力有一個主神像，主神像無法被攻陷，玩家陣亡時，會被傳送至主神像復活。"},
	{"","殺死據點中最後一個NPC，則該玩家所屬的勢力視為佔領據點的勢力,活動期間已經被佔領的據點可以繼續被搶奪。"},
	{"","若同一個據點有超過兩股以上的勢力同時爭奪，則在此據點範圍內的玩家，既可以攻擊守衛據點的NPC，也可以攻擊正在攻擊據點的其他勢力玩家。"},
	{"","不論攻守雙方人數差距多大，佔領據點的條件永遠是“擊殺該據點最後一個守衛據點的NPC”，一旦據點易主，將清空該據點內所有其他勢力的玩家，這些玩家將被強制傳送回主神像。"},
	{"","當滿足一定條件時，玩家可以選擇進行一些戰術移動，如突進、包圍等。"},
	{"","勢力戰結束時，佔領據點最多的勢力視為勢力戰的最終勝利勢力。"},
	{"","勢力戰結束時，佔領據點最多的勢力視為勢力戰的最終勝利勢力。"},
	{"【戰鬥】","【等待】當玩家進入某領地後，自動進入等候狀態，等候狀態下可以被敵方玩家匹配到，匹配到後進入戰鬥。"},
	{"","【尋敵】點擊攻擊後，進入主動匹配敵方目標狀態，每次點擊攻擊後會有10秒的攻擊冷卻時間。攻擊可以選擇特定勢力的玩家進行攻擊。"},
	{"","【戰鬥】尋敵模式下，勝利後會有增加30秒的CD時間，當時間累積到1分鐘後，進入冷卻狀態，冷卻狀態下不可主動攻擊，花費200氣勢值可以清除CD。戰鬥勝利後，玩家的忍者不會回復已損失的血量，但查克拉會重置。"},
	{"","【陣亡】戰鬥失敗後，進入陣亡狀態，陣亡狀態下，不可進行指令相關操作。"},
	{"","【復活】陣亡後，傳送回主神像等待1分鐘的復活CD，可以花費500氣勢值立即復活。"},
	{"","【撤退】玩家可以花費200點氣勢值和損失最大生命值20%的生命為代價，強行從交戰中的領地中撤退。"},
	{"","【突進】進攻人數高於防守人數兩倍時，可採取突進戰術。"},
	{"","【包圍】當一個據點周圍的據點被其他勢力佔領時，該據點內防守方造成傷害降低50%、承受傷害增加50%。"},
	{"","【召集】武神、戰神、和鬥神可發佈召集令，號令本勢力成員迅速集合攻打目標據點。"},
	{"","【扶弱】勢力戰獲得第二名，下次勢力戰增加1500氣勢值，獲得第三名，下次勢力戰增加3000氣勢值。"},
	{"","【同盟】當一個勢力連續兩次獲得勢力戰第一，或同一個勢力連續兩次獲得勢力戰第三，上次勢力戰的二、三名自動結盟。"},
	{"","【盟約】勢力戰結算時，同盟兩勢力的據點數和總榮譽將相加進行排名，擊殺同盟勢力的玩家的個人榮譽減半。"},
	{"【獎勵】","榮譽值少於50點的玩家無法領取任務獎勵。"},
	{"","勢力戰結束時，會給據勢力所佔領地數量的排行，給與勢力戰中獲得50點榮譽以上的本玩家一定的獎勵，排名不同，獎勵不同。"},
	{"","勢力戰結束時，跟根據個人在本榮譽排行中的位置，給與一定的獎勵 。"},
}

red_alert_hero_camp = 
{
    "龍虎門",
    "羅剎教",
    "白蓮教",
    "中立",
}

red_alert_officer = 
{
	"【武神】",
    "【戰神】",
    "【鬥神】",
    "【三品】",
	"【四品】",
    "【五品】",
    "【六品】",
    "【七品】",
    "【八品】",
    "【九品】",
}

red_alert_family_officer = 
{
	"【首領】",
    "【副首領】",
    "【成員】",
}

red_alert_home_city_id = 
{
	1,
    62,
    28,
}

red_alert_resouce_tip = 
{
	{"戰神令","勢力中獲得的獨有資源"},
	{"氣勢值","勢力戰復活、清除CD需要的資源"},
}
red_alert_war_city_map_tip = 
{
	"沒有敵方目標",
	"cd時間未到",
	"清除戰鬥cd需要%d氣勢值",
	"當前據點處於火攻狀態下，守方攻擊下降%d。",
	"當前據點未處於火攻狀態下。",
	"攻擊方無法使用",
	"守城方無法使用",
}


---------------------红装技能和天赋
_equip_red_tip = {
	"(覺醒至%d階開啟)", -----------------------------------------1
}

tipStringInfo_treasure_seat_str = {
	"[攻擊]", -------------------------------------------1
	"[防禦]", -------------------------------------------2
	"裝備於", -------------------------------------------3
	"已裝備", -------------------------------------------4
}
--------------------红装技能天赋激活颜色配置
red_equip_skill_color_type = {
	{0,0,0},		--未激活
	{255,0,0},		--激活
}

---------------------装备升星
_equip_up_star_tip = {
	"不可升星",
	"已滿星",
	"升至%d星屬性",
	"高",
	"較高",
	"一般",
	"（SWT 00:00重置）",
	"升星成功",
	"升星失敗",
	"幸運值",
	"暴擊1.5倍",
	"大暴擊2倍",
	"經驗值",
}
---------------------限时优惠、月基金、限时团购配置
_activity_new_tip_string_info = {
	"折",-------------------------------1
	"進度達到100%時可享儲值優惠",------------------2
	"已購買",---------3new
	"購買人數達到%d購買",----------4
	"儲值成功！恭喜獲得儲值優惠，額外獲得%d金幣！",--------------------5
	"購買進度",--------------------6
	"購買成功！",---------------7
	"成功購買",---------------8
	"購買",---------------9
}

---------------------限时优惠颜色
_activity_limit_color = {
	{255,255,255},----------1白色
	{0,200,255},-----2 蓝色
	{255,73,30},-----------3红色
	{255,255,30},-----------4黄色
}

--------------------新数码的文字--------------------------
_new_interface_text = {
	"等級達到%d級",							--1
	"星級達到%d級",							--2
	"達成條件後,完成指定關卡即可進化~",		--3
	"進化副本",								--4
	"%d級",									--5
	"需求等級%d",							--6
	"%d星開放",								--7
	"經驗+%d",								--8
	"剩餘技能點數:%d(%s)",					--9
	"確認要出售%s嗎?",						--10
	"出售成功!",							--11
	"(今日已用%d/%d)",						--12
	"查看詳情",								--13
	"關閉詳情",								--14
	"該忍者的初始獲取形態為%s",			--15
	"本次免費",								--16
	"%s個%s碎片",							--17
	"技能點已滿",							--18
	"技能等級無法超過忍者等級",			--19
	"你是vip%d,今日還可購買%d次",			--20
	"購買%d技能點需",						--21
	"今日購買次數已用完",					--22
	"提升VIP等級可增加購買次數",			--23
	"購買技能點",							--24
	"拖動可選擇轉換數量:%d/%d", 			--25
	"沒有萬能碎片,無法轉化",				--26
	"材料不足",							--27
	"銅幣不足",							--28
	"等級不足",							--29
	"Lv",									--30
	"請選擇升級材料",						--31
	"忍者等級不能超過隊伍等級,請努力提高隊伍等級", --32
	"通關",			---------------------------33//副本关卡宝箱名称，中间取金色
	"可領取",			---------------------------34//副本关卡宝箱名称，中间取金色
	"該關卡尚未開啟！",			-------------------35//跳转提示
	"第%d戰",			-------------------36//扫荡提示
	"無獎勵可領取~",						--37
	"來自組織:",						--38
	"排名達到%d",						--39
	"努力提升排名才能領取喔！",			--40
	"膜拜成功，獲得%d銅幣！",			--41
	"保持當前排名（第%d名到第%d名），即可獲得以下獎勵：",			--42
	"第%d名",			--43
	"組織名稱中不能含有特殊字元",			--44
	"組織公告中不能含有特殊字元",			--45
	"V%d",				--46
	"今日",				--47
	"%d天之前",			--48
	"點擊輸入玩家名稱", --49
	"昨日",				--50
	"確認刪除該好友嗎？", --51
	"體力領取成功",			--52
	"沒有可贈送的好友",		--53
	"體力贈送成功",			--54
	"發送申請成功",			--55
	"成功添加該好友",		--56
	"已全部拒絕",			--57
	"該組織拒絕任何人加入！",			--58
	"您的等級未達到該組織要求等級！",			--59
	"成功加入組織，快去看看吧！",			--60
	"首領:%s",			--61
	"組織%d級開啟",			--62
	"今日次數已用盡,明天記得來做貢獻喔！",			--63
	"%d金幣開放",			--64
	"%d等級開放",			--65
	"最多輸入%d個字",		--66
	"沒有獎勵可領取",		--67
	"請選擇私聊物件",		--68
	"無人可加速",			--69
	"%d個卡卡西",			--70
	"第%d名及以後",			--71
	"陣容保存成功",			--72
	"全屬性加成:%d",		--73
	"公告",					--74
	"獲得",					--75
	"紅包發放成功,快喊小夥伴們搶奪吧！",					--76
	"%s的紅包",					--77
	"你搶到了%s的紅包,獲得%s",					--78
	"VIP%d*2",					--79
	"%|4|購買%!x@%|4|件:%",				--80
	"當日獎勵已領取|升級至%|2|vip%d%可領取",				--81
	"累計儲值|%d|金幣送:%d/%d",				--82
	"另贈%d金(僅首次)",			--83
	"V%d特權",					--84
	"V%d%s超值禮包包含以下內容:", 	--85
	"（第1次儲值）",					--86
	"當日獎勵已領取!升級至|%s|可補領VIP雙倍的獎勵", 	--87
	"別著急，活動將每日陸續開放！", 	--88【数码宝贝】开服狂欢
	"(今日已用%d/%d)", 	--89
	"戰力需達到%d發放排名獎勵", 	--90
	"加入組織後開啟組織商店",		--91
	"購買成功，歡迎再來！",			--92
	"%s不足",			--93
	"組織幣",						--94
	"試煉幣",						--95
	"演武幣",						--96
	"",							--97
	"（今天還有%d次刷新機會）",		--98
	"今日刷新次數已用完",			--99
	"SWT %d:00",						--100
	"明天%d點",						--101
	"下次自動刷新時間：",			--102
	"等級:",						--103
	"組織:",						--104
	"這傢夥很懶，什麼也沒有說",		--105
	"名字修改成功",					--106
	"請輸入新的暱稱喲~",			--107
	"請輸入文字",					--108
	"不能超過12個字元！",					--109
	"您暫時還有加入組織喔~",		--110
	"個性簽名不能超過%d個字，請修改~",	--111
	"修改成功",						--112
	"暫未開啟",						--113
	"需要輸入10位兌換碼！",				--114
	"獲得%s",					--115
	"等 級:",						--116
	"當前未上榜,無法獲得排名獎勵",						--117
	"積分達到%d",						--118
	"隊伍已滿~",					--119
	"白絕化身為%%|4|%s%%了，快來一起打敗冒牌貨！",	--120
	"邀請發送成功",					--121
	"發送邀請過快，請稍等",			--122
	"您需要擁有對應忍者才能挑戰~",--123
	"您已經在討伐白絕的隊伍內了",	--124
	"加入成功快去討伐白絕吧~",	--125
	"有未購買的BUFF,是否退出?",		--126
	"通關副本後纔可領取",			--127
	"比賽開始後無法查看昨日回顧~",	--128
	"%s碎片",						--129
	"每週一、三、五、日開放",		--130
	"每週二、四、六、日開放",		--131
	"需通關上一關且等級達到%d級才能開放喔~",	--132
	"滿星才能掃蕩~",				--133
	"暫無可以一鍵膜拜的物件~",		--134
	"掃蕩%d次",		--135
	"掃%d次",		--136
	"原技能",		--137
	"新技能",		--138
	"1.通過",		--139
	"2.通過",		--140
	"精英關卡",		--141
	"主線關卡",		--142
	"請先上陣忍者~",		--143
	"%d級開啟",		--144
	"天賦樹共消耗天賦點%d",			--145
	"開放條件：第%s個天賦樹中投入%d點天賦點，隊伍等級達到%d級",			--146
	"所屬天賦樹開放",		--147
	"隊伍等級達到%d級",		--148
	"%s達到%d(%d/%d)",		--149
	"團隊精神·%s",		--150
	"您還沒有報名呦~",		--151
	"上陣忍者不足，詳細請見規則說明",		--152
	"忍界爭霸已結束，您獲得了%d勝%d負，未能晉級下一輪",		--153
	"虛位以待",		--154
	"%d勝%d負",		--155
	"暫無",		--156
	"第%d名到第%d名",		--157
	"忍者達到 紫%s品質開放",		--158
	"忍者達到 橙%s品質開放",		--159
	"未添加材料",		--160
	"直接將%s提升至LV.%s",		--161
	"請添加材料~",		--162
	"需要達到隊伍等級%d",		--163
	"已經有組織",		--164
	"申請成功",		--165
	"苦無不足，是否立即儲值？",		--166
	"恭喜玩家%|4|!x@%在抓真身活動中獲得%|4|!y@!z@!a@%",		--167
	"(%s倍獎勵)",		--168
	"請勿在10s重複發送",		--169
	"您尚未獲得該忍者",		--170
	"%d星",                      -- 171
	"請先使用免費次數",                      -- 172
	"剩餘星數不足",		--173
	"您未使用天賦點，不亂收費~",		--174
	"您沒有該禮物喔~",		--175
	"演武幣可在演武場中獲得",		--176
	"試煉幣可在忍者試煉中獲得",		--177
	"挑戰次數已經用光！",		--178
	"是否全部送給%s",		--179
	"報名成功",		--180
	"報名時間：10:00-19:50",		--181
	"開始時間：20:00",		--182
	"生命值提升%d點",		--183
	"生命值+%d%%",		--184
	"免疫率+%d%%",		--185
	"攻擊力提升%d點",		--186
	"攻擊力+%d%%",		--187
	"傷害率+%d%%",		--188
    "裝備碎片",		--189
    "開始遊戲",		--190
    "再來一次",		--191
    "感謝您的幫助，送您%s銅幣",		--192
    "兌換道具不足",		--193
    "您今日的加速次數已用完",		--194
	"更換組織後，明天才能玩喔~",		--195
	"開服第%d天開啟",		--196
    "今日次數已用完！",		--197
	"領獎",		--198
	"已領取",--------------------------------199
	"忍界爭霸已結束，您獲得了%d勝%d負，未能晉級下一輪", ------200
	"%d勝%d負", ------201
	"無人下注", ------202
	"該玩家今日加速次數已用完，請為其他玩家加速~", ------203
	"演武幣可通過演武場獲得", ------204
	"試煉幣可通過忍者試煉獲得", ------205
	"請輸入郵件內容！", ------206
	"郵件發送成功", ------207
	"請輸入要發送的內容", ------208
	"今日發送郵件次數已達上限", ------209
	"重置關卡次數需要花費：%d金幣。確定重置嗎？（今日已重置%d次）", ------210
	"今日已達到重置上限", ------211
	"完成戰鬥%s/%s", ------212
	"請升級啟動天賦屬性", ------213
	"天賦樹總共消耗天賦點%d", ------214
	"等級已達上限",  ------215
    "%d連勝",------216
    "%d分",------217
    "%d勝",------218
    "第%d天",------219
    "升級成功",------220
    "您已經被淘汰",------221
    "當前:忍界爭霸第%d場比賽正在展示中",------222
    "需要達到%d級才能開啟下一章節",------223
	"貨物還在準備中，敬請期待",------224
	"僅限%s人購買(剩餘)%s件",------225
	"需要達到vip%s才能購買",------226
	"仍有寶箱可以開放，確定跳過嗎？",---------227
	"%d層剩餘",						---------228
	"經驗超出上限",						---------229
	"選擇材料數量過多",						---------230
	"當前沒有任何BUFF",						---------231
	"更新提示",						---------232
	"有新的版本內容需要更新,請前往更新.",						---------233
	"伺服器重置提示",						---------234
	"新的一天正在裝載中",						---------235
	"上陣",						---------236
	"合成",						---------237
	"陣容保存成功",						---------238
	"升級的同時品質將自動提升到",			---------239
	"升級條件不足",			---------240
	"沒有選擇材料",			---------241
	"V%d特權禮包",			---------242
	"確定放棄跳過戰鬥??",			---------243
	"忍者等級無法超過隊伍等級",			---------244
	"（每日活動）",			---------245
	"試煉幣不足",			---------246
	"",			---------247
	"神獸來襲",			---------248
	"神獸來襲2選1",			---------249
	"確認選擇%s嗎？",			---------250
	"忍者需達到紫色以上品質纔可以階數還原",			---------251
	"所有技能級數和需達到%d纔可以技能還原",			---------252
	"所有咒印級數和需達到%d纔可以咒印還原",			---------253
	"忍者等級需達到%d纔可以經驗還原",			---------254
	"前4件已裝備武器等級總和達到%d才可重生",			---------255
	"該道具尚未進行提升，無需還原",			---------256
	"至少需要1件已升星的武器。",			---------257
	"缺少重生石",					--------------258
	"還原忍者%s%s，可以返還以下道具：",		------------259
	"的階數",		------------260
	"的技能等級",		------------261
	"的咒印等級",		------------262
	"的等級",		------------263
	"的裝備等級和階數",		------------264
	"的忍者手冊等級",		------------265
	"的指環等級",		------------266
	"所有裝備的星級",		------------267
	"階數還原",		------------268
	"技能還原",		------------269
	"咒印還原",		------------270
	"經驗還原",		------------271
	"裝備品質還原",		------------272
	"忍者手冊還原",		------------273
	"指環還原",		------------274
	"裝備覺醒還原",		------------275
	"選擇",		------------276
	"將忍者%s%s還原至初始狀態，是否繼續？",		------------277
	"返還%s的材料，",		------------278
	"普通重生",		------------279
	"x%s（擁有：%s）",------------280
	"忍者等級需達到%d級",------------281
	"裝備降星",------------282
	"裝備降星需消耗",------------283
	"降星返還所有覺醒材料,確定使用嗎?",------------284
	"請先開放上一神器",------------285
	"開放成功",------------286
	"累積活躍度達到%s，可領取以下獎勵：",			--287
	"沒有獎勵可領取",			--288
	"已達體力上限",			--289
	"進階成功",			--290
	"VIP等級越高，暴擊倍率越高",			--291
	" （每日前10次點金可獲得200%加成）",			--292
	"您現在沒有加入任何組織",			--293
	"組織等級不足，組織3級開啟能量屋",			--294
	"您的材料不足，已為您培養了%d次~",			--295
	"通關 %s 後開啟下一章",			--296
	"暫未開啟下一章",			--297
	"後可領取",			--298
	"終極獎勵僅能領取一次\r\n（建議進度達到100%時再領取！）",			--299
	"是否花費%d金幣開啟多次寶箱？",		--300
	"該頻道為組隊頻道不能發言",				--301
	"當前等級:%s",			--302
	"隊伍等級達到%s可領取獎勵",			--303
	"點贊成功，%s人氣值+1",			--304
	"您的忍者狀態都很好，無忍者可供選擇",			--305
	"聯動玩家只可登陸特殊的伺服器，請重新選擇登陸",			--306
	[307] = "額外贈送%d金幣",			--307二充及每次额外赠送，若为0不显示
	[308] = "發送申請成功",			--308找回密码发送邮件成功
	[309] = "!x@% 折",			--309
	[310] = "（若已擁有永久分支進化，將會自動轉換為10個相應忍者碎片）",
	[311] = "第%s天解鎖",
	[312] = "（獲得該忍者後才能使用該分支進化）",
	[313] = "是否花費%d鑽石開啟一次寶箱？",  -----试炼一键跳过开箱提示
	[314] = "暫無好友加入",
	[315] = "當前未達到名次,無法獲得排名獎勵",
	[316] = "金幣",          --316
	[317]= "噩夢關卡",     --317
	[318]= "批量",     --318
	[319]= "兌換",     --319
	[320]= "使用",     --320
	[321]= "一鍵升級成功！",	  --321
	[322]= "高級萬能碎片不足!",	  --322
	[323]= "每隊必須上陣一名忍者!",	  --323
	[324]= "購買",	  --324
	[325]= "排行活動已結束",	  --325
	[326]= "排行榜將於%d天%d小時後開啟",	  --326
	[327]= "排行榜將於%d小時後開啟",	  --327
	[328]= "排行榜將於%d分鐘後開啟",	  --328
	[329]= "未上榜",	  --329
	[330]= "%d之後",	  --330
	[331]= "排行榜將於%d秒後開啟",	  --331
	[332]= "報名時間:%s-%s",	  --332
	[333]= "開始時間:%s",	  --333
	[334]= "排行榜尚未開放，請於本期結束後再行查看",	  --334
	[335]= "未上榜",	  --335冠军试炼使用
}

activity_tip_str_info = {
	"每天儲值都會有好禮相送喔",		--1
	"今日已儲值%d金幣,再充%d金幣即可領取",	--2
	"未達到儲值條件喔~",			--3
	"需進度達到:%d%%",				--4
}

activity_recruit_ship_str = {
	{	
		"%|4|最強大腦，強力控制%",
		"可啟動%|4|手鞠、卡卡西%的羈絆",
		"輸出控制，最佳搭檔，你值得擁有",
		"奧義：影縫術",
	},
	{
		"快速回復%|4|查克拉、全體%攻擊",
		"可啟動%|4|鳴人、小櫻%的羈絆",
		"覺醒後和鳴人組成雙重利刃，出血吧~",
		"任意儲值即可獲得，全屏秒殺脆皮敵人",
	},
	{	
		"%|4|SOLO之王，最強單挑忍者%",
		"可啟動%|4|鹿丸、手鞠%的羈絆",
		"最強的進攻就是最好的防守，旗木卡卡西——木葉第一技師！",
		"V12可從VIP12禮包獲得，「卡卡西」絕不會讓你失望"
	},
}

skill_attributes_text_tips = {
	"生命",
	"攻擊",
	"防禦",
	"術防",
	"生命",
	"攻擊",
	"防禦",
	"術防",
	"暴擊率",
	"抗暴率",
	"格擋率",
	"破擊率",
	"命中率",
	"閃避率",
	"物理免傷",
	"忍術免傷",
	"治療率增加",
	"被治療率增加",
	"最終傷害",
	"最終減傷",
	"初始查克拉",
	"體質",
	"力量",
	"靈力",
	"物理攻擊",
	"額外傷害",
	"治療值",
	"被治療值",
	"出血傷害",
	"中毒傷害",
	"出血免傷",
	"中毒免傷",
	"經驗",
	"傷害加成",
	"傷害減免",
	"PVP終傷",
	"PVP免傷",
	"初始合擊點數",
	"每次出手增加的查克拉",
	"出血傷害",
	"吸血率",
	"查克拉",
	"反彈率",
	"暴擊強度",
	"免控率",
	"小技能觸發機率",
	"格擋強度",
	"控制率",
	"治療效果",
	"——",
	"忍者類型剋制傷害",
	"濺射傷害",
	"技能傷害",
	"被治療率減少",
	"傷害提升",
	"奧義傷害%",
	"增加造成的奧義傷害",
	"減少造成的奧義傷害",
	"增加暴擊傷害",
	"減少暴擊傷害",
	"受到的奧義傷害增加",
	"查克拉回復速度",
	"受到傷害降低",
	"降低攻擊",
	"降低防禦",
	"傷害加成百分比提升",
	"降低奧義傷害率",
	"降低傷害減免",
	"降低防禦",
	"降低查克拉回復速度",
	"忍者類型剋制傷害加成",
	"忍者類型剋制傷害減免",
	"降低攻擊",
	"奧義抗性",
	"減少奧義抗性",
	"降低免控率",
	"復活機率",
	"被復活機率",
	"復活繼承血量",
	"復活繼承查克拉",
	"被復活繼承血量",
	"被復活繼承查克拉",
	"增加復活機率",
	"增加復活繼承血量",
	"當前屬性加成：", --85
	"下一階屬性加成：", --86
}

cultivate_spirit_attributes_name = {
	"暴擊率",
	"抗暴率",
	"傷害率",
	"免傷率",
	"格擋率",
	"破擋率",
	"攻擊",
	"防禦",
	"生命",
}
union_red_envelopes_tips = {
	"銅幣",
	"金幣",
	"通靈契約",
}

union_job_title = {
	"首領",
	"副首領",
	"成員",
	"升職成功", --4
	"降職成功", --5
    "確認踢出該成員？",		--6
    "確認把首領轉交給 %s？您的職位將與對方對換",		--7
}
-------------组织科技捐献说明
union_science_text = {
	"抽卡卡西是組織活動，可獲得卡卡西碎片等道具。",
	"提升等級可提高玩法次數和免費置換次數",
	"在大和的木遁中，通關的距離越遠，獎勵越高",
	"升級後可增加玩法次數和獲得銅幣上限",
	"在組織紅包中成員不僅可以搶系統紅包，還可以分享紅包給朋友們喔！",
	"可增加紅包裡包含的銅幣、金幣數量",
	"科技是第一生產力",
	"升級科技可額外提高組織成員上限",
}

union_limit_title = {
	"允許任何人加入",
	"需要申請才能加入",
	"禁止任何人加入",
	"無限制",
}
skill_quality_text = {
	"必殺技",
	"奧義",
	"被動技能",
}

equip_tips_text = {
	"快速添加",
	"一鍵升級",
}

---------------资源类型对应的图标,品质框调用
_props_image_name = {
	"4002,2",--	1:铜币
	"4001,2",--	2:金币
	"4007,2",--	3:竞技币
	"",--	4:将魂
	"3000,2",--	5:觉醒碎片
	"",--	6:道具
	"",--	7:装备
	"4006,2",--	8:队伍经验
	"",--	9:耐力
	"",--	10:功能点开启
	"",--	11:上阵人数
	"4005,2",--	12:体力
	"",--	13:忍者
	"",--	14:演武场排名
	"",--	15:伤害类型
	"",--	16:比武积分
	"",--	17:霸气
	"4006,2",--	18:试炼币
	"",--	19:日常任务积分
	"",--	20:叛军中的功勋
	"",--	21:叛军中的战功
	"",--	22:日常副本基础奖励
	"",--	23:日常副本额外奖励
	"",--	24:叛军中的出击令
	"",--	25:免战时间
	"",--	26:成就积分
	"",--	27:？
	"4013,2",--	28:组织币
	"",--	29:排位赛胜点
	"",--	30:排位赛积分
	"",--	31:国战的战功令
	"",--	32:魔陷卡
	"",--	33:驯兽魂
	"4008,2",--	34:天赋点
	"4009,2",--	35:探索币
	"4065,2",--	36:矿石
	"",--	37:？
	"",--	38:？
	"4039,4",--	39:VIP经验
	""
}

_reward_image_name = {
	"4002",--	1:铜币
	"4001",--	2:金币
	"4004",--	3:竞技币
	"4007",--	4:将魂
	"4008",--	5:兽魂
	"4006",--	6:荣誉
	"4005",--	7:体力
	"3017",--	8:精力
	"4005",--	9:战功
}

---------------------品质对应颜色
_quality_color = {
	{255,255,255},----------0白色
	{0,255,0},--------------1绿色
	{0,255,255},------------2蓝色
	{255,0,255},------------3紫色
	{243,152,0},------------4橙色
	{255,0,0},--------------5红色
	{255,255,0},------------6金色
	{212,131,255},------------7紫粉色
}

--富文本颜色
chat_rich_text_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R69 G250 B133
	cc.c3b(10, 207, 242),				---------------------3 品质蓝 R69 G244 B250
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R214 G72 B255
	cc.c3b(204, 197, 11),			---------------------5 品质橙 R255 G142 B42
	cc.c3b(239, 22, 22),				---------------------6 品质红 R255 G44 B34
	cc.c3b(98, 55, 0),				---------------------7 品质褐 R98 G55 B0
	cc.c3b(0, 0, 0),				---------------------8 品质黑 R0 G0 B0
	cc.c3b(254, 212, 68),				------9 限时排行活动钻石数量
	cc.c3b(255, 139, 0),				------10 限时排行活动钻石数量
}
--小助手颜色
chat_rich_text_two_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R69 G250 B133
	cc.c3b(10, 207, 242),				---------------------3 品质蓝 R69 G244 B250
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R214 G72 B255
	cc.c3b(255, 138, 0),			---------------------5 品质橙 R255 G142 B42
	cc.c3b(239, 22, 22),				---------------------6 品质红 R255 G44 B34
}

--羁绊颜色
the_color_of_the_fetters = {
	cc.c3b(135,135,135),					--1 缘分未激活颜色
	cc.c3b(50,255,255),					--2 缘分激活颜色
	cc.c3b(144,144,144),					--3 缘分未激活颜色内
	cc.c3b(255,215,0),					--4 缘分激活颜色内
}
activity_add_energy_tips = {
	"早餐體力(%s)",
	"午餐體力(%s)",
	"晚餐體力(%s)",
	"夜宵體力(%s)",
}

---------------------月卡,体力等任务的配置
_daily_mission_param = {
	{"4002","月卡","累計儲值250金幣可領取|，（剩餘%d天）","2-0,100"},----------25元月卡
	{"4002","至尊月卡","累計儲值880金幣可領取|，（剩餘%d天）","2-0,100"},----------88元月卡
	{"4005","領取60點體力","早餐體力(%s)","3-0,60"},
	{"4005","領取60點體力","午餐體力(%s)","3-0,60"},
	{"4005","領取60點體力","晚餐體力(%s)","3-0,60"},
	{"4005","領取60點體力","夜宵體力(%s)","3-0,60"},
}


------全服战力排行活动规则
_activity_full_service_rankings_tips = {
	"排名獎勵將於第5天SWT 21:30透過郵件發放。",
	"進度獎勵依活動期間達到的最高戰力發放。",
	"戰力相同,按照排名時間先後排序",
	"至少需要%s戰力才能進入前10名排行。",
	"前10名忍者將獲得豐厚獎勵！全力以赴吧！",
	"驚人獎勵！達到指定戰力即可全部領取！",
}

_activity_full_service_times_tips = {
	"年",		--1
	"月",		--2
	"日",		--3
	" ",		--4
	"早",		--5
	"中",		--6
	" ",		--7
}

--背景图名称
_back_groud_image_name = {
	"默認場景",
	"砂之隱裡",
	"雨之隱裡",
}
--功能开启文字 
_model_open_push_tip = {
	{15,"15,達到Lv.15即可參加演武，開啟忍界精彩新篇章~"},		--1
	{18,"18級開啟銅幣副本，實力越強，銅幣越多~"},		--2
	{20,"20級開啟組織，與戰友一起共謀天下~"},			--3
	{24,"達到24級可以挑戰忍者試煉，高層的難度與獎勵都會讓你窒息~"},			--4
	{26,"26級開啟裝備覺醒，啟動裝備的隱藏力量~"},			--5
	{28,"28級開放，大大增強忍者屬性，讓你的敵人聞風喪膽~"},		--6
	{30,"30級開啓結印系統，忍術結印，加強忍術效果"},--7
	{32,"32級開啟忍者重生，返還初始忍者及全部養成資源！"},			--8
	{32,"32級開啟通靈術，通靈獸加成可作用於所有忍者喔~"},			--9
	{35,"35級開啓石像山，解鎖忍者，獲得特定屬性加成"},--10
	{36,"36級開啟團隊精神，與忍者的關係越親密，忍者的能力越強大~"},			--11
	{40,"40級開放咒印，忍者潛力大開發~"},			--12
	{40,"40級開啓成就係統，開啓成就，獲取團隊速度加成"},--13
	{41,"41級開啟活躍度，完成指定任務即可領取獎勵！"},			--14
	{43,"43級開啓刃具系統，專屬刃具，實力巨大提升"},--15
	{45,"45級八門解鎖，修煉八門遁甲，獲取強大能力"},--16
	{46,"46級開啓援護小隊，來自忍者的神祕力量，提供全隊屬性加成"},--17
	{48,"48級開啓組合卡系統，高階忍者養成，極大增強戰力"},--18
	{50,"功能於Lv.50開放，帶你探索更高等級的世界~"},			--19
	{25,"25級開啟養成卡冊，趕快收集戰士並提升戰鬥力吧"},--20
	{25,"25級開啟養成卡冊，趕快收集戰士並提升戰鬥力吧"},--21
	{40,"40級開啟忍列傳，收集英雄魂並解鎖對應成就，即可獲得戰力加成"},--22
	{33,"33級開啟神獸，神獸具有獨特的戰鬥技能，並可為全隊帶來巨額屬性加成"},--23

}

-- 抓真身规则说明
-- Clone Breach Rules 
_activity_smoked_eggs_rule_tips = {
    "1. 活動期間，每累計儲值60金幣可獲得1個抓真身用的苦無，每日最多10個苦無。\r\n\r\n2. 抓真身1倍需消耗兩*30000和苦無*1，有機率獲得3倍、6倍和10倍獎勵，即兩*90000、兩*180000、兩*300000。\r\n\r\n3.找到真身即可獲得10倍獎勵，之後3個分身全部重置；否則可繼續嘗試尋找真身。\r\n\r\n4.運氣好的話，1次就能找到真身並獲得10倍獎勵；否則3次內必定獲得10倍獎勵。 ",
    "1. 活動期間，每累計儲值60金幣可獲得1個抓真身用的苦無，每日最多10個苦無。\r\n\r\n 2. 抓真身1倍需消耗金幣*10和苦無*1，有機率獲得3倍、6倍和10倍獎勵，即金幣*30、金幣*60、金幣*90。\r\n\r\n3.找到真身即可獲得10倍獎勵，之後3個分身全部重置；否則可繼續嘗試尋找真身。\r\n\r\n4. 運氣好的話，1次就能找到真身並獲得10倍獎勵；否則3次內必定獲得10倍獎勵。 ",
	}

game_share_tip_text = {
	"分享成功",
	"加入組織纔可使用",
	"發送成功",
	"當前沒有公告",
}

login_gift_reward_info = {
	"連續登入送雛田",
	"連續登入送雛田",
	"連續登入送鹿丸",
	"連續登入送香燐",
}

login_gift_reward_role_info = {
	"44",
	"44",
	"51",
	"37",
}
--组织战排行前三名颜色
union_fighting_rank_text_color = {
	{255, 158, 0},      -- 1
	{244, 0, 255},          -- 2
	{0, 203, 255},        -- 3
}



--王者之战的战斗推送文字
battle_of_kings_push_text = {
	"%|5|!x@%不敵%|2|!y@%,遺憾落敗",
	"%|2|!x@%英勇無敵,戰勝%|5|!y@%,獲得%|1|!z@%積分,成功晉級",
	"%|2|!x@%打敗%|5|!y@%,獲得%|1|!z@%積分,成功晉級",
	"%|4|!x@%千鈞一髮,險勝%|5|!y@%,獲得%|1|!z@%積分,成功晉級",
	"您已成功報名,預祝您徵戰順利!",
	"預選賽第%d場!",
	"巔峯對決",
	"您已經被淘汰",
}


--招募的预览的对应颜色
recruit_preview_tip_color = {
	{255,255,255},				--0白
	{36,156,31},					--1绿
	{0,115,169},				--2蓝
	{255,0,255},				--3紫
	{255, 150, 0},				--4橙
	{255,0,0},					--5红
	{255,255,0},				--6金
}


home_activity_push_times_info = {
	{"145", {"19:01:00", "20:01:00", "22:01:00", "24:01:00", "03:01:00", "05:01:00"}},		-- 公会红包
	{"82", {"10:01:00", "12:01:00", "15:01:00", "17:01:00","19:01:00","20:01:00" }},					-- 公会战
	{"93", {"12:01:00", "15:01:00", "17:01:00","19:01:00","20:01:00", "22:01:00", "24:01:00", "03:01:00", "05:01:00"}},	-- 数码净化
	{"81", {"10:01:00", "12:01:00", "15:01:00", "17:01:00","19:01:00", "20:01:00", "20:55:00"}},								-- 王者之战
}




-- 火影新增颜色
_naruto_tips_color = {
    {110, 65, 2},         
    {182, 88, 0},
}


--组织小游戏角色形象ID配置
union_small_games_deploy = {
	"111801",
}

account_sys_manager_tips = {
	"登陸成功!",
	"註銷成功!",
	"密碼修改成功!",
	"長度須為6-18個字元！",
	"長度須為6-18個字元！",
	"密碼不一致！",
	"內容包含特殊字元!",
	"內容不可為空!",
	"請輸入帳號",
	"請輸入密碼",
	"Hayate-cs@gfunfun.com",
	"請再次輸入密碼",
	}

-- 火影新增颜色-公告部分
chat_rich_text_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R10 G242 B32
	cc.c3b(10, 207, 242),				-----------------3 品质蓝 R10 G207 B242
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R222 G70 B204
	cc.c3b(204, 197, 11),			---------------------5 品质橙 R204 G197 B11
	cc.c3b(239, 22, 22),				-----------------6 品质红 R239 G22 B22
	cc.c3b(98, 55, 0),				---------------------7 品质褐 R98 G55 B0
	cc.c3b(0, 0, 0),				---------------------8 品质黑 R0 G0 B0
}

------------【数码宝贝】征战按钮上方气泡内容，格式：NPCid,文字内容
home_duplicate_tips_info = {
	{"3", "惡魔獸就在無限山！"},
	{"5", "進化鏈可以進化忍者"},
	{"6", "新劇情解鎖啦！"},
	{"7", "這裡掉落忍者晶石！"},
	{"9", "美美前方唱歌高能"},
	{"11", "馬上解鎖強力裝備"},
	{"14", "即將開啟日常任務"},
	{"17", "天女獸覺醒參戰！"},
	{"19", "魔王即將復活！"},
	{"23", "精英掉落裝備卷軸"},
	{"27", "奧米加獸火速趕往戰場"},
	{"32", "覺醒裝備快速提升戰力"},
	{"37", "這裡掉落忍者碎片！"},
	{"47", "升星可以快速提升戰力"},
	{"487", "有新劇情，獎勵多多"},
}
------------【数码宝贝】主线npc战斗失败，未首充的玩家返回副本界面时必定弹出首充弹窗，如果跳转到养成界面则不弹出。（可任意删减）
battle_fail_show_frist_recharge = {
	"6",-----主线2-3
	"8",-----主线2-5
	"10",----主线2-7
	"12",----主线3-1
	"15",----主线3-4
	"16",----主线3-5
	"17",----主线3-6
	"18",----主线3-7
	"20",----主线4-1
	"21",----主线4-2
	"22",----主线4-3
	"23",----主线4-4
	"24",----主线4-5
	"25",----主线4-6
	"26",----主线4-7
	"27",----主线4-8
	"28",----主线5-1
	"29",----主线5-2
	"30",----主线5-3
	"31",----主线5-4
	"32",----主线5-5
	"33",----主线5-6
	"34",----主线5-7
	"35",----主线5-8
	"36",----主线5-9
	"37",----主线5-10
	"38",----主线6-1
	"39",----主线6-2
	"40",----主线6-3
	"41",----主线6-4
	"42",----主线6-5
	"43",----主线6-6
	"44",----主线6-7
	"45",----主线6-8
	"46",----主线6-9
	"47",----主线6-10
}


------------【数码宝贝】称号功能邮件提示替换文字
_title_param_mail = {
	"演武場",---类型1
	"忍界爭霸",---类型2
	"忍者榜",---类型3
	"關卡榜",---类型4
	"前1名",
	"前2名",
	"前3名",
	"無稱號",---无称号按钮
}
--【数码宝贝TW】网页跳转（如果需要隐藏直接删除相应配置即可）
_web_page_jump = {
	[1] = "https://www.facebook.com/DM2TW/", --FB粉丝团
	[2] = "http://www.cayenneark.com.tw/info.aspx?G=20171013", --官方网站
	[3] = "http://www.cayenneark.com.tw/mobile/app_service/service_login.aspx?srv=20171013&T=1", --客服中心
	[4] = "https://itunes.apple.com/tw/app/tw.com.cayenneark.ask/id1367360357", --APP评价
	[5] = "http://www.cayenneark.com.tw/mobile/ctc/pay_login.aspx?srv=20171013", --第三方充值入口
	[6] = "https://play.google.com/store/apps/details?id=tw.com.cayenneark.dm2", --GOOGLE评价
	[7] = "https://play.google.com/store/apps/details?id=com.netmaru.digisoul", --数码韩文谷歌安装包地址
}
--【火影】FB分享跳转地址
_web_page_share = {
	[1] = "http://ultimateninjaninjaking.com/game/index", --IOS的FB分享
	[2] = "http://ultimateninjaninjaking.com/game/index", --安卓的FB分享
}
--【数码宝贝】皮肤解锁
tipStringInfo_evolution_status = {
	[0] = "幼年期",
	[1] = "成長期",
	[2] = "成熟期",
	[3] = "完全體",
	[4] = "究極體",
	[5] = "第三形態",
}
--【数码宝贝】皮肤解锁
tipStringInfo_evolution_status_tips = {
	"到達%s後開放",---皮肤解锁提示
	"敬請期待",---皮肤解锁提示
	"默認形象",---皮肤解锁提示
	"永久",
	"天",
	"購買皮膚？",
	"換膚成功",---换肤成功提示
	"無購買途徑，請關注相關活動",  -- 分支进化购买提示
	"活動中獲得",  -- 活动中皮肤在分支进化中提示
	"購買皮膚",  --10 分支进化购买提示标题
}
--石像山
tipStringInfo_constellation_tips = {
	"第%d座石像山",---名称
	"%d級開啟",---开启条件
	"獲得%s", -- 属性加成(未获得该数码兽)
	"%s達到", -- 属性加成(拥有该数码兽)
	"%d級開啟", --品级开启条件
	"雕刻成功",
	"更換成功",
}
--【数码宝贝】世界等级
tipStringInfo_world_rank_tips = {
	"因世界等級獎勵額外獲得",---扫荡额外奖励
}
--跨服矿战
tipStringInfo_cross_server_battel_tips = {
	"購買次數:",--1
	"初級鼓舞",---2
	"中級鼓舞",--3
	"高級鼓舞",--4
	"土豪鼓舞",--5
	"購買次數不足",--6
	"礦石不足",--7
	"已達當前經驗最大值", -- 8
	"(下一等級 加成 %d%%)", -- 9
	"(下一等級 加成 %d%%)", -- 10
	"(下一等級 加成 %d%%)", -- 11
	"(下一等級 加成 %d%%)", -- 12
	"(已達今日最高等級)", -- 13
	"點我查看buff相關規則", -- 14
	"免費", -- 15
	"%d級 %s", -- 16
	"%s前", -- 17
	"暫無", -- 18
	"購買搶奪次數?", -- 19
	"購買復仇次數?", -- 20
	"搶奪成功最多可獲得資源", -- 21
	"該玩家處於搶奪冷卻中", -- 22
	"剩餘時間%s", -- 23
	"對方戰力遠低於你，搶奪無法獲得礦石", --24
	"同服玩家，搶奪無法獲得礦石", --25
	"鼓舞成功", --26
	"鼓舞次數不足", --27
	"天", --28
	"跨服資源戰未開啟", --29
	"購買搶奪次數", --30
	"購買復仇次數", --31
}

tipStringInfo_cross_total_war_tips = {
    "超影幣不足",--1
    "押注成功",--2
    "購買次數不足",--3
}
--数码合金
tipStringInfo_alloy_matrix_tips = {
	"免費",--1
	"購買次數已達上限",--2
	"該類型手印已存在", -- 3
	"加成或減免手印已存在", -- 4
	"傷害加成",--5
	"傷害減免",--6
	"最大",--7
	"達到%d級後，可進階為",--8
	"請選擇手印",--9
	"未粘貼任何手印",--10
	"提升至%d級",--11
	"等級%d解鎖",--12
	"忍術祕笈位置未解鎖",--13
	"沒有獎勵可領取",--14
	"未啟動任何忍術",--15
	"手印碎片不足",--16
	"分解可獲得手印碎片：",--17
	"強化過的手印在分解後返還所有手印碎片及大部分銅幣",--18
	"連擊概率",--19
}

-- 7天乐活动对应标签页名称
tipStringInfo_seven_happy_task_name = {
	[1] = "累計登錄",----累计登录
	[2] = "主線挑戰",----主线挑战
	[3] = "精英挑戰",----精英挑战
	[4] = "金幣消耗",----金币消耗
	[5] = "忍者成長",----数码兽成长
	[6] = "鑽石消耗",----钻石消耗
	[7] = "競技戰鬥",----竞技战斗
	[8] = "咒印升級",----斗魂升级
	[9] = "挑戰任務",----挑战任务
	[10] = "日常放送",----日常放送
	[11] = "神器培養",----神器培养
	[12] = "公會貢獻",----公会贡献
	[13] = "試煉寶箱",----试炼宝箱
	[14] = "試煉積分",----试炼积分
	[15] = "銅幣獲得",----金币获得
}

-- 钻石十连抽解锁条件
tipStringInfo_diamond_ten_reward_tips = {
	"1級解鎖",    -- 1
	"65級解鎖",   -- 2
	"85級解鎖",   -- 3
}

-- 万代绑定谷歌
tipStringInfo_bind_google_play_tips = {
	"該註冊方式已經關閉，請使用其他登錄方式",    -- 1
	"去綁定",    -- 2
	"確定",    -- 3
	"已領取",    -- 4
	"該帳戶無法綁定",    -- 5
	"綁定成功",    -- 5
}

-- 空岛探索事件名称
tipStringInfo_file_island_event_name_tips = {
	"好友任務",    -- 1
	"團隊BOSS",    -- 2
	"隨機寶箱",    -- 3
	"趣味問答",    -- 4
	"單人挑戰",    -- 5
	"休息",    -- 6
}

-- 空岛探索
tipStringInfo_file_island_tips = {
	"開啟次數已達上限",    -- 1
	"一共回答了%d道題目，%d題回答正確，以下是你獲得的獎勵",    -- 2
	"單人挑戰%d",    -- 3
	"是否要退出單人挑戰",    -- 4
	"本次探索一共探索了%d次",    -- 5
	"休息",    -- 6
	"關卡未解鎖",   	-- 7
	"探索幣不足",	-- 8	
	"暫無團隊BOSS可挑戰",		-- 9
	"暫無任務可領取",		-- 10
	"已挑戰過該BOSS",	-- 11
	"已達到今日可參加好友BOSS次數上限",	-- 12	
	"回答正確，學霸附體！",	-- 13
	"回答錯誤，再接再厲！",	-- 14
	"即將開啟",	-- 15
	"探索點不足",	-- 16
	"距離下次邀請時間還有%s",	-- 17
	"刷新成功",	-- 18
	"挑戰次數不足！",	-- 19
}
-- 钻石充值限制
tipStringInfo_diamond_recharge_tips = {
	"儲值功能暫未開放",     -- 1
}
--成长之路
tipStringInfo_path_growth_tips = {
	"%s級解鎖", -- 1
	"免費領取", -- 2
	"圓", -- 3
	"此次儲值只在本活動有效", -- 4
	"領取", -- 5
	"活動已結束！", -- 5
}
--探索
tipStringInfo_exploration_tips = {
	"那是障礙物，無法尋路", -- 1
	"是否要退出單人挑戰",    -- 2
	"%d級開啟",    -- 3
	"恭喜您獲得%s*%d",    -- 4
	"是否要退出捕捉挑戰",    -- 5
	"是否花費%d鑽石購買一次捕捉次數",    -- 6
	"是否要結束本次捕捉",    -- 7
	"效果拔羣！獲得%d星%s整卡！",    -- 8
	"探索各種事件可累計獲得積分，領取各式獎勵",    -- 9 每日积分
	"探索各種事件可累計獲得積分，領取各式獎勵",    -- 10 累计积分
	"是否消耗%d鑽石刷新商店",    -- 11
	"精力不足",    -- 12
	"是否消耗%d精力刷新事件，所有事件將會重置（boss除外）",    -- 13
	"人物行走中，地圖無法切換", --14
}

tipStringInfo_exploration_event_name_tips = {
	"隨機寶箱",    -- 1
	"休息",    -- 2
	"BOSS挑戰",    -- 3
	"趣味答題",    -- 4
	"捕捉",    -- 5
	"單人挑戰",    -- 6
}
--新活动豪华首充
tipStringInfo_new_activity_tips = {
	"你已儲值 %s 金幣, 再儲值 %s 金幣即可領取", -- 1
	"活動已結束", -- 2
	"請輸入正確的啟動碼", -- 3
	"請輸入啟動碼", -- 4
}

--征途精英关卡
tipStringInfo_pve_main_tips = {
	"普通",    -- 1
	"精英",    -- 2
	"噩夢",    -- 3
}
--大冒险
tipStringInfo_pikachu_tips = {
	"活動結束", -- 1
	"忍者跑累了，喫碗拉麪補充一下，扣掉%d金幣",    -- 2
	"擁有骰子：",    -- 3
	"免費次數：",    -- 4
	"圈",    -- 5
}
--秘宝
tipStringInfo_pokemon_treasure_tips = {
	"單抽獎勵%d積分", -- 1
	"連抽獎勵%d積分", -- 2
	"免費", -- 3
	"積分", -- 4
	"積分不足", -- 5
	"無限制", -- 6
	"恭喜玩家%|4|!x@%運氣爆棚,在忍者祕寶活動抽到%|!qulity@|!y@*!n@%", -- 7
	"%|9|VIP!x@%或%|9|戰力!y@%的玩家可參加此活動", -- 8
}
--每日充值送礼
tipStringInfo_daily_recharge_tips = {
	"每日限購%d次", -- 1
	"無限制", -- 2
}
--每日单笔充值、单笔充值
tipStringInfo_daily_once_recharge_tips = {
	-- 每日单笔充值
	"1.每日單筆充值對應檔位，即可獲得獎勵，累計充值達到檔位，不能領取此檔位獎勵", -- 1
	"2.只可完成規定的次數，超過完成次數，無法重複領取獎勵。每天會刷新可完成次數", -- 2
	--单笔充值
	"1.單筆充值對應檔位，即可獲得獎勵，累計充值達到檔位，不能領取此檔位獎勵", -- 3
	"2.只可完成規定的次數，超過完成次數，無法重複領取獎勵。", -- 4
}
tipStringInfo_pokemon_recharge_rank_tips = {
  "第",
  "~",
  "",
  "需要 %d 點",
  "未上榜",
  "保持當前排名（第%d名），即可獲得以下獎勵：",
}
--超进化·八门遁甲
tipStringInfo_maga_unlock = {
	"當前忍者星級至%d",  -- 1
	"當前忍者進階至%s",  -- 2
	"當前忍者咒印等級總數至%d", --3
	"當前忍者八門至%d階%d級",  --4
	"當前忍者裝備總星數至%d", --5
	"當前忍者手印總等級至%d", --6
	"進階等級至%s", --7
	"八門%d階%d級",--8
	"當前忍者手印放滿且都為%s品質",--9
	"%d階屬性加成", --10
	"八門%d階段",--11
	"%d階進化進度",--12
	"屬性提升", --13
	"無", --14
	"武器覺醒後纔可以使用八門必殺技", --15
	"未開啟八門", --16
}
--超进化（八门）进阶对应 =
tipStringInfo_maga_uplv = {
  [1]   = "綠",   --1
  [2]   = "綠+1", --2
  [3]   = "綠+2", --3
  [4]   = "藍",   --4
  [5]   = "藍+1", --5
  [6]   = "藍+2", --6
  [7]   = "藍+3",  --7
  [8]   = "紫",   --8
  [9]   = "紫+1", --9
  [10]  = "紫+2", --10
  [11]  = "紫+3", --11
  [12]  = "紫+4", --12 
  [13]  = "橙",   --13
  [14]  = "橙+1", --14
  [15]  = "橙+2", --15
  [16]  = "橙+3", --16
  [17]  = "橙+4", --17
  [18]  = "橙+5", --18
  [19]  = "紅",   --19
  [20]  = "紅+1", --20
  [21]  = "紅+2", --21
  [22]  = "紅+3", --22
  [23]  = "紅+4", --23
  [24]  = "紅+5", --24
  [25]  = "金",   --25
}

-- 图鉴
tipStringInfo_exploreBook_unlock_tips = {
	"未達到圖鑒啟動條件",  -- 1
}
--扭蛋
tipStringInfo_egg_machine = {
	"達到%|9|!x@%級並且達到%|9|VIP!y@%可參與活動",  -- 1
}
--节日红包
tipStringInfo_red_packet = {
	"的紅包", --1
}

--世界boss
tipStringInfo_world_boss = {
	"已結束", -- 1
	"個人名稱",--2
	"工會名稱",--3
	"攻打九尾 %d 次",--4
	"在一次封印九尾活動中造成 %d 總傷害",--5
	"金幣刷新 %d 次挑戰CD",--6
	"虛位以待",--7
	"未上榜",--8
	"補刀大神！精準打擊！您獲得了最後一擊獎勵！",--9
	"幸運大神！踩了狗屎！您獲得了驚喜大獎獎勵！",--10
	"下期開啟時間",--11
	"本期剩餘時間",--12
	"是否消耗%d金幣重置冷卻",--13
	"獎勵通過郵件發放",--14
	"驚喜大獎通過郵件發放，最後一擊即時發放",--15
}

--援护小队
tipStringInfo_soul_warding = {
	"忍者%d個開啟八門階段%d", --1
	"上級援護等級%d", --2
	"擁有%d個忍者進階至%s", --3
	"圖鑒等級%d",--4
	"戰隊等級達到%d級",--5
	"擁有%d個忍者等級至%d級", --6
	"解鎖條件未完成",--7
	"該守護未啟動",--8
}

--援护小队名称
tipStringInfo_soul_warding_name = {
  "火之守護",  --1
  "山之守護",  --2
  "雷之守護",  --3
  "林之守護",  --3
}

--大师训练营
tipStringInfo_training_camp_name = {
	"每日限購%d",--1
	"賽季限購%d",--2
    "%d級解鎖",--3
    "等級不足",--4
    "訓練幣不足",--5
    "兌換成功",--6
    "無限購",--7
    "可升%d級",--8
    "經驗值",--9
    "請先成為影級任務大師哦~",--10
    "  恭喜您從經驗包中獲得%d經驗",--11
    "您今日已領過經驗包了喲",--12
    "    購買成功,恭喜您獲得%d經驗",--13
    "充值滿%d可購買禮包哦~",--14
    "未達充值條件哦~",--15
    "任務集會所s%d賽季",--16
    "...等",--17
    "任務集會所s%d結束時間:",--18
	"每日獲得經驗已達上限，完成任務不會獲得經驗",--19
    "購買等級?",--20
    "已到滿級了喲~",--21
    "購買進階禮包",--22
    "購買豪華進階禮包",--23
    "恭喜獲得影級任務大師稱號",--24
} 

--强制更新
tipStringInfo_force_update_jump = {
	[1] = "https://itunes.apple.com/us/app/champion-trainer-new-journey/id1454350111?l=zh&ls=1&mt=8",
}

--积分赛
tipStringInfo_rescue_station = {
   "第",--1
   "名",--2
   "批量兌換",--3
   "任務證書不足",--4
   "捐贈此物品可獲得%d積分",--5
   "無可捐贈物品",--6
   "捐贈成功",--7
   "請先完成所有任務喲~",--8,
   "已經領過了喲~",--9
   "恭喜您獲得%d積分",--10
   "已到上限了喲~",--11
   "次數用完了喲~",--12
   "領取倒計時:",--13
}

tipStringInfo_rescue_silkbag = {
	"您的揹包暫時還沒有忍具哦!",--1
	"生命 ",--2
	"攻擊 ",--3
	"防禦 ",--4
	"未裝備",--5
	"您要分解的忍具品質較高,確定分解?",--6
	"道具不足!",--7
	"升階中",--8
	"無此類專屬忍具",--9
	"已經滿級了",--10
	"升級經驗",--11
	"升級消耗",--12
	"升階消耗",--13
	"（長按可以連續使用升級道具）",--14
	"（突破小貼士）",--15
	"是否消耗 %d個 %s 置換",--16
	"替換道具%d不足",--17
	"忍具等級沒有變化",--18
	"您要分解的忍具已升級，分解將返還全部資源，確定分解？",--19
	"未選擇任何需要分解的忍具", -- 20
	"第1階段（默認解鎖)", -- 21
	"第2階段（自身達到%s級，並護佑了%s個%s資質以上的護佑型忍具）", -- 22
	"第%s階段（自身達到%s級，並護佑了%s個%s資質以上的護佑型忍具，且至少%s個為自身專屬）", -- 23
	"當該忍具達到%s級時可開啓護佑功能", --24
}

tipStringInfo_rescue_silkbag_property = {
	["-1"] = "無",
	["0"] = "生命:",
	["1"] = "攻擊:",
	["2"] = "防禦:",
	["3"] = "魔防",
	["4"] = "生命",
	["5"] = "攻擊",
	["6"] = "防禦",
	["7"] = "魔防",
	["8"] = "暴擊率:%d",
	["9"] = "抗暴率:%d",
	["10"] = "格擋率:%d",
	["11"] = "破格擋率:%d",
	["12"] = "命中率:%d",
	["13"] = "閃避率:%d",
	["14"] = "物理免傷",
	["15"] = "魔法免傷",
	["16"] = "治療率:%d",
	["17"] = "被治療率:%d",
	["18"] = "最終傷害",
	["19"] = "最終減傷:",
	["20"] = "初始怒氣:",
	["21"] = "體質",
	["22"] = "力量",
	["23"] = "速度:",
	["24"] = "物理攻擊",
	["25"] = "額外傷害",
	["26"] = "治療值",
	["27"] = "被治療值",
	["28"] = "灼燒傷害",
	["29"] = "中毒傷害",
	["30"] = "灼傷免傷",
	["31"] = "中毒免傷",
	["32"] = "經驗",
	["33"] = "傷害加成:%d",
	["34"] = "傷害減免:%d",
	["35"] = "PVP終傷",
	["36"] = "PVP免傷",
	["37"] = "初始合擊點數",
	["38"] = "每次出手增加的怒氣",
	["39"] = "灼燒傷害:%d",
	["40"] = "吸血率:%d",
	["41"] = "怒氣",
	["42"] = "反彈率:%d",
	["43"] = "暴傷加成:%d",
	["44"] = "免控率%",
	["45"] = "小技能概率:%d",
	["46"] = "格擋加成:%d",
	["47"] = "控制率%",
	["48"] = "--(治療效果%,廢棄）",
	["49"] = "--(暴擊強化%,廢棄）",
	["50"] = "--(忍者類型剋制傷害%,廢棄）",
	["51"] = "--(濺射傷害%,廢棄）",
	["52"] = "--(技能傷害%,廢棄）",
	["53"] = "被治療率減少:%d",
	["54"] = "傷害提升:%d",
	["55"] = "必殺傷害率:%d",
	["56"] = "增加造成的必殺傷害%",
	["57"] = "減少造成的必殺傷害%",
	["58"] = "暴傷加成:%d",
	["59"] = "減少暴擊傷害%",
	["60"] = "受到的必殺傷害增加%",
	["61"] = "怒氣回覆速度%",
	["62"] = "受到直接傷害降低%",
	["63"] = "降低攻擊(%)",
	["64"] = "降低防禦",
	["65"] = "傷害加成百分比提升%",
	["66"] = "降低必殺傷害率%",
	["67"] = "--(降低傷害減免百分比%,廢棄）",
	["68"] = "降低防禦（%）",
	["69"] = "降低怒氣回覆速度%",
	["70"] = "忍者類型剋制傷害加成%",
	["71"] = "忍者類型剋制傷害減免%",
	["72"] = "降低攻擊",
	["73"] = "增加必殺抗性%",
	["74"] = "減少必殺抗性%",
	["75"] = "降低免控率%",
	["76"] = "復活概率%",
	["77"] = "被複活概率%",
	["78"] = "復活繼承血量%",
	["79"] = "復活繼承怒氣%",
	["80"] = "被複活繼承血量%",
	["81"] = "被複活繼承怒氣%",
	["82"] = "增加復活概率%",
	["83"] = "增加復活繼承血量%",
	["84"] = "小技能傷害提升",
}


tipStringInfo_activity_local_data_property = {
	["17"] = "累計消耗%d金幣",			-- 累计消耗钻石
	["81"] = "銅幣抽卡%d次,金幣抽卡%d次",			        -- 抽卡送礼
	["83"] = "競技積分達到%d",			-- 竞技积分奖励
	["95"] = "累計抽裝備寶箱%d次",			-- 抽装备宝箱得天赋点
	["96"] = "抽裝備寶箱%d次",			-- 抽装备宝箱有礼
	["102"] = "購買體力%d次",		        -- 体力购买次数奖励
	["103"] = "搖錢%d次",		            -- 点金次数奖励
	["104"] = "蛇道試煉達到%d積分",		-- 试炼积分奖励
	["105"] = "開啟蛇道試煉寶箱%d次",		-- 试炼宝箱开启次数奖励
	["106"] = "單筆儲值%d金幣",			-- 充值送资源
	["107"] = "單筆儲值%d金幣",				-- 充值返钻
	["108"] = "主線關卡挑戰%d次",			-- 主线关卡挑战奖励
	["109"] = "精英關卡挑戰%d次",			-- 精英关卡挑战奖励
	["110"] = "消耗%d銅幣",			    -- 金币消耗奖励
	["115"] = "消耗%d金幣",			    -- 消耗钻石返利活动
	["113"] = "",
	["121"] = "",
	["124"] = "",
	["126"] = "",
	["138"] = "金幣購買合金%d次",			-- 抽合金有礼
	["145"] = "單筆儲值%d金幣",				-- 单笔充值
	["140"] = "忍者淨化%d次",			-- 净化挑战有礼
	["141"] = "獲得%d搜尋點數",			-- 探索有礼
	["151"] = "單筆儲值%d金幣",				-- 每日单笔充值 (texto del ["107"])
	["152"] = "每日充值%d金幣",
	["153"] = " ",			                -- 筋斗云任务
	["178"] = "單筆儲值%d金幣",			                -- 特惠礼包
	["179"] = "每日充值%d金幣",			                -- 单笔充值
}


--跨服王者之战提示文字
tipStringInfo_cross_server_king_battel_tips = {
	"陣型沒有變化",											--1
	"戰鬥已經結束,無法提交陣容",							--2
	"陣容修改成功",							--3
}
--组合卡相关文字配置
tipStringInfo_combination_card_configure = {
	"敬請期待",			                --1 
	"戰鬥力: 0",							--2 未解锁时
	"戰鬥力: %d/%d",							--3
	"·（杜門%d階/景門%d階）",			--4 解锁阶级条件
	"鑲嵌卡星級:%d/%d",						--5 进阶条件1
	"八門階數:%d/%d,八門子階數%d/%d",			--6 进阶条件2
	"戰力:%d/%d",  					--7 进阶条件3
	"當前組合卡上陣數(%d)",				--8 当前上阵数
	"擴充後上陣數(%d)",				    --9 扩充后上阵数
	"%s星級:%d/%d",						--10 解锁条件
	"等級:%d",						-- 11 等级显示
	"固定槽等級之和達到:%d",		-- 12 槽位解锁条件
	"固定槽位%d等級達到:%d",		-- 13 槽位解锁条件
	"未解鎖",					-- 14 未解锁
	"可解鎖",					-- 15 可解锁			
}

--组合卡相关文字颜色配置(rgb三色数值)
tipStringInfo_combination_card_configure_color = {
	"127,127,127",			                --1 敬请期待(置灰)
	"0,128,0",							            --2 条件达成(绿色)
	"255,0,0",							     --3 条件未达成(红色)
	"0,255,0",										--4 消耗道具够
	"255,0,0",										--5 消耗道具不够
}

--组合卡提示文字
tipStringInfo_combination_card_tip = {
	"解鎖成功",			                --1 
	"升級成功",							--2 
	"升階成功",							--3
	"槽位解鎖成功",			--4 
	"擴充成功",			 --5
	"擴充券不足",			--6
	"條件未達成",				--7
	"沒有符合條件的上陣卡",		-- 8
	"組合卡已上陣,鑲嵌卡不可更改",	--9
	"沒有相應碎片,無法轉化",		-- 10
	"已達擴充上限!",				-- 11
	"道具不足!",					-- 12
	"已達等級上限！",					-- 13
}

-- 组合卡品质色彩
tipStringInfo_combination_card_quality = {
	"白",						--1
	"綠",						--2
	"藍",						--3
	"紫",						--4					--5
	"白",						--6
	"橙",						--7
}
--特权卡按钮文本
tipStringInfo_vip_card_tip = {
	"充值%s鑽石",			                --1 
	"領取",							--2 
	"已領取",							--3
	"VIP%s每日獎勵",							--4	
}
-- 公会援助相关描述
tipStringInfo_union_donation_tip = {
	"一天前",						--1
	"您還沒有選擇需要求助的碎片",						--2
	"您今日的援助獎勵已達上限,無法繼續獲得援助獎勵",						--3
    "您今日該類型的援助獎勵已達上限，繼續捐贈將無法獲得援助獎勵，是否確認捐贈",
}
-- 大R专属
tipStringInfo_Exclusive_customer_service_tip = {
	"恭喜成為%d。非常感謝您的支持。成為%d後，可享受營運團隊提供的禮物和更優質的服務。請透過%s聯繫我們",				--1
}
-- 卡册系统描述
tipStringInfo_illustration_tip = {
	"%d級卡冊",			                --1 卡册等级
	"0,0,0",							--2 道具不足颜色
	"0,128,0",							--3 道具足颜色
	"開啓成功!",						--4 激活成功	
	"未上榜",							--5 排行未上榜
	"級",								--6 等级		
	"0,128,0",							--7 成就颜色	
	"卡冊評分達到%s啟動:",				--8 成就文本
	"%s    對應卡冊等級達到%s/%s級",					--9 组合卡册基础条件
	"未完成",							--10 组合卡册特殊条件
	"已完成",							--11 组合卡册特殊条件
	"你還未激活此卡",					--12 组合卡册跳转提示
	"還差%s個%s即可升級卡冊",			--13 组合卡册跳转提示
	"隱藏任務進度    %s",				--14 组合卡册隐藏条件文本
	"共%s條隱藏任務完成",				--15 组合卡册隐藏条件文本

}
tipStringInfo_property_name_and_value = {
	["-1"] = "無",
	["0"] = "生命:",
	["1"] = "攻擊:",
	["2"] = "防禦:",
	["3"] = "魔防",
	["4"] = "生命",
	["5"] = "攻擊",
	["6"] = "防禦",
	["7"] = "魔防",
	["8"] = "暴擊率:%s",
	["9"] = "抗暴率:%s",
	["10"] = "格擋率:%s",
	["11"] = "破格擋率:%s",
	["12"] = "命中率:%s",
	["13"] = "閃避率:%s",
	["14"] = "物理免傷",
	["15"] = "魔法免傷",
	["16"] = "治療率:%s",
	["17"] = "被治療率:%s",
	["18"] = "最終傷害",
	["19"] = "最終減傷:",
	["20"] = "初始怒氣:",
	["21"] = "體質",
	["22"] = "力量",
	["23"] = "速度:",
	["24"] = "物理攻擊",
	["25"] = "額外傷害",
	["26"] = "治療值",
	["27"] = "被治療值",
	["28"] = "灼燒傷害",
	["29"] = "中毒傷害",
	["30"] = "灼傷免傷",
	["31"] = "中毒免傷",
	["32"] = "經驗",
	["33"] = "傷害加成:%s",
	["34"] = "傷害減免:%s",
	["35"] = "PVP終傷",
	["36"] = "PVP免傷",
	["37"] = "初始合擊點數",
	["38"] = "每次出手增加的怒氣",
	["39"] = "灼燒傷害:%s",
	["40"] = "吸血率:%s",
	["41"] = "怒氣",
	["42"] = "反彈率:%s",
	["43"] = "暴傷加成:%s",
	["44"] = "免控率%",
	["45"] = "小技能概率:%s",
	["46"] = "格擋加成:%s",
	["47"] = "控制率%",
	["48"] = "--(治療效果%,廢棄）",
	["49"] = "--(暴擊強化%,廢棄）",
	["50"] = "--(忍者類型剋制傷害%,廢棄）",
	["51"] = "--(濺射傷害%,廢棄）",
	["52"] = "--(技能傷害%,廢棄）",
	["53"] = "被治療率減少:%s",
	["54"] = "傷害提升:%s",
	["55"] = "必殺傷害率:%s",
	["56"] = "增加造成的必殺傷害%",
	["57"] = "減少造成的必殺傷害%",
	["58"] = "暴傷加成:%s",
	["59"] = "減少暴擊傷害%",
	["60"] = "受到的必殺傷害增加%",
	["61"] = "怒氣回覆速度%",
	["62"] = "受到直接傷害降低%",
	["63"] = "降低攻擊(%)",
	["64"] = "降低防禦",
	["65"] = "傷害加成百分比提升%",
	["66"] = "降低必殺傷害率%",
	["67"] = "--(降低傷害減免百分比%,廢棄）",
	["68"] = "降低防禦（%）",
	["69"] = "降低怒氣回覆速度%",
	["70"] = "忍者類型剋制傷害加成%",
	["71"] = "忍者類型剋制傷害減免%",
	["72"] = "降低攻擊",
	["73"] = "增加必殺抗性%",
	["74"] = "減少必殺抗性%",
	["75"] = "降低免控率%",
	["76"] = "復活概率%",
	["77"] = "被複活概率%",
	["78"] = "復活繼承血量%",
	["79"] = "復活繼承怒氣%",
	["80"] = "被複活繼承血量%",
	["81"] = "被複活繼承怒氣%",
	["82"] = "增加復活概率%",
	["83"] = "增加復活繼承血量%",
	["84"] = "小技能傷害提升",
}
tipStringInfo_property_harden_name_and_value = {
	["-1"] = "無",
	["0"] = "生命:",
	["1"] = "攻擊:",
	["2"] = "防禦:",
	["3"] = "魔防",
	["4"] = "生命:%s",
	["5"] = "攻擊:%s",
	["6"] = "防禦:%s",
	["7"] = "魔防",
	["8"] = "暴擊率:%s",
	["9"] = "抗暴率:%s",
	["10"] = "格擋率:%s",
	["11"] = "破格擋率:%s",
	["12"] = "命中率:%s",
	["13"] = "閃避率:%s",
	["14"] = "物理免傷",
	["15"] = "魔法免傷",
	["16"] = "治療率:%s",
	["17"] = "被治療率:%s",
	["18"] = "最終傷害",
	["19"] = "最終減傷:",
	["20"] = "初始怒氣:",
	["21"] = "體質",
	["22"] = "力量",
	["23"] = "速度:",
	["24"] = "物理攻擊",
	["25"] = "額外傷害",
	["26"] = "治療值",
	["27"] = "被治療值",
	["28"] = "灼燒傷害",
	["29"] = "中毒傷害",
	["30"] = "灼傷免傷",
	["31"] = "中毒免傷",
	["32"] = "經驗",
	["33"] = "傷害加成:%s",
	["34"] = "傷害減免:%s",
	["35"] = "PVP終傷",
	["36"] = "PVP免傷",
	["37"] = "初始合擊點數",
	["38"] = "每次出手增加的怒氣",
	["39"] = "灼燒傷害:%s",
	["40"] = "吸血率:%s",
	["41"] = "怒氣",
	["42"] = "反彈率:%s",
	["43"] = "暴傷加成:%s",
	["44"] = "免控率%",
	["45"] = "小技能概率:%s",
	["46"] = "格擋加成:%s",
	["47"] = "控制率%",
	["48"] = "--(治療效果%,廢棄）",
	["49"] = "--(暴擊強化%,廢棄）",
	["50"] = "--(忍者類型剋制傷害%,廢棄）",
	["51"] = "--(濺射傷害%,廢棄）",
	["52"] = "--(技能傷害%,廢棄）",
	["53"] = "被治療率減少:%s",
	["54"] = "傷害提升:%s",
	["55"] = "必殺傷害率:%s",
	["56"] = "增加造成的必殺傷害%",
	["57"] = "減少造成的必殺傷害%",
	["58"] = "暴傷加成:%s",
	["59"] = "減少暴擊傷害%",
	["60"] = "受到的必殺傷害增加%",
	["61"] = "怒氣回覆速度%",
	["62"] = "受到直接傷害降低%",
	["63"] = "降低攻擊(%)",
	["64"] = "降低防禦",
	["65"] = "傷害加成百分比提升%",
	["66"] = "降低必殺傷害率%",
	["67"] = "--(降低傷害減免百分比%,廢棄）",
	["68"] = "降低防禦（%）",
	["69"] = "降低怒氣回覆速度%",
	["70"] = "忍者類型剋制傷害加成%",
	["71"] = "忍者類型剋制傷害減免%",
	["72"] = "降低攻擊",
	["73"] = "增加必殺抗性%",
	["74"] = "減少必殺抗性%",
	["75"] = "降低免控率%",
	["76"] = "復活概率%",
	["77"] = "被複活概率%",
	["78"] = "復活繼承血量%",
	["79"] = "復活繼承怒氣%",
	["80"] = "被複活繼承血量%",
	["81"] = "被複活繼承怒氣%",
	["82"] = "增加復活概率%",
	["83"] = "增加復活繼承血量%",
	["84"] = "小技能傷害提升：%s",
	["90"] = "防克攻傷害加成：%s",
	["91"] = "攻克技傷害加成：%s",
	["92"] = "技克防傷害加成：%s",
	["93"] = "防克攻傷害減免：%s",
	["94"] = "攻克技傷害減免：%s",
	["95"] = "技克防傷害減免：%s",
	
}

tipStringInfo_activity_limit_pool = {
	"第%s名",			                			--1 提示文本
	"金幣不足",										--2 提示文本
	"每充值%s金幣，可獲得一次抽取機會！",			--3 提示文本
	"未上榜",										--4 提示文本
	"活動已結束，現在爲展示時間",					--5 提示文本
	"恭喜獲得%s積分，贈送：",						--6 提示文本
	"抽取一次",										--7 提示文本
	"抽取十次",										--8 提示文本
	"%s積分以上才能上榜"
}

tipStringInfo_recharge_repair_tips = {
	"親愛的玩家:如果你在使用谷歌支付的時候，提示錯誤，那說明你的應用的支付系統出現了問題，爲了解決這個問題，我們開放了PAYPAL和WORLDPAY，這兩個都是我們的官方支付渠道，沒有任何危險，且可以獲得更多的鑽石。",			                			--1 提示文本1
	"使用說明:如果您依然希望使用谷歌支付，那麼請點擊下方按鈕去谷歌商店下載官方修復工具或者點擊支付選擇谷歌支付也會跳轉，下載後無需打開該工具，重啓遊戲即可恢復谷歌支付，若依然有問題，請通過郵箱與我們取得聯繫",										--2 提示文本2
}
tipStringInfo_activity_fortune_bag = {
	"抽取一次",										--1
	"抽取十次",										--2
	"活動已結束!",									--3
	"稀有獎勵",										--4
	"普通獎勵",										--5
	"配對獎勵",										--6

}
tipStringInfo_activity_private_custom = {
	"請先選擇道具",			                			--1
	"充值%s金幣",			                			--2
}
reconnect_view_string = {
" ",
"網絡不穩定，請檢查您的網絡，然後重試",
" ",
" ",
}
tipStringInfo_activity_egg_dance = {
	"超過購買最大上限",			                		--1
	"金幣不足",			                				--2
	"再來一次",			                				--2

}
-- 跨服竞技小队提示
tipStringInfo_team_arena = {
	"申請成功",	--1
	"邀請成功", --2
	"是否請離該隊員",--3
	"是否退出該隊伍",--4
	"是否提交隊伍",--5
	"是否轉讓隊伍",--6
	"隊伍名稱不能爲空",--7
	"請輸入%s-%s的數字",--8
	"本次競技已結束,期待您下一次再來",--9
	"陣型調整成功",--10
}
-- 夏日酷饮活动提示
tipStringInfo_activity_summer_drink = {
	"任務",			                		--1 单个任务标题
	"完成進度",			                	--2 行列任务标题
	"任務%s完成進度",			            --3 行列描述内容
}
-- 秘境之旅活动提示
tipStringInfo_activity_secret_treasure = {
	"第%s層",			                		--1 
	"您已找到終極寶物，",			            --2 
	"請設置終極獎勵",			                --3 
	"第%s層解鎖",			                	--4 
	"是否進入下一層",			                --5 
	"是否放棄未獲得的剩餘獎勵並前往下一層？",	--6 
}
-- 装备淬炼提示
tipStringInfo_equipment_harden = {
	"裝備覺醒到5星開啓淬鍊",			                		--1 淬炼限制提示
	"花費一個%s鎖定該詞條,在置換時會消耗",			            --2 锁定提示
	"1/%d",			                --3 	锁定花费的锁定石
	"無可置換詞條",			                --4 	置换提示
	"255,0,0",								--5	重生后属性变色(rgb三色值)
	"已到等級上限了喲~",						--6 等级上限提示
	"(範圍:%s)",						--7 范围提示
	"鎖定石消耗完畢,自動取消鎖定",						--8 道具不足提示
	"鎖定石不足",					--9 锁定石道具不足提示
	"%s級",					--10  等级描述
}
-- 帐号封停提示
tipStringInfo_account_closure = {
	"你的帳號已被封停,解封倒計時%s，詳情請聯繫客服",          --1 封禁提示
	"你的帳號已被永久封停，詳情請聯繫客服",							--2 永久封禁提示						
}
-- 忍列传提示
tipStringInfo_role_biography = {
	"激活成就",			    					--1 
	"印記值+%s",			           		 	--2 
	"通過占卜獲得",			                	--3 
	"通過活動獲得",			                	--4 
	"%s印記",			               			--5 
	"解鎖篇章:",			               		--6 
	"解鎖升星:",			               		--7 
	"該章節尚未解鎖",			               	--8
	"(已激活%s個忍列傳）",						--9
	"升至%s星",									--10
	"印記值達到%s",								--11
	"未上榜",									--12
	"銅錢不足",									--13
	"金幣不足",									--14
	"免費%d次",									--15
	"占卜1次",									--16
	"占卜10次",									--17
	"道具不足",									--18
	"激活成就:%s",								--19
	"獲得大量屬性加成", 						--20
	"累計占卜%s/%s",							--21
}

tipStringInfo_command_world = {
	"未上榜",			    					--1 
	"%s積分可上榜",			    				--2
	"積分+%s",									--3
	"公會積分等級:%s",							--4
	"可購買%s次",								--5
	"未上榜",									--6
	"已經是最大可購買次數啦",					--7
	"已經是最小可購買次數啦",					--8
	"兌換道具不足",								--9
	"結束：",									--10
	"已結束",									--11
	"開啓：",									--12
	"當前處於領獎展示階段",						--13
	"跨服排行暫未開啓",							--14
	"暫無公會",									--15
	"您現在還沒有加入公會",						--16
	"當前處於結算中",						--17
}
tipStringInfo_activity_exchange_prop = {
	"當前兌換的專屬刃具尚未裝備，且揹包中只有一個，是否確認消耗該刃具",			--1 
}
-- 超級掃蕩提示
tipStringInfo_mopping_word = {
	"掃蕩%s次",			    					--1 
	"重置",			    					--1 
	"40",			    					--1 
	"40級開啓",			    					--1 
}
-- 半月礼活动
tipStringInfo_activity_month_gift_word = {
	"%s天",			    					--1
	"領取",			    					--2
	"已領取",			    					--3
	"等級和累計登錄天數不足，無法領取",          --4
	"累計登錄天數不足，無法領取",        --5
	"等級不足，無法領取",          --6
	"已過期",          --7
	"此禮包領取時間已結束",          --8
}
-- 超值团购活动提示
tipStringInfo_activity_group_buy = {
	"充值%s鑽石",			                --1 
	"禮包%s",			                	--2 
	"%s鑽石",			            		--3 
	"全服累計購買團購禮包次數達到%s次",			            		--4
	"個人累計購買團購禮包次數達到%s次",			            		--5 
	"個人累計購買充值團購禮包次數達到%s次",			            		--6
	"領取",  														--7
	"未完成",  													 --8
	"已領取",                                                      --9
	"%s次",                                                       --10
	"今日限購:",                                                         --11
	"本期限購:",                                                         --12
	"%s折",                                                            --13 XX折扣
	"活動已結束,請期待下次開放", 									--14
}
-- 神兽系统文本
tipStringInfo_magical_animals_word = {
	"完全點亮當前天命後解鎖",			    					--1
	"%s階",	--2
	"神鍛",	--3
	"%s階天賦",	--4
	"解鎖神獸所需的道具不足",	--5
	"%s星激活",	--6
	"當前階數神鍛 進度已滿，是否繼續神鍛",--7
	"請選擇需要重生的神獸",	--8
	"%s升星後可激活額外效果",--9
	"%s回合",--10
	"解鎖神獸後方可神鍛",--11
	"暫無",--12
	"當前星級已滿級",--13
	"所需道具不足",--14
	"按照技能冷卻時間釋放",--15
	"技能冷卻時間一到就釋放技能，若同時完成冷卻時間則按照配置順序釋放，",--16
	"按照技能配置釋放順序釋放",--17
	"嚴格按照配置順序釋放技能，若前一共技能沒有釋放，則後面技能即使完成冷卻也不會釋放",--18
	"神鍛已滿級",--19
	"活動",--20
	"該道具可從活動中獲得",--21
}

-- 神兽属性文本
tipStringInfo_magical_animals_property_name_and_value = {
    ["-1"] = "無",
	["0"] = "全體生命:",
	["1"] = "全體攻擊:",
	["2"] = "全體防禦:",
	["4"] = "全體生命:%s",
	["5"] = "全體攻擊:%s",
	["6"] = "全體防禦:%s",
    ["96"] = "神獸攻擊:",
	["97"] = "神獸攻擊加成:%s",
	["98"] = "神獸傷害增加:%s",
	["99"] = "神獸傷害減免:%s",
	["100"] = "神獸受到的傷害增加:%s",
	["101"] = "神獸受到的傷害降低:%s",
	["102"] = "神獸暴擊傷害:%s",
	["103"] = "神獸暴擊率:%s",
	["104"] = "神獸抗暴率:%s",
}
-- 战魂
tipStringInfo_fight_spirit = {
	[1] = "號位",
	[2] = "主要屬性",
	[3] = "隨機屬性",
	[4] = "覺醒屬性",
	[5] = "套裝屬性",
	[6] = "套裝技能",
	[7] = "材料不足",
	[8] = "裝備[%s]4件套可激活",
	[9] = "強化至%d級可增強一條隨機屬性",
	[10] = "材料已添加滿",
	[11] = "尚未激活套裝技能",
	[12] = "揹包",
	[13] = "獲得隨機屬性強化",
	[14] = "屬性鎖定保持不變",
	[15] = "每次僅能鎖定3項，請解鎖另一項後嘗試",
	[16] = "滿級",
	[17] = "經驗已達上限",
	[18] = "(強化%s)",
	[19] = "當前無戰魂可裝備",
	[20] = "當前未裝備戰魂",
	[21] = "當前無戰魂可消耗",
	[22] = "當前未添加戰魂",
	[23] = "該戰魂已上鎖",
	[24] = "有已上鎖戰魂，請先解鎖",
	[25] = "(只能激活一次)",
	[26] = "獲得%s條隨機屬性",
	[27] = "獲得隨機覺醒屬性",
	[28] = "已強化至最高等級",
	[29] = "當前添加材料已達上限",
	[30] = "還沒有裝備戰魂",
	[31] = {144,238,144},--强化成功界面字体颜色
	[32] = {255,255,255},--战魂详情面板正常颜色
	[33] = {191,191,191},--战魂详情面板未激活颜色
	NONE = "無",
}

--战魂品质
tipStringInfo_fight_spirit_quality = {
	"綠色",
	"藍色",
	"紫色",
	"橙色",
	"紅色",
}

tipStringInfo_pay_tips = {
	"網絡不穩定，請檢查您的網絡連接，然後重試",								--1 
	"付款正在驗證中。 如果付款成功並且未獲得商品，請再次按一下產品檔。",								--2 
	"充值失敗", -- 3
}


tipStringInfo_customer_service_tips = {							
	"https://chat.whatsapp.com/DGdFMxFHENs4dyNPdeQIZw", -- 1
	"親愛的忍者，歡迎你的到來，有什麼問題敬請留言", -- 2
	"https://ninjarevolution.ryzengames.com/", -- ONElink下载链接
	"加入Ninja Revolution的WhatsApp群組，獲取最新消息、活動和客服支援！"
}
-- 七日连充活动描述
tipStringInfo_seven_days_recharge_tips = {							
	"連續充值%s天可領取", -- 1
	"累計充值%s金幣可領取", -- 2
	"連續天數",--3
	"累計充值",--4
	"第%s天",--5
	"今天已參與充值,繼續充值將不會增加天數",--6
}
-- 代金券提示
tipStringInfo_vouchers_tips = {
	"%s小時後到期",								--1 
	"已過期",								--2 
	"是否選擇使用代金券,獲得金幣%s", -- 3
	"是否選擇出售代金券.", --5
	"%s分鐘後無法使用",								--5 
}
--竞速活动描述文本
tipStringInfo_racing_activity_description_tip = {
	"隊伍總戰力達成%s",							--1 
	"主角等級達成%s級",							--2 
}
-- 战力排行活动形象展示(对应Ship_mouldID)
tipStringInfo_fightRank_activity_ship_mould_id = {
  [1] = 351,
}

tipStringInfo_limit_time_equip_box_tips = {
	"需要達到%s積分 ",
}

tipStringInfo_limit_pray_activity_tips = {
	"已完成", -- 1
	"Go to",--2
	"Please select a wish reward at first", -- 3
	"Blessing*1",--4
	"Blessing*10",--5
	"Top up %s diamonds",--6
	"Receive",--7
	"(%s/%s)",--8 礼包限购提示文本			
	"Gift package purchase limit reminder text",--9
}

tipStringInfo_shop_restriction = {
	"每日限購",			                			--1 商店限购提示文本
	"每週限購",										--2 商店限购提示文本
	"每月限購",										--3 商店限购提示文本
	"每日5:00刷新",			                		--1 限购商店刷新提示文本
	"每週一5:00刷新",								--2 限购商店刷新提示文本
	"每月1日5:00刷新",									--3 限购商店刷新提示文本
}
tipStringInfo_limit_pray_activity_tips = {
	"已完成", -- 1
	"前往",--2
	"請先選擇祈願獎勵", -- 3
	"祈福一次",--4
	"祈福十次",--5
	"充值%s鑽石",--6
	"領取",--7
	"(%s/%s)",--8 礼包限购提示文本			
	"請先選擇獎勵",--9
}
tipStringInfo_christmas_romance_activity_tips = {
	"聖誕幸運券不足",--1
	"是否花費%s鑽石抽獎",--2
	"聖誕商城兌換券不足",--3
	"重置次數不足",--4
	"聖誕刷新券不足",--5
	"活動已結束",--6
	"幸運轉盤重置成功!",--7
}

-- 新服庆典标签內容
tipStringInfo_service_sevenday_type_name = {
	[1] = "等級星階",
	[2] = "能力排名",
	[3] = "星級",
	[4] = "當前獎勵（%s%%階段）： ",
	[5] = "下一獎勵（%s%%階段）： ",	
	[46001] = "累計登入",
	[46002] = "關卡挑戰",
	[46003] = "精英挑戰",
	[46004] = "銅幣消耗",
	[46005] = "忍者成長",
	[46006] = "金幣消耗",
	[46007] = "競技戰鬥",
	[46008] = "咒印升級",
	[46009] = "挑戰任務",
	[46010] = "每日好禮",
	[46011] = "通靈修行",
	[46012] = "公會總動員",
	[46013] = "測試寶箱",
	[46014] = "測試積分",
	[46015] = "銅幣獲得",
}
-- 新招募系统
new_recruit_shop_str = {
	"每日購買上限：",		 -- 1
	"每週購買上限：",		 -- 2
	"每月購買上限：",		 -- 3
	"設定成功",		 -- 4
	"達到%d階時解鎖",	 -- 5
	"請選擇",		 -- 6
	"許願成功",		 -- 7
	"金幣不足，是否前往儲值？",	-- 8
	"抽取一次",			 -- 9
	"抽取十次",			 -- 10
	"未滿足兌換條件",    -- 11
	"召喚幣不足",    -- 12
	"您已無願望可許",    -- 13
	"Prompt",				-- 14
}
-- 战令系统文本
war_order_str = {
	"主線任務",		 -- 1
	"主線關卡",		 -- 2
	"精英關卡",		 -- 3
	"試練塔",		 -- 4
	"第%d關",	 -- 5
	"本服累計購買次數已達%d次",		 -- 6
	"普通商店",		 -- 7
	"特殊商店",	-- 8
	"每日購買上限:",			 -- 9
	"每週購買上限:",			 -- 10
	"期間購買上限:",    -- 11
	"終身購買上限:",    -- 12
	"道具不足",    -- 13
	"%Y年%m月%d日 %H時",		-- 14
	"%d級可用",			-- 15
	"1.數位通行證每期活動為30天。\r\n2.獲得經驗即可提升通行證等級並解鎖更多獎勵。\r\n3.數位通行證經驗可透過完成日常與每週任務或儲值取得，儲值經驗比例為1:65。\r\n4.連續購買三次數位通行證，即可獲得數位通行證啟用道具，可免費啟用一次高級獎勵。\r\n5.數位通行證獎勵分為普通獎勵與高級獎勵。普通獎勵在達到對應通行證等級後即可領取；高級獎勵需儲值或使用啟用道具，並達到對應通行證等級後才能領取。\r\n6.本服數位通行證購買次數達到指定數量時，全服玩家皆可獲得全服購買獎勵。\r\n7.設有普通商店與特殊商店，可使用普通通行證金幣與特殊通行證金幣兌換資源。\r\n8.數位通行證僅能啟用高級獎勵，不含鑽石。同時可獲得VIP經驗與通行證經驗，並計入累計儲值與儲值資源進度。",	-- 16
	"1.進度通行證分為兩種：主線任務與主線關卡。\r\n2.進度通行證可透過不同類型的條件完成並領取獎勵。\r\n3.進度通行證獎勵分為普通獎勵與高級獎勵。普通獎勵在達到對應通行證進度後即可領取；高級獎勵需儲值或使用啟用道具，並達到對應通行證進度後才能領取。\r\n4.本服進度通行證購買次數達到指定數量時，全服玩家皆可獲得全服購買獎勵。\r\n5.全服購買獎勵的購買次數僅在同類型通行證中累計，不同類型通行證的購買次數不共用。\r\n6.進度通行證僅能啟用高級獎勵，不含鑽石。同時可獲得VIP經驗與通行證經驗，並計入累計儲值與儲值資源進度。\r\n7.各階段的高級獎勵需分別購買啟用。",				----17
	"恭喜您獲得%d點戰令經驗",	-- 18
	"無購買次數",			-- 19	
	"您目前沒有可領取的獎勵",	-- 20
	"%d級",	-- 21
}
-- 服务器列表显示优化文本
tipStringInfo_sever_list = {
	"推薦伺服器",	-- 1 
	"%s-%s",		-- 2 服务器分类名称
	"全伺服器",	-- 3 
}
--字体颜色配置集合
tipStringInfo_color_type_assemble = {
	{60,75,156},				--1进阶材料金币消耗(足够时)
	{255,34,34},				--2进阶材料金币消耗(不足时)
	{60,75,156},				--3角色阵容羁绊词条(激活时)
	{137,160,220},				--4角色阵容羁绊词条(未激活时)
	{73,168,214},				--5数码兽筛选字体颜色（正常）
	{255,255,255},				--6数码兽筛选字体颜色（按下时）
	{255,34,34},				--7材料消耗字体颜色(不足时)
	{44,55,108},				--8觉醒材料字体颜色(足够时)
}
---------------------暗色字
dark_text_color = {
	{45,53,88},----------0白色
	{21,125,48},--------------1绿色
	{36,107,202},------------2蓝色
	{130,60,200},------------3紫色
	{227,123,60},------------4橙色
	{221,71,56},--------------5红色
	{220,160,0},------------6金色
}
--亮色字
bright_words_color = {
	cc.c3b(244,247,234),			---------------------1 品质白 R180 G180 B180
	cc.c3b(61,217,101),			---------------------2 品质绿 R10 G242 B32
	cc.c3b(71,177,226),				-----------------3 品质蓝 R10 G207 B242
	cc.c3b(181,108,255),			---------------------4 品质紫 R222 G70 B204
	cc.c3b(255,162,80),			---------------------5 品质橙 R204 G197 B11
	cc.c3b(255,96,80),				-----------------6 品质红 R239 G22 B22
	cc.c3b(254,231,61),				---------------------7 品质褐 R98 G55 B0
}
tipStringInfo_proup_title_text = {
	"Rulers",              -- 1、规则
}
tipStringInfo_rule_text = {
	"1.每日儲值達到對應金額即可獲得對應獎勵\r\n2.每日額度將於伺服器時間5:00清零，請留意每日刷新時間。\r\n3.每日累計額度依對應檔位的基礎額度計算，與額外獎勵無關。",    -- 1
}
-- 大富翁文本
tipStringInfo_richman = {
	"骰子數量不足",				-- 1 扔骰子时数量不足提示
	"請選擇獎勵",			-- 2 特殊奖励选择提示
	"%d級",				   -- 3 格子对应等级文本
	"任務獲得",					-- 4 骰子获取途径1（废弃）
	"禮包獲得",					-- 5 骰子获取途径2（废弃）
	"鑽石購買獲得",				-- 6 骰子获取途径3（废弃）
	"兌換次數不足",					--7 钻石购买骰子时，兑换次数不足提醒
	"接下來%s回合積分*%s",			--8 积分翻倍显示
	"1.大富翁棋盤共有18格，分為14個普通格與4個事件格。\r\n2.事件內容為獲得普通骰子*1、接下來3次擲骰積分*2、選擇指定格子（不可選擇事件格）。\r\n3.每次擲骰皆可獲得積分。普通骰子每次擲出獲得1分，幸運骰子每次擲出獲得2分，達到指定階段還可獲得額外獎勵。\r\n4.普通骰子可透過完成活動任務、鑽石購買與禮包購買取得，幸運骰子可透過禮包購買取得。\r\n5.活動結束後，未使用的普通骰子將以1:1000的比例回收為金幣，幸運骰子以1:2000的比例回收為金幣\r\n6.活動結束後，未領取的積分獎勵將透過郵件補發給玩家。可選獎勵若玩家未選擇，預設補發符合條件的道具。\r\n7.大富翁的14個普通格皆有等級，每落入一次該格就會升一級，滿級為6\r\n8.大富翁棋盤上的燈全部點亮時會觸發神秘大獎",				--9 规则文本
	"該獎勵可在%s檔位中選擇",					--10 选择可选奖励提示
	"尚未設定對應的骰子獲取活動",		 --11 没有特殊骰子获取活动提示
	"此積分獎勵已無可選次數",		 --12 没有可选奖励次数提示
	"無限次數",					--13 积分奖励无次数限制提示
}
-- 头像索引文本
tipStringInfo_face_text = {
	"獲得%s",				-- 1 头像和形象索引文本
	"第%d關",				-- 2 印记阶段文本
	"Wear",					-- 3 佩戴文本
	"使用",					-- 4 使用文本
	"目前頭像框使用中",	  -- 5 头像框印记界面佩戴提示文本
}
tipStringInfo_watch_ads_text = {
	"(%s/%s)",			             -- 1 观看视频标题,已看次数/总次数
	"今日成功觀看%s可額外獲得驚喜獎勵！",  -- 2 成功觀看多少次次可獲得額外獎勵
	"%s次",		                     -- 3 再观看的次数显示
	"（每週一5:00刷新）",			     -- 4 重置时间提示
	"今日觀看影片可免費獲得100體力",  -- 5 购买体力界面获得体力
	"%s/%s",						 -- 6 购买体力界面次数
	"廣告觀看失敗",					 -- 7 广告观看失败
	"廣告載入中，請稍後再試",	 -- 8 暂无广告提示
	"今日獎勵觀看次數已用完",	     -- 9 今日有奖观看次数已达上限提示
}
-- 战报统计文本
tipStringInfo_fight_report_detail_tips = {
	"%s(+%s)",				-- 1 排名上升文本
	"%s(-%s)",				-- 2 排名下降文本
}
-- 关闭充值功能文本
tipStringInfo_close_recharge_tips = {
	[1] = "儲值功能暫時關閉，開放時間請留意遊戲公告",
}

-- Fury: nombre de servidor que llega como SOLO el numero que ve el jugador
-- («2»): ProtocolParserCopy.lua lo compone con este formato.
tipStringInfo_server_name_format = "伺服器%s"

-- Codigos de regalo (punto 7.26): icono, ventana y boton de la ciudad
tipStringInfo_gift_codes = {
	"兌換碼",		-- 1 icono y titulo
	"永久有效",		-- 2 no caduca
	"%d天後過期",		-- 3 caduca en N dias
	"%d小時後過期",		-- 4 caduca en N horas
	"新！",		-- 5 codigo de hoy
	"已兌換",		-- 6 ya canjeado
	"點「兌換」會直接填入兌換碼介面。複製方法：點擊兌換碼，在鍵盤上方的輸入欄裡長按，選擇「複製」。",		-- 7 como copiar
	"暫時沒有可用的兌換碼。",		-- 8 lista vacia
	"兌換",		-- 9 boton canjear
}
-- Fury: la tienda de suscripciones (FurySubscriptionShop.lua, 29-sep-2026)
_fury_subscription_text = {
	"訂閱",		-- 1 icono y titulo
	"高級幣：%d",		-- 2 saldo
	"%d天",		-- 3 duracion
	"購買",		-- 4 boton comprar
	"生效中：剩餘%d天",		-- 5 activa
	"本週已購買",		-- 6 comprada esta semana
	"高級幣不足。",		-- 7 saldo corto
	"是否購買%s？需要%d高級幣。",		-- 8 confirmar compra
	"高級商店",		-- 9 boton tienda premium
	"規則",		-- 10 titulo de reglas
	"每日獎勵（VIP +%d%%）",		-- 11 premios del dia
	"價格：%d",		-- 12 precio
	"1. 使用高級幣購買禮包。",		-- 13 regla 1
	"2. 連續7天每天透過郵件領取獎勵，購買後立即收到第一封郵件。",		-- 14 regla 2
	"3. VIP等級越高，每日獎勵略多。顯示的數量已包含你的加成。",		-- 15 regla 3
	"4. 同一禮包不能同時生效兩次。",		-- 16 regla 4
	"5. 每個禮包每個遊戲週可購買一次（週一05:00重置）。",		-- 17 regla 5
	"6. 不同禮包可以同時生效。",		-- 18 regla 6
	"7. 高級幣來自「高級幣」活動：每次儲值對應檔位的禮包，可獲得其基礎金幣10%的高級幣。",		-- 19 regla 7
	"購買成功！今日獎勵已發送到信箱。",		-- 20 compra hecha
	"忍者禮包",		-- 21 nombre paquete 3
	"強化禮包",		-- 22 nombre paquete 4
	"至尊禮包",		-- 23 nombre paquete 5
}
-- Fury: la Tienda Premium (evento 70, 29-sep-2026), rotulo del tope que vuelve a cero
_fury_premium_shop_text = {
	"每日",		-- 1 tope diario
	"每週",		-- 2 tope semanal
}
-- Rango del heroe (sistema E, FuryHeroTitle.lua; docs/systems/rango_heroe.md)
_fury_hero_title_text = {
	"軍銜",		-- 1 boton y titulo
	"軍銜 %d/%d",		-- 2 rango actual/tope
	"當前",		-- 3 columna actual
	"下一級",		-- 4 columna siguiente
	"生命 +%d",		-- 5 vida
	"攻擊 +%d",		-- 6 ataque
	"防禦 +%d",		-- 7 defensa
	"升級需求",		-- 8 requisitos
	"提升軍銜",		-- 9 boton subir
	"已達最高軍銜",		-- 10 en el tope
	"軍銜徽章不足。",		-- 11 sin insignias
	"軍銜提升！",		-- 12 subida hecha
	"下忍",		-- 13 tramo 1-5
	"中忍",		-- 14 tramo 6-10
	"上忍",		-- 15 tramo 11-15
	"暗部",		-- 16 tramo 16-20
	"影級",		-- 17 tramo 21-25
	"火影",		-- 18 tramo 26-30
	"無軍銜",		-- 19 rango 0
}
-- Fury: el jefe interservidor, sistema D (FuryCrossBossWindow.lua)
_fury_cross_boss_text = {
	"宇智波鼬入侵",		-- 1 titulo e icono
	"規則",		-- 2 titulo de las reglas
	"1. 宇智波鼬每天20:00至21:00（伺服器時間）入侵。",		-- 3 regla 1
	"2. 每天可以攻擊3次：積分為你所有攻擊（每次5回合）造成的傷害總和。每次攻擊立即獲得獎勵。",		-- 4 regla 2
	"3. 所有伺服器的玩家在同一個傷害排行榜中競爭。",		-- 5 regla 3
	"4. 活動結束後獎勵透過郵件發放：排名靠前的玩家獲得排名獎勵，所有參與攻擊的玩家獲得參與獎勵。",		-- 6 regla 4
	"5. 宇智波鼬的血量由所有伺服器共享。即使血量為0，仍可繼續攻擊獲得積分。",		-- 7 regla 5
	"獎勵",		-- 8 titulo de premios
	"第%d名",		-- 9 un puesto
	"第%d-%d名",		-- 10 tramo de puestos
	"參與獎",		-- 11 participacion
	"每次攻擊",		-- 12 premio de cada ataque
	"今日攻擊：%d/%d",		-- 13 ataques de hoy
	"攻擊獎勵：%s",		-- 14 aviso del premio del golpe
}
-- Fury: el banner especial SR (FuryBannerSR.lua, sistema C, 29-sep-2026)
_fury_banner_sr_text = {
	"SR招募",		-- 1 icono y titulo
	"選擇SR",		-- 2 boton elegir
	"你的SR",		-- 3 cabecera sin SR
	"請先選擇一名SR英雄。",		-- 4 hay que elegir
	"選擇你的SR",		-- 5 titulo de la lista
	"已選擇",		-- 6 ya elegido
	"選擇",		-- 7 boton elegir de fila
	"SR名單刷新：%s",		-- 8 lista nueva en
	"規則",		-- 9 titulo de reglas
	"1. 從本週名單中選擇一名SR英雄，可隨時更換。",		-- 10 regla 1
	"2. 四個發光的SR格子給予所選SR的碎片，一個稀有格子給予2個高級幣；其餘格子給予少量金幣、金幣寶箱、銅幣和碎片。",		-- 11 regla 2
	"3. 每天3次免費單抽；之後每次消耗1張抽獎券或68金幣（10連680）。",		-- 12 regla 3
	"4. SR英雄名單每週更換（週一05:00）。",		-- 13 regla 4
	"5. 若你的SR離開名單，抽獎前請重新選擇。",		-- 14 regla 5
	"%s 獲得了 %s x%d",		-- 15 registro: quien, que, cuanto
	"暫無大獎紀錄，快來成為第一人！",		-- 16 registro vacio
}
-- Fury: las pociones del heroe, sistema K (FuryHeroPotion.lua, 29-sep-2026)
_fury_potion_text = {
	"藥水",		-- 1
	"生效中的藥水",		-- 2
	"沒有生效中的藥水",		-- 3
	"使用",		-- 4
	"擁有：%d",		-- 5
	"剩餘%s",		-- 6
	"攻擊 +%d",		-- 7
	"生命 +%d",		-- 8
	"防禦 +%d",		-- 9
	"替換該類型生效中的藥水？剩餘時間將會失去。",		-- 10
	"你沒有這種藥水。可在高級商店購買。",		-- 11
	"藥水已使用！",		-- 12
	"規則",		-- 13
	"1. 藥水可在數小時內為忍者提供額外的生命、攻擊或防禦。使用時會消耗背包中的一瓶。",		-- 14
	"2. 共有四種：力量（攻擊）、活力（生命）、防禦（防禦）和至尊（三項全加，各為一半）。",		-- 15
	"3. 每名忍者同一時間每種藥水只能有一瓶生效。不同種類可以疊加。",		-- 16
	"4. 使用同類型的另一瓶藥水會替換生效中的藥水，其剩餘時間將會失去。",		-- 17
	"5. 即使離線，時間也會流逝。時間結束後，加成消失。",		-- 18
	"6. 藥水在背包中不會過期。可在高級商店購買。",		-- 19
	"%d小時%d分",		-- 20
	"持續%s",		-- 21
}
-- Fury: los artefactos de companero, sistema F (FuryCompanionArtifact.lua, 29-sep-2026)
_fury_companion_artifact_text = {
	"神器",		-- 1 boton y titulo
	"等級 %d/%d",		-- 2 nivel/tope
	"未裝備神器",		-- 3 sin artefacto
	"當前",		-- 4 columna actual
	"下一等級",		-- 5 columna siguiente
	"生命 +%d",		-- 6 vida
	"攻擊 +%d",		-- 7 ataque
	"防禦 +%d",		-- 8 defensa
	"升級",		-- 9 boton subir
	"已滿級",		-- 10 nivel maximo
	"神器粉塵不足。",		-- 11 sin polvo
	"神器升級成功！",		-- 12 subida hecha
	"卸下",		-- 13 boton quitar
	"裝備神器",		-- 14 boton poner
	"背包中的神器",		-- 15 cabecera mochila
	"你沒有神器：可召喚或在高級商店購買。",		-- 16 mochila vacia
	"召喚 x1",		-- 17 invocar 1
	"召喚 x10",		-- 18 invocar 10
	"獲得：",		-- 19 resultado invocacion
	"技能：%s",		-- 20 habilidad
	"%d級開啟技能",		-- 21 habilidad cerrada
	"暴擊率 +%s%%",		-- 22 prop 8
	"抗暴率 +%s%%",		-- 23 prop 9
	"格擋率 +%s%%",		-- 24 prop 10
	"破格擋 +%s%%",		-- 25 prop 11
	"最終傷害 +%s%%",		-- 26 prop 33
	"傷害減免 +%s%%",		-- 27 prop 34
	"夥伴神器",		-- 28 titulo reglas
	"1. 每個忍者有一個神器欄位。裝備神器時會從背包取出；卸下或更換時會放回背包。",		-- 29 regla 1
	"2. 等級屬於忍者的欄位：更換神器等級不變。",		-- 30 regla 2
	"3. 使用神器粉塵升級：每級提升神器的生命、攻擊和防禦。",		-- 31 regla 3
	"4. 5級起開啟神器技能，並隨等級提升。所有戰鬥中生效。",		-- 32 regla 4
	"5. 可透過此處召喚、高級商店、主線和精英關卡以及活動獲得神器和粉塵。",		-- 33 regla 5
	"金幣不足。",		-- 34 sin diamantes
}
-- Fury: los prohibidores, sistema I (FuryProhibitor.lua; docs/systems/prohibidores.md)
_fury_prohibitor_text = {
	"禁器",		-- 1 titulo
	"召喚x%d",		-- 2 boton invocar
	"%d金幣",		-- 3 precio diamantes
	"%d張召喚券",		-- 4 precio billetes
	"召喚券：%d   禁器精華：%d",		-- 5 billetes y esencia
	"全體忍者：生命+%d  攻擊+%d  防禦+%d",		-- 6 total a todos
	"未激活",		-- 7 sin activar
	"星級 %d/%d",		-- 8 estrella
	"數量：%d",		-- 9 copias
	"啟動",		-- 10 activar
	"升星：%d精華",		-- 11 mejorar
	"分解",		-- 12 convertir
	"已滿星",		-- 13 tope
	"規則",		-- 14 titulo reglas
	"1. 使用金幣召喚禁器：單抽68，十連680。召喚券足夠時優先消耗召喚券（每次1張）。",		-- 15 regla 1
	"2. 各品質機率：",		-- 16 regla 2
	"3. 獲得的禁器進入背包。在此消耗1個即可激活：其生命、攻擊、防禦加成給全體忍者。",		-- 17 regla 3
	"4. 多餘的禁器可分解為禁器精華。精華可提升已激活禁器的星級及屬性。",		-- 18 regla 4
	"5. 召喚券和禁器精華也可在高級商店購買。",		-- 19 regla 5
	"獲得：%s",		-- 20 obtenido
	"是否將%d個分解為%d禁器精華？",		-- 21 confirmar convertir
	"普通",		-- 22 calidad 1
	"稀有",		-- 23 calidad 2
	"史詩",		-- 24 calidad 3
	"傳說",		-- 25 calidad 4
	"生命+%d  攻擊+%d  防禦+%d",		-- 26 atributos de fila
}
-- Fury: las cronicas, sistema G (FuryChronicle.lua, 29-sep-2026)
_fury_chronicle_text = {
	"編年史",		-- 1 titulo, icono y boton
	"編年史書頁：%d",		-- 2 paginas que tiene
	"全局編年史",		-- 3 cronica global
	"全體忍者加成",		-- 4 subtitulo global
	"僅此忍者加成",		-- 5 subtitulo del guerrero
	"等級 %d/%d",		-- 6 nivel / tope
	"生命+%d  攻擊+%d  防禦+%d",		-- 7 atributos de ahora
	"下一級：生命 +%d  攻擊 +%d  防禦 +%d",		-- 8 atributos del siguiente
	"升級",		-- 9 boton subir
	"已滿級",		-- 10 al tope
	"編年史書頁不足。",		-- 11 sin paginas
	"編年史已升級！",		-- 12 subida hecha
	"規則",		-- 13 titulo de reglas
	"1. 全局編年史為你的全體忍者提供生命、攻擊和防禦。",		-- 14 regla 1
	"2. 每名忍者都有自己的編年史：其加成只作用於該忍者。可在此處或忍者介面（編年史按鈕）打開。",		-- 15 regla 2
	"3. 兩者都用編年史書頁升級。等級越高，消耗的書頁越多，加成也越大。",		-- 16 regla 3
	"4. 通過召喚、在主線副本中獲勝和領取活動獎勵（各有每日上限）可獲得書頁，高級商店也有出售。",		-- 17 regla 4
	"5. 加成會立即計入忍者的屬性和戰力。",		-- 18 regla 5
}
-- Fury: las torres diaria y semanal (FuryTowers.lua, 29-sep-2026)
_fury_tower_text = {
	"每日之塔",		-- 1
	"每週之塔",		-- 2
	"第%d/%d層",		-- 3
	"%s後重置",		-- 4
	"挑戰",		-- 5
	"雙倍獎勵",		-- 6
	"削弱",		-- 7
	"重置高塔",		-- 8
	"每日排行",		-- 9
	"價格：%d",		-- 10
	"本層已生效",		-- 11
	"本層已使用",		-- 12
	"花費%d高級幣為本層購買雙倍獎勵？",		-- 13
	"花費%d高級幣削弱本層敵人（生命和攻擊減半）？",		-- 14
	"花費%d高級幣將每週之塔重置到第1層？",		-- 15
	"高級幣不足。",		-- 16
	"本層已購買過。",		-- 17
	"本週的每週重置已使用。",		-- 18
	"請先從高塔開始挑戰。",		-- 19
	"戰鬥時間太短，請重試。",		-- 20
	"高塔已通關！請在重置後再來。",		-- 21
	"暫時沒有可重置的內容。",		-- 22
	"此塔每天自動重置。",		-- 23
	"高級幣：%d",		-- 24
	"每日排行 - 前50名",		-- 25
	"我的排名：第%d名（第%d層）",		-- 26
	"暫未上榜",		-- 27
	"第%d名  %s  - 第%d層",		-- 28
	"高塔規則",		-- 29
	"1. 按順序通關各層，每通關一層即可獲得該層獎勵。",		-- 30
	"2. 挑戰次數不限：失敗後仍停留在目前層。",		-- 31
	"3. 雙倍獎勵：下一次通關的樓層獎勵翻倍。每層限一次。",		-- 32
	"4. 削弱：下一層敵人的生命和攻擊減半，直到你通關該層。每層限一次。",		-- 33
	"5. 兩者皆使用高級幣支付。",		-- 34
	"6. 每日之塔：共100層，免費，每天05:00重置。每日排行：按最高樓層排名，同層先到者在前。僅顯示前50名，且僅前50名在當天結束時透過郵件獲得獎勵。",		-- 35
	"6. 每週之塔：共200層，每週一05:00重置。每週可付費一次重置到第1層，再次獲得各層獎勵。",		-- 36
	"排名獎勵（每日結束時透過郵件發放）",		-- 37
	"第%d名",		-- 38
	"第%d-%d名",		-- 39
}
-- Fury: las gemas del heroe, sistema M (FuryHeroGem.lua, 29-sep-2026)
_fury_hero_gem_text = {
	"寶石",		-- 1 titulo y boton
	"生命槽位",		-- 2 hueco vida
	"攻擊槽位",		-- 3 hueco ataque
	"防禦槽位",		-- 4 hueco defensa
	"空",		-- 5 vacio
	"卸下",		-- 6 quitar
	"鑲嵌",		-- 7 engastar
	"合成寶石",		-- 8 combinar
	"我的寶石",		-- 9 tus gemas
	"你沒有寶石。可在此召喚，或在高級商店購買。",		-- 10 sin gemas
	"生命 +%d",		-- 11 vida
	"攻擊 +%d",		-- 12 ataque
	"防禦 +%d",		-- 13 defensa
	"召喚 x1",		-- 14 invocar 1
	"召喚 x10",		-- 15 invocar 10
	"獲得：",		-- 16 obtenido
	"合成 %d → 1（下一級）",		-- 17 combinar n
	"已滿級",		-- 18 nivel maximo
	"該忍者的寶石加成：",		-- 19 bono del guerrero
	"6個槽位：生命2個、攻擊2個、防禦2個。寶石只能鑲嵌在同類槽位；沒有空槽位時替換最弱的寶石。相同的寶石可合成為更高一級的寶石。",		-- 20 reglas
	"寶石合成成功！",		-- 21 combinadas
	"寶石不足，無法合成。",		-- 22 faltan gemas
}
-- Fury: pergaminos del heroe, sistema J (FuryHeroScroll.lua)
_fury_hero_scroll_text = {
	"卷軸",		-- 1 boton y titulo
	"等級 %d/%d",		-- 2 nivel/tope
	"未裝備卷軸",		-- 3 sin pergamino
	"生命 +%d",		-- 4 vida
	"攻擊 +%d",		-- 5 ataque
	"防禦 +%d",		-- 6 defensa
	"下一等級",		-- 7 siguiente nivel
	"強化",		-- 8 boton mejorar
	"已滿級",		-- 9 en el tope
	"卸下",		-- 10 boton quitar
	"裝備神器",		-- 11 boton equipar
	"擁有：%d",		-- 12 cuantos hay
	"卷軸墨水不足。",		-- 13 sin tinta
	"完成！",		-- 14 hecho
	"你的卷軸",		-- 15 lista
	"等級屬於該忍者的欄位，更換卷軸時保留。",		-- 16 regla del nivel
}

-- Sistema L: runas del heroe (FuryHeroRune.lua; docs/systems/runas_heroe.md).
_fury_rune_text = {
	"符文",		-- 1 boton y titulo
	"槽位%d",		-- 2 ranura
	"空槽位",		-- 3 vacia
	"未解鎖：忍者%d級",		-- 4 cerrada por nivel
	"未解鎖：忍者%d級且升星%d次",		-- 5 cerrada por nivel y estrellas
	"卸下符文",		-- 6 quitar
	"鑲嵌符文",		-- 7 engarzar
	"合成符文",		-- 8 fusionar
	"擁有符文：%d",		-- 9 cuantas tiene
	"符文粉塵：%d",		-- 10 polvo
	"合成：%d個相同符文+%d符文粉塵",		-- 11 coste fusion
	"召喚符文x1",		-- 12 invocar 1
	"召喚符文x10",		-- 13 invocar 10
	"沒有空的符文槽位：請先卸下一個符文。",		-- 14 sin ranura libre
	"符文或符文粉塵不足，無法合成。",		-- 15 faltan para fusionar
	"符文鑲嵌成功！",		-- 16 engarzada
	"獲得符文：",		-- 17 obtenido
	"我的符文",		-- 18 mis runas
	"你沒有符文。可透過召喚、高級商店或精英關卡獲得。",		-- 19 sin runas
	"已鑲嵌符文",		-- 20 ya engarzada, en el heroe
	"符文加成：生命+%d 攻擊+%d 防禦+%d",		-- 21 rune stats
}
-- Fury: el arbol de pasivas, sistema H (FuryHeroPassiveTree.lua; docs/systems/arbol_pasivas.md)
_fury_passive_tree_text = {
	"被動之樹",		-- 1 titulo y boton
	"節點 %d/%d",		-- 2 nodos abiertos
	"聖樹之果：%d",		-- 3 frutos que tiene
	"總加成",		-- 4 total
	"生命 +%d",		-- 5 vida
	"攻擊 +%d",		-- 6 ataque
	"防禦 +%d",		-- 7 defensa
	"速度 +%d",		-- 8 velocidad
	"暴擊率 +%d%%",		-- 9 pasiva 8
	"抗暴率 +%d%%",		-- 10 pasiva 9
	"格擋率 +%d%%",		-- 11 pasiva 10
	"破格擋 +%d%%",		-- 12 pasiva 11
	"最終傷害 +%d%%",		-- 13 pasiva 33
	"傷害減免 +%d%%",		-- 14 pasiva 34
	"分支 %s",		-- 15 rama
	"節點 %d",		-- 16 nodo
	"解鎖",		-- 17 boton desbloquear
	"已全部解鎖",		-- 18 arbol completo
	"重置",		-- 19 boton reiniciar
	"花費%d金幣重置被動之樹？返還%d個聖樹之果（兩不返還）。",		-- 20 confirmar reinicio
	"聖樹之果不足。",		-- 21 sin frutos
	"節點已解鎖！",		-- 22 nodo abierto
	"已重置被動之樹。",		-- 23 reiniciado
	"暫無加成",		-- 24 sin bonus
	"聖樹之果：召喚、主線副本勝利、活動獎勵（每日上限）以及高級商店。",		-- 25 de donde salen
}
-- Fury: el evento Monedas Premium (179, 30-sep-2026; docs/systems/evento_monedas_premium.md)
_fury_premium_event_text = {
	"高級幣",		-- 1 titulo e icono
	"1. 儲值列表中對應檔位的禮包，即可獲得該檔位基礎金幣10%的高級幣（翻倍的金幣不計入）。",		-- 2 regla 1
	"2. 每次儲值可領取一次獎勵；每個檔位每天最多99次，次數每日重置。月卡不計入。",		-- 3 regla 2
}
-- Fury: el boton «Mejoras» de la ficha del heroe y su panel (30-sep-2026; docs/systems/marco_heroe.md)
_fury_hero_extras_text = {
	"強化",		-- 1 boton y titulo del panel
	"%d級",		-- 2 nivel minimo de un boton bloqueado
}
-- Fury: el pase de temporada (sistema 15, 30-sep-2026; docs/systems/pase_temporada.md)
_fury_season_pass_text = {
	"賽季通行證",		-- 1 titulo e icono
	"第%d賽季",		-- 2 temporada
	"剩餘%d天",		-- 3 dias que quedan
	"等級 %d/%d",		-- 4 nivel
	"通行證積分：%d/%d",		-- 5 puntos hacia el siguiente nivel
	"高級：已啟用",		-- 6 premium activo
	"解鎖高級",		-- 7 boton desbloquear
	"花費%d高級幣解鎖本賽季高級通行證？",		-- 8 confirmar desbloqueo
	"高級幣不足。",		-- 9 sin monedas
	"高級通行證已解鎖！",		-- 10 desbloqueado
	"每日任務",		-- 11 cabecera diarias
	"每週任務",		-- 12 cabecera semanales
	"等級獎勵",		-- 13 cabecera premios
	"免費通行證",		-- 14 camino gratis
	"高級通行證",		-- 15 camino premium
	"領取",		-- 16 boton cobrar
	"全部領取",		-- 17 boton cobrar todo
	"已全部領取",		-- 18 todo cobrado
	"獎勵已領取！",		-- 19 premios cobrados
	"+%d積分",		-- 20 puntos de una mision
	"已達成",		-- 21 mision hecha
	"高級幣：%d",		-- 22 saldo de monedas
	"已滿級",		-- 23 nivel maximo
	"規則",		-- 24 titulo de reglas
	"1. 每個賽季持續30天。結束後會自動開始帶有新獎勵的新賽季。",		-- 25 regla 1
	"2. 完成每日和每週任務會立即獲得通行證積分，無需領取。積分可以提升通行證等級。",		-- 26 regla 2
	"3. 每個等級都有免費獎勵和高級獎勵。高級獎勵需要用高級幣解鎖高級通行證（僅限當前賽季）。",		-- 27 regla 3
	"4. 請在此視窗領取獎勵。賽季結束時，未領取的獎勵將會失效。",		-- 28 regla 4
	"5. 每日任務每天5:00重置，每週任務每週一5:00重置。",		-- 29 regla 5
	"6. 高級幣可在「高級幣」活動（儲值）中獲得。",		-- 30 regla 6
	"登入遊戲",		-- 31 mision 31 entrar
	"競技挑戰",		-- 32 mision 32 arena
	"召喚忍者",		-- 33 mision 33 invocar
	"劇情關卡戰鬥",		-- 34 mision 34 historia
	"消耗體力",		-- 35 mision 35 aguante
	"冒險挑戰",		-- 36 mision 36 aventura
	"競技場勝利",		-- 37 mision 37 victorias arena
	"精英關卡戰鬥",		-- 38 mision 38 elite
	"金幣消耗",		-- 39 mision 39 diamantes
	"蛇道試煉戰鬥",		-- 40 mision 40 torre de pruebas
}
-- Fury: los hitos del servidor (sistema 19, 30-sep-2026; docs/systems/hitos_servidor.md)
_fury_server_milestone_text = {
	"全服里程碑",		-- 1 titulo e icono
	"賽季剩餘：%s",		-- 2 fin de temporada
	"召喚次數",		-- 3 metrica 1 invocaciones
	"競技場戰鬥",		-- 4 metrica 2 arena
	"儲值金幣",		-- 5 metrica 3 diamantes recargados
	"全服戰力",		-- 6 metrica 4 poder
	"已達成！獎勵已透過郵件發放",		-- 7 tramo alcanzado
	"目標：%s",		-- 8 meta
	"進行中",		-- 9 tramo pendiente
	"規則",		-- 10 titulo de reglas
	"1. 本服所有玩家共同推進相同的目標：召喚、競技場戰鬥、儲值金幣和戰力。",		-- 11 regla 1
	"2. 本服達成一個目標時，本服每一位玩家都會透過郵件收到一次獎勵。",		-- 12 regla 2
	"3. 同一賽季中後來加入的玩家，也會收到已達成目標的獎勵。",		-- 13 regla 3
	"4. 每個賽季為期一個月，於每月1日5:00（伺服器時間）開始。每個賽季計數從零重新開始。",		-- 14 regla 4
	"5. 全服戰力為本服最強玩家的戰力總和（戰力排行榜）。",		-- 15 regla 5
	"%d天 %02d:%02d",		-- 16 formato dias horas minutos
}
-- Fury: invita a un amigo (FuryInviteFriend.lua, 30-sep-2026; docs/systems/invita_amigo.md)
_fury_invite_text = {
	"邀請好友",		-- 1
	"我的邀請碼：%s",		-- 2
	"點擊邀請碼即可複製：在鍵盤上方的輸入欄中長按並選擇「複製」。",		-- 3
	"有獎勵的邀請：%d/%d",		-- 4
	"好友邀請碼",		-- 5
	"確定",		-- 6
	"填寫邀請碼剩餘時間：%s",		-- 7
	"邀請人：%s",		-- 8
	"只有新角色（建立3天內且低於20級）才能填寫好友的邀請碼。",		-- 9
	"%d級：邀請人獎勵",		-- 10
	"%d級：被邀請好友獎勵",		-- 11
	"我邀請的好友",		-- 12
	"還沒有邀請好友，快分享你的邀請碼吧！",		-- 13
	"%s - %d級",		-- 14
	"獎勵已發放至%d級",		-- 15
	"你沒有獎勵（已達上限）",		-- 16
	"邀請碼綁定成功！升級時你們雙方都會透過郵件獲得獎勵。",		-- 17
	"本伺服器不存在該邀請碼。",		-- 18
	"不能使用自己的邀請碼、本帳號的邀請碼或你邀請的人的邀請碼。",		-- 19
	"你已經有邀請人了。",		-- 20
	"你的角色已不是新角色：只能在建立後3天內且20級之前填寫邀請碼。",		-- 21
	"請輸入6位邀請碼。",		-- 22
	"規則",		-- 23
	"1. 每位玩家都有專屬邀請碼：分享給你的好友吧。",		-- 24
	"2. 新角色（建立3天內且低於20級）可以填寫同一伺服器玩家的邀請碼，僅限一次。一個帳號只能有一個邀請人。",		-- 25
	"3. 被邀請的好友達到20級、40級和60級時，你們雙方都會透過郵件獲得獎勵。",		-- 26
	"4. 邀請人最多可因%d位被邀請好友獲得獎勵。",		-- 27
	"%d天%d小時",		-- 28
	"輸入邀請碼",		-- 29 seccion introducir
	"1. 好友把他的邀請碼告訴你（你的在上方）。",		-- 30 paso 1
	"2. 在這裡輸入並點擊確認：僅限創建後3天內且20級前。",		-- 31 paso 2
	"3. 達到20、40、60級時，你們兩人都會透過郵件獲得獎勵。",		-- 32 paso 3
}
-- Fury: las ofertas relampago (FuryFlashOffers.lua, 30-sep-2026)
_fury_flash_offers_text = {
	"閃電特惠",		-- 1
	"高級幣：%d",		-- 2
	"%s後結束",		-- 3
	"%s後刷新特惠",		-- 4
	"購買",		-- 5
	"商品已售罄",		-- 6
	"剩餘：%d/%d",		-- 7
	"高級幣不足。",		-- 8
	"是否購買%s？需要%d高級幣。",		-- 9
	"購買成功！",		-- 10
	"規則",		-- 11
	"1. 每天會多次限時出現折扣禮包，持續數小時。所有玩家看到的禮包相同，每輪都會更換。",		-- 12
	"2. 使用高級幣購買。每個禮包在每輪中都有每位玩家的購買上限。",		-- 13
	"目前沒有特惠",		-- 14
	"閃電禮包",		-- 15
}
-- Fury: el pase de energia semanal (FuryEnergyPass.lua, 30-sep-2026; docs/systems/pase_energia.md)
_fury_energy_pass_text = {
	"體力通行證",		-- 1
	"每日體力 + 1次免費補滿",		-- 2
	"免費補滿",		-- 3
	"體力已補滿！",		-- 4
	"體力通行證已啟用！今日的額外體力已發放。",		-- 5
	"8. 體力通行證：使用高級幣購買，持續%d天（含購買當天）。同一時間只能有一個生效；結束後可再次購買。",		-- 6
	"9. 生效期間：每個遊戲日體力+%d（登入或打開本商店時發放），並且每天可免費補滿一次體力，直至目前等級上限。每日05:00刷新。",		-- 7
}
